<!DOCTYPE html>
<html>
<head>
  
  <title>JavaScript &#x88AB;&#x5FFD;&#x89C6;&#x7684;&#x7EC6;&#x8282;</title>
  
</head>
<body>

<div id="wrap">
  <h1>JavaScript &#x88AB;&#x5FFD;&#x89C6;&#x7684;&#x7EC6;&#x8282;</h1>
  <div id="content"><p>&#x300A;JavaScript &#x6743;&#x5A01;&#x6307;&#x5357;&#x300B;&#x8FD9;&#x672C;&#x4E66;&#x4ECE;&#x7B2C;&#x56DB;&#x7248;&#x5F00;&#x59CB;&#xFF0C;&#x4E00;&#x76F4;&#x5230;&#x7B2C;&#x516D;&#x7248;&#xFF0C;&#x6BCF;&#x4E2A;&#x7248;&#x672C;&#x6211;&#x90FD;&#x9010;&#x5B57;&#x9010;&#x53E5;&#x8BFB;&#x8FC7;&#x51E0;&#x904D;&#xFF0C;&#x7136;&#x800C;&#x6BCF;&#x4E00;&#x904D;&#x4E0B;&#x6765;&#x7684;&#x611F;&#x53D7;&#x5374;&#x5B8C;&#x5168;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x4E0A;&#x4E0A;&#x5468;&#x7684;&#x5468;&#x4E00;&#xFF0C;&#x518D;&#x6B21;&#x7FFB;&#x5F00;&#x4E86;&#x8FD9;&#x672C;&#x7280;&#x725B;&#x4E66;&#xFF0C;&#x8FD9;&#x4E00;&#x6B21;&#x6211;&#x662F;&#x5E26;&#x7740;&#x6279;&#x5224;&#x7CBE;&#x795E;&#x548C;&#x7814;&#x7A76;&#x7CBE;&#x795E;&#x8FC7;&#x6765;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x770B;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x5199;&#x4E0B;&#x4E86;&#x4E00;&#x4E9B;&#x611F;&#x53D7;&#x548C;&#x7B14;&#x8BB0;&#xFF0C;&#x90FD;&#x662F;&#x4E9B;&#x5BB9;&#x6613;&#x88AB;&#x5FFD;&#x7565;&#x7684;&#x70B9;&#xFF0C;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x7280;&#x725B;&#x4E66;&#x4E0A;&#x4E0D;&#x4E00;&#x5B9A;&#x6709;&#x63D0;&#x5230;&#x3002;</p>
<p>&#x4E4B;&#x524D;&#x90FD;&#x53D1;&#x5728; <a href="http://weibo.com/hustskyking" target="_blank" rel="external">&#x5FAE;&#x535A;</a> &#x4E0A;&#xFF0C;&#x7A0D;&#x5FAE;&#x6574;&#x7406;&#x4E86;&#x4E00;&#x756A;&#xFF0C;&#x653E;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x65B9;&#x4FBF;&#x9605;&#x8BFB;&#x3002;</p>
<a id="more"/>
<h3 id="&#x4E00;&#x4E9B;&#x5C0F;&#x70B9;">&#x4E00;&#x4E9B;&#x5C0F;&#x70B9;</h3><p><strong>&#x8BED;&#x53E5;/&#x8868;&#x8FBE;&#x5F0F;</strong></p>
<p>&#x6362;&#x4E2A;&#x89D2;&#x5EA6;&#x7406;&#x89E3;&#x8BED;&#x53E5;&#xFF08;statemaents&#xFF09;&#x548C;&#x8868;&#x8FBE;&#x5F0F;&#xFF08;expressions&#xFF09;&#xFF1A;&#x8868;&#x8FBE;&#x5F0F;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x7A0B;&#x5E8F;&#x7684;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x8BED;&#x53E5;&#x4F1A;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x53EB;&#x505A;&#x8868;&#x8FBE;&#x5F0F;&#x8BED;&#x53E5;&#xFF0C;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x8868;&#x8FBE;&#x5F0F;&#x548C;&#x8BED;&#x53E5;&#x7684;&#x4EA4;&#x96C6;&#xFF0C;&#x5982; <code>({a:1})</code>&#x3001;<code>&quot;use strict;&quot;</code>&#x7B49;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x6CA1;&#x5FC5;&#x8981;&#x6B7B;&#x6263;&#xFF0C;&#x610F;&#x4E49;&#x4E0D;&#x5927;&#x3002;</p>
<p><strong>&#x5B57;&#x7B26;&#x96C6;</strong></p>
<p>ES3 &#x8981;&#x6C42; JS &#x5FC5;&#x987B;&#x5B9E;&#x73B0; Unicode 2.1 &#x53CA;&#x540E;&#x7EED;&#x7248;&#x672C;&#xFF0C;&#x800C; ES5 &#x53EA;&#x8981;&#x6C42;&#x652F;&#x6301; Unicode 3 &#x53CA;&#x540E;&#x7EED;&#x7248;&#x672C;&#x3002;Unicode &#x5B57;&#x7B26; 2005 &#x5E74;&#x8D85;&#x8FC7;&#x4E86;&#x5341;&#x4E07;&#x5B57;&#x7B26;&#xFF0C;&#x81F3;&#x4ECA;&#x4ECD;&#x5728;&#x4E0D;&#x65AD;&#x589E;&#x4FEE;&#xFF0C;&#x6700;&#x65B0;&#x7248;&#x672C;&#x662F; 8.0&#x3002;</p>
<p><strong>&#x5206;&#x53F7;</strong></p>
<p>&#x5982;&#x679C;&#x4F60;&#x5199; JS &#x4EE3;&#x7801;&#x4E0D;&#x559C;&#x6B22;&#x5E26;&#x5206;&#x53F7;&#xFF0C;&#x800C;&#x53C8;&#x641E;&#x4E0D;&#x6E05;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5FC5;&#x987B;&#x52A0;&#x5206;&#x53F7;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x505A;&#xFF1A;&#x5728;&#x4EE5;  &#x201C;(&#x201C;&#x3001;&#x201D;[&#x201C; &#x3001;&#x201D;/&#x201C;&#x3001;&#x201D;+&#x201D;&#x3001;&#x201D;-&#x201C; &#x5F00;&#x5934;&#x7684;&#x8BED;&#x53E5;&#x524D;&#x9762;&#x90FD;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x5206;&#x53F7;&#xFF0C;&#x5982; <code>;(a + b).toString()</code>&#x3002;</p>
<p><strong>&#x8FDB;&#x5236;</strong></p>
<p>ES5 &#x4E25;&#x683C;&#x6A21;&#x5F0F;&#x4E2D;&#x7981;&#x6B62;&#x4F7F;&#x7528;&#x516B;&#x8FDB;&#x5236;&#x3002;&#x76EE;&#x524D;&#x5404;&#x79CD;&#x5F15;&#x64CE;&#x5BF9; JS &#x7684;&#x5B9E;&#x73B0;&#x662F;&#x5B58;&#x5728;&#x5DEE;&#x5F02;&#x7684;&#xFF0C;&#x90E8;&#x5206;&#x652F;&#x6301;&#x516B;&#x8FDB;&#x5236;&#xFF0C;&#x90E8;&#x5206;&#x4E0D;&#x652F;&#x6301;&#x3002;&#x516B;&#x8FDB;&#x5236;&#x88AB;&#x7981;&#x6B62;&#x7684;&#x539F;&#x56E0;&#xFF1A;String &#x548C; Number &#x4E4B;&#x95F4;&#x7ECF;&#x5E38;&#x88AB;&#x76F8;&#x4E92;&#x8F6C;&#x6362;&#xFF0C;&#x800C;&#x4EE5; <code>0</code> &#x5F00;&#x5934;&#x7684;&#x516B;&#x8FDB;&#x5236;&#x6570;&#x636E;&#x7279;&#x522B;&#x5BB9;&#x6613;&#x8BA9;&#x4EBA;&#x8FF7;&#x60D1;&#xFF0C;&#x4E5F;&#x5BB9;&#x6613;&#x8BA9;&#x673A;&#x5668;&#x8FF7;&#x60D1;&#xFF0C;&#x6BD4;&#x5982; <code>09</code> &#x662F;&#x8BE5;&#x88AB;&#x8F6C;&#x6362;&#x6210; 9 &#x8FD8;&#x662F;&#x76F4;&#x63A5;&#x62A5;&#x9519;&#xFF1F;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x4E0D;&#x5B58;&#x5728;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5982; 0x98&#x3002;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x53C2;&#x9605; <a href="http://stackoverflow.com/questions/30386993/why-in-javascript-does-10-010-result-in-false" target="_blank" rel="external">&#x8FD9;&#x91CC;</a>&#x3002;</p>
<p><strong>&#x7CBE;&#x5EA6;</strong></p>
<p>JS &#x91C7;&#x7528; IEEE-754 &#x6D6E;&#x70B9;&#x6570;&#x8868;&#x793A;&#x6CD5;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x4E8C;&#x8FDB;&#x5236;&#x8868;&#x793A;&#x6CD5;&#xFF0C;&#x7531;&#x4E8E;&#x7CBE;&#x5EA6;&#x539F;&#x56E0; JS &#x4E0D;&#x80FD;&#x8868;&#x793A;&#x6240;&#x6709;&#x7684;&#x5B9E;&#x6570;&#x3002;&#x5B83;&#x80FD;&#x5C55;&#x793A;&#x7684;&#x6D6E;&#x70B9;&#x6570;&#x4E2A;&#x6570;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x5B83;&#x4E0D;&#x80FD;&#x51C6;&#x786E;&#x5730;&#x8868;&#x793A;&#x4E09;&#x5206;&#x4E4B;&#x4E00;&#x7684;&#x6570;&#x503C;&#x5B57;&#x9762;&#x91CF;&#x3002;&#x8FD9;&#x4E5F;&#x5BFC;&#x81F4;&#x4E86;&#x5B83;&#x5728;&#x6D6E;&#x70B9;&#x6570;&#x7684;&#x8BA1;&#x7B97;&#x4E0A;&#x5B58;&#x5728;&#x8BEF;&#x5DEE;&#xFF0C;&#x5982; <code>0.3-0.2 != 0.2-0.1</code>&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x8BA1;&#x7B97;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5B58;&#x5728;&#x6570;&#x636E;&#x7684;&#x6EA2;&#x51FA;&#xFF0C;&#x4E22;&#x5931;&#x4E86;&#x7CBE;&#x5EA6;&#x3002;</p>
<p><img src="./resource/f391c41a4bd6.jpg" alt=""/></p>
<p><strong>null/undefined</strong></p>
<p>&#x7CFB;&#x7EDF;&#x7EA7;&#x3001;&#x51FA;&#x4E4E;&#x610F;&#x6599;&#x7684;&#x6216;&#x8005;&#x7C7B;&#x4F3C;&#x9519;&#x8BEF;&#x7684;&#x503C;&#x7684;&#x7A7A;&#x7F3A;&#x4F7F;&#x7528; undefined&#xFF0C;&#x800C;&#x7A0B;&#x5E8F;&#x7EA7;&#x3001;&#x6B63;&#x5E38;&#x7684;&#x6216;&#x610F;&#x6599;&#x4E4B;&#x4E2D;&#x7684;&#x503C;&#x7684;&#x7A7A;&#x7F3A;&#x4F7F;&#x7528; null&#x3002;&#x5E73;&#x65F6;&#x7F16;&#x7A0B;&#x7ED9;&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#x65F6;&#xFF0C;&#x4E0D;&#x8981;&#x4F7F;&#x7528; undefined &#x800C;&#x5E94;&#x8BE5;&#x7528; null&#x3002;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F; ES3 &#x4E2D;&#x7684; undefined &#x662F;&#x53EF;&#x4EE5;&#x88AB;&#x91CD;&#x65B0;&#x8D4B;&#x503C;&#x7684;&#xFF0C;ES5 &#x4FEE;&#x590D;&#x4E86;&#x8FD9;&#x4E2A; bug&#x3002;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x4F7F;&#x7528; void 0 &#x6765;&#x8FD8;&#x539F;/&#x4EE3;&#x66FF; undefined &#x7684;&#x503C;&#x3002;</p>
<p><strong>eval</strong></p>
<p>eval &#x662F;&#x4E2A;&#x4E0D;&#x597D;&#x628A;&#x63E1;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5B83;&#x5728; ES3 &#x4E2D;&#x66F4;&#x50CF;&#x662F; Function&#xFF0C;&#x800C;&#x5728; ES5 &#x4E2D;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x8FD0;&#x7B97;&#x7B26;&#xFF08;&#x4E25;&#x683C;&#x6A21;&#x5F0F;&#x4E0B;&#x4E0D;&#x5141;&#x8BB8;&#x8BBE;&#x7F6E;&#x522B;&#x540D;&#xFF0C;&#x5426;&#x5219;&#x62A5;&#x9519;&#xFF0C;&#x4E14;&#x5C06;&#x5176;&#x4F5C;&#x4E3A;&#x4FDD;&#x7559;&#x5B57;&#xFF09;&#x3002;&#x5B9E;&#x9645;&#x4E0A; ES3 &#x4E2D;&#x4E5F;&#x4E0D;&#x5141;&#x8BB8;&#x7ED9; eval &#x8BBE;&#x7F6E;&#x522B;&#x540D;&#xFF0C;&#x7136;&#x800C;&#x5F88;&#x591A;&#x5B9E;&#x73B0;&#x5374;&#x4F9D;&#x7136;&#x5141;&#x8BB8;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x4F5C;&#x4E3A;&#x5168;&#x5C40;&#x4EE3;&#x7801;&#x6765;&#x6267;&#x884C;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x5C24;&#x5176;&#x662F; IE &#x5BF9;&#x5B83;&#x5B9E;&#x73B0;&#x76F8;&#x5F53;&#x6DF7;&#x4E71;&#xFF0C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x89C4;&#x5F8B;&#x53EF;&#x5FAA;&#xFF0C;&#x4E0D;&#x8FC7; IE &#x4E2D;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A; execScript &#x51FD;&#x6570;&#xFF0C;&#x7C7B;&#x4F3C;&#x5168;&#x5C40;&#x7684; eval&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x6BCF;&#x6B21;&#x6267;&#x884C;&#x90FD;&#x4F1A;&#x8FD4;&#x56DE; null&#x3002;</p>
<p>&#x9700;&#x8981;&#x4F7F;&#x7528; eval &#x7684;&#x573A;&#x666F;&#x5E76;&#x4E0D;&#x591A;&#xFF0C;&#x5C3D;&#x91CF;&#x5C11;&#x7528;&#xFF0C;&#x4E00;&#x822C;&#x9700;&#x6C42;&#x4F7F;&#x7528; new Function &#x5C31;&#x80FD;&#x6EE1;&#x8DB3;&#x3002;</p>
<p><strong>&#x5F15;&#x7528;</strong></p>
<p>&#x5220;&#x9664;&#x5C5E;&#x6027;&#x5B58;&#x5728;&#x7684;&#x5751;&#xFF1A;<code>a = {n: {x: 2}}, b = a.n; delete a.n;</code> &#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x4E4B;&#x540E;&#xFF0C;b.x &#x4F9D;&#x7136;&#x7B49;&#x4E8E; 2&#xFF0C;&#x539F;&#x56E0;&#x662F; {x:2} &#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x88AB; a &#x548C; b &#x540C;&#x65F6;&#x5F15;&#x7528;&#xFF0C;delete &#x6307;&#x4EE4;&#x53EA;&#x5220;&#x9664;&#x4E86; a &#x5BF9;&#x5B83;&#x7684;&#x5F15;&#x7528;&#xFF0C;b &#x4E0A;&#x7684;&#x5F15;&#x7528;&#x4F9D;&#x7136;&#x5B58;&#x5728;&#x3002;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#x6709;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x3002;</p>
<p><strong>Object &#x6269;&#x5C55;</strong></p>
<p>Object &#x7684; freeze &#x65B9;&#x6CD5;&#x8FC7;&#x4E8E;&#x4E25;&#x683C;&#xFF1B;<strong>defineGetter</strong>/<strong>lookupGetter</strong> &#x548C;&#x5BF9;&#x5E94;&#x7684; Setter &#x662F;&#x5F88;&#x597D;&#x7528;&#x7684;&#x5C5E;&#x6027;&#x3002;</p>
<p><img src="./resource/eeb409922b0f.jpg" alt=""/></p>
<p><strong>toLocalString</strong></p>
<p>&#x5982;&#x56FE;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x8FD8;&#x4E0D;&#x77E5;&#x9053; JavaScript &#x7684; toLocaleString &#x8FD8;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x73A9;&#x3002;</p>
<p><img src="./resource/a92c1d24a58a.jpg" alt=""/></p>
<p><strong>this&#x8BED;&#x4E49;</strong></p>
<p>this &#x4E0A;&#x4E0B;&#x6587;&#x53EA;&#x5B58;&#x5728;&#x4E24;&#x79CD;&#x8BED;&#x4E49;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x88AB;&#x5F53;&#x4F5C;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#xFF0C;this &#x6307;&#x5411;&#x8C03;&#x7528;&#x5B83;&#x7684;&#x5BF9;&#x8C61;&#xFF1B;&#x4E00;&#x79CD;&#x662F;&#x4F5C;&#x4E3A;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF0C;&#x6307;&#x5411; Global &#x5BF9;&#x8C61;&#xFF08;&#x4E25;&#x683C;&#x6A21;&#x5F0F;&#x4E0B;&#x4E3A; undefined&#xFF09;&#x3002;&#x5B83;&#x6CA1;&#x6709;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;a &#x7531;&#x4E8E;&#x662F;&#x4F5C;&#x4E3A;&#x51FD;&#x6570;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x6307;&#x5411;&#x7684;&#x662F; window&#xFF0C;&#x6545;&#x800C;&#x8FD4;&#x56DE; false&#x3002;</p>
<p><img src="./resource/72e71da06c68.jpg" alt=""/></p>
<p><strong>&#x7C7B;&#x578B;</strong></p>
<p>JavaScript &#x53EF;&#x4EE5;&#x88AB;&#x8C03;&#x7528;&#x6267;&#x884C;&#x7684;&#x5747;&#x4E3A; Function &#x7C7B;&#x578B;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x5B58;&#x5728;&#x53EF;&#x8C03;&#x7528;&#x7684; Object&#xFF0C;&#x5982;&#x4F4E;&#x7248;&#x672C; IE &#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x5BBF;&#x4E3B;&#x5BF9;&#x8C61;&#xFF1A;document.getElementById&#x3001;alert &#x7B49;&#xFF0C;&#x5728;&#x5F88;&#x591A;&#x6D4F;&#x89C8;&#x5668;&#x4E2D; typeof RegExp &#x540C;&#x6837;&#x662F; Object&#x3002;&#x8FD9;&#x7EDD;&#x5BF9;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x6807;&#x51C6;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x6452;&#x5F03;/&#x4FEE;&#x6B63;&#x8FD9;&#x4E9B;&#x9519;&#x8BEF;&#x7C7B;&#x578B;&#x4E4B;&#x524D;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x5C11;&#x4F9D;&#x8D56;&#x5B83;&#x4EEC;&#x3002;</p>
<p><img src="./resource/0332c5971284.jpg" alt=""/></p>
<p><strong>IE8 getter/setter</strong></p>
<p>Object.defineProperty &#x867D;&#x7136;&#x662F; ES5 &#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x65E9;&#x5728; IE8 &#x5C31;&#x5DF2;&#x7ECF;&#x652F;&#x6301;&#x4E86;&#xFF0C;&#x4F46;&#x652F;&#x6301;&#x5F97;&#x5E76;&#x4E0D;&#x5B8C;&#x5584;&#xFF0C;&#x6BD4;&#x5982; writable&#x3001;enumerable&#x3001;configurable &#x8FD9;&#x4E9B;&#x914D;&#x7F6E;&#x9879;&#x8BBE;&#x7F6E;&#x5C31;&#x65E0;&#x6548;&#xFF0C;IE8 &#x4E0B;&#x4E3B;&#x8981;&#x652F;&#x6301; getter/setter&#x3002;</p>
<p><img src="./resource/635055189e7f.jpg" alt=""/></p>
<p><strong>JSON.stringify</strong></p>
<p>JSON.stringify &#x63A5;&#x53D7;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x77E5;&#x9053;&#x7B2C;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#x6765;&#x7F8E;&#x5316;&#x8F93;&#x51FA;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x53EF;&#x80FD;&#x4E0D;&#x77E5;&#x9053;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x5B83;&#x4E3A; {Array|Function} &#x7C7B;&#x578B;&#xFF0C;&#x5982;&#x679C;&#x4E3A; Array &#x5219;&#x7528;&#x4E8E;&#x8FC7;&#x6EE4; key&#xFF0C;&#x5982;&#x679C;&#x4E3A; Function &#x5219;&#x53EF;&#x4EE5;&#x5BF9; value &#x505A;&#x5904;&#x7406;&#xFF0C;&#x5982;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="./resource/f1808248df33.jpg" alt=""/></p>
<p><strong>Symbol</strong></p>
<p>ES6 &#x4E2D;&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;Symbol&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x539F;&#x59CB;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF08;&#x56FE;&#x4E00;&#xFF09;&#xFF0C;&#x5177;&#x5907;&#x5BF9;&#x8C61;&#x7684;&#x7279;&#x6027;&#xFF08;&#x56FE;&#x4E8C;&#xFF09;&#xFF0C;&#x5E76;&#x53EF;&#x4EE5;&#x6307;&#x5411;&#x540C;&#x4E00;&#x4E2A;&#x5F15;&#x7528;&#xFF08;&#x56FE;&#x4E09;&#xFF09;&#xFF0C;&#x80FD;&#x591F;&#x4F5C;&#x4E3A;&#x5BF9;&#x8C61;&#x7684; key &#x4F46;&#x4E0D;&#x53EF;&#x679A;&#x4E3E;&#xFF08;&#x56FE;&#x56DB;&#xFF09;&#xFF0C;&#x5185;&#x7F6E;&#x7684; Symbol &#x4F1A;&#x5F71;&#x54CD;&#x7A0B;&#x5E8F;&#x7684;&#x6267;&#x884C;&#xFF08;&#x56FE;&#x4E94;&#xFF09;&#xFF0C;Symbol.iterator &#x662F;&#x4E2A;&#x4E3E;&#x8DB3;&#x8F7B;&#x91CD;&#x7684;&#x7B26;&#x53F7;&#xFF0C;&#x80FD;&#x591F;&#x8BA9;&#x5143;&#x7D20;&#x5177;&#x5907;&#x8FED;&#x4EE3;&#x5C5E;&#x6027;&#xFF08;&#x56FE;&#x516D;&#xFF09;&#xFF0C;&#x82B1;&#x6837;&#x5F88;&#x591A;&#x3002;</p>
<p>&#x9644;&#x56FE;&#x89C1;&#xFF1A;<a href="http://weibo.com/1812166904/DqMwR8O6z" target="_blank" rel="external">http://weibo.com/1812166904/DqMwR8O6z</a></p>
<p>&#x4F2A;&#x6570;&#x7EC4;&#x6DFB;&#x52A0; Symbol.iterator &#x7684;&#x51E0;&#x4E2A;&#x529E;&#x6CD5;&#xFF1A;&#x9E2D;&#x5F0F;&#x8FA8;&#x578B;&#x7684; iterator &#x51FD;&#x6570;&#x3001;yield &#x51FD;&#x6570;&#x548C;&#x76F4;&#x63A5;&#x4F7F;&#x7528; Array &#x7684;&#x904D;&#x5386;&#x7B26;&#x53F7;&#x3002;</p>
<p>&#x9644;&#x56FE;&#x89C1;&#xFF1A;<a href="http://weibo.com/1812166904/DqMBYebPw" target="_blank" rel="external">http://weibo.com/1812166904/DqMBYebPw</a></p>
<p><strong>Set/WeakSet</strong></p>
<p>Set/WeakSet &#x8FD9;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x4E0D;&#x80FD;&#x8BF4;&#x6CA1;&#x7528;&#xFF0C;&#x4F46;&#x786E;&#x5B9E;&#x4E5F;&#x6CA1;&#x5565;&#x5927;&#x7528;&#xFF0C;&#x524D;&#x8005;&#x5C31;&#x662F;&#x4E2A;&#x4E0D;&#x5141;&#x8BB8;&#x51FA;&#x73B0;&#x91CD;&#x590D;&#x6210;&#x5458;&#x7684;&#x6570;&#x7EC4;&#xFF0C;&#x987A;&#x4FBF;&#x8FD8;&#x5E26;&#x4E86;&#x70B9; ES6 &#x7684;&#x7279;&#x6027;&#xFF0C;&#x540E;&#x8005;&#x867D;&#x8BF4;&#x53EF;&#x4EE5;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x9632;&#x6B62;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#xFF0C;&#x6BD4;&#x5982;&#x67D0;&#x4E2A;&#x5F15;&#x7528;&#x5DF2;&#x7ECF;&#x88AB;&#x5783;&#x573E;&#x56DE;&#x6536;&#x4E86;&#xFF0C;&#x518D;&#x53BB;&#x4F7F;&#x7528;&#x5B83;&#x53EF;&#x80FD;&#x5C31;&#x8FD4;&#x56DE; null&#x3002;&#x5B83;&#x4EEC;&#x90FD;&#x662F; ES6 &#x7684;&#x914D;&#x5957;&#x4EA7;&#x7269;&#x3002;&#x800C; Map/WeakMap &#x5012;&#x662F;&#x4E24;&#x4E2A;&#x975E;&#x5E38;&#x4E0D;&#x9519;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x5E38;&#x89C4;&#x7684; Object &#x7ED3;&#x6784;&#x90FD;&#x4E3A; String-Val &#x952E;&#x503C;&#x5BF9;&#xFF0C;&#x800C;&#x5B83;&#x6269;&#x5C55;&#x4E3A; AllType-Val&#xFF0C;&#x4EFB;&#x610F;&#x7C7B;&#x578B;&#x90FD;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x5B83;&#x7684; Key&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x670D;&#x52A1;&#x7AEF;&#x7F16;&#x7A0B;&#x8FD8;&#x662F;&#x5BA2;&#x6237;&#x7AEF;&#x7F16;&#x7A0B;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x90FD;&#x5E26;&#x6765;&#x4E86;&#x6781;&#x5927;&#x7684;&#x4FBF;&#x5229;&#x6027;&#x3002;</p>
<p><img src="./resource/b7a35fa60e51.jpg" alt=""/></p>
<p><strong>&#x6B63;&#x5219;</strong></p>
<p>&#x7406;&#x89E3;&#x6B63;&#x5219;&#x96F6;&#x5BBD;&#x7684;&#x542B;&#x4E49;&#xFF1A;&#x6B63;&#x5219;&#x4E2D;&#x6240;&#x8C13;&#x7684;&#x96F6;&#x5BBD;&#x65AD;&#x8A00;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x951A;&#x70B9;&#x5B57;&#x7B26;&#xFF0C;&#x5B83;&#x4EEC;&#x5339;&#x914D;&#x6307;&#x5B9A;&#x7684;&#x4F4D;&#x7F6E;&#x800C;&#x4E0D;&#x4F1A;&#x5339;&#x914D;&#x5185;&#x5BB9;&#xFF0C;&#x5982; ^ &#x5339;&#x914D;&#x5F00;&#x5934;&#xFF0C;$ &#x5339;&#x914D;&#x7ED3;&#x5C3E;&#xFF0C;\b &#x5339;&#x914D;&#x5355;&#x8BCD;&#x8FB9;&#x754C;&#xFF1B;(?=p) &#x5339;&#x914D;&#x300C;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x5B57;&#x7B26;&#x4E0E; p &#x5339;&#x914D;&#x300D;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;(?!p) &#x5339;&#x914D;&#x300C;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x5B57;&#x7B26;&#x4E0D;&#x4E0E; p &#x5339;&#x914D;&#x300D;&#x7684;&#x4F4D;&#x7F6E;&#x3002;\b &#x5B57;&#x7B26;&#x5339;&#x914D;&#x5355;&#x8BCD;&#x8FB9;&#x754C;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x5339;&#x914D; \w &#x4E0E; \W &#x4E4B;&#x95F4;&#x7684;&#x4F4D;&#x7F6E;&#xFF08;\w &#x5339;&#x914D; [a-zA-Z0-9]&#xFF09;&#x3002;&#x5F88;&#x5C11;&#x4F1A;&#x6709;&#x4EBA;&#x7528;&#x5230; \B&#xFF0C;&#x5B83;&#x5339;&#x914D;&#x7684;&#x662F;&#x975E;&#x5355;&#x8BCD;&#x8FB9;&#x754C;&#x4F4D;&#x7F6E;&#xFF0C;&#x7B80;&#x5355;&#x7406;&#x89E3;&#x5C31;&#x662F; \w &amp; \w &#x4E4B;&#x95F4;&#x4F4D;&#x7F6E;&#x6216;&#x8005; \W &amp; \W &#x4E4B;&#x95F4;&#x4F4D;&#x7F6E;&#x3002;</p>
<p><img src="./resource/37d721a7ec2b.jpg" alt=""/></p>
<p><strong>&#x6301;&#x7EED;&#x5B66;&#x4E60;&#x548C;&#x5206;&#x4EAB;&#x2026;</strong></p>
<p>&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x7247;&#x6BB5;&#x5316;&#x7684;&#x5206;&#x4EAB;&#xFF0C;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x4E5F;&#x6BD4;&#x8F83;&#x6742;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x5168;&#x90E8;&#x5217;&#x4E3E;&#x51FA;&#x6765;&#xFF0C;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x540C;&#x5B66;&#x53EF;&#x4EE5; follow &#x6211;&#x7684; <a href="http://weibo.com/hustskyking" target="_blank" rel="external">&#x5FAE;&#x535A;</a>&#xFF0C;&#x6211;&#x7684;&#x60F3;&#x6CD5;&#x548C;&#x7B14;&#x8BB0;&#x90FD;&#x4F1A;&#x5728;&#x4E0A;&#x9762;&#x540C;&#x6B65;&#x3002;</p>
<h3 id="&#x611F;&#x53D7;">&#x611F;&#x53D7;</h3><p>&#x5728;&#x8FD9;&#x4E4B;&#x524D;&#x7280;&#x725B;&#x4E66;&#x5DF2;&#x7ECF;&#x7FFB;&#x9605;&#x4E86;&#x5DEE;&#x4E0D;&#x591A;&#x516D;&#x4E03;&#x904D;&#xFF0C;&#x5F88;&#x591A;&#x5185;&#x5BB9;&#x90FD;&#x5DF2;&#x7ECF;&#x6DF1;&#x6DF1;&#x5730;&#x523B;&#x5728;&#x4E86;&#x8111;&#x6D77;&#x91CC;&#xFF0C;&#x4F46;&#x65F6;&#x95F4;&#x4E45;&#x4E86;&#x4E5F;&#x4F1A;&#x5FD8;&#x8BB0;&#x4E9B;&#xFF0C;&#x65F6;&#x800C;&#x5DE9;&#x56FA;&#x590D;&#x4E60;&#x4E0B;&#xFF0C;&#x6BD5;&#x7ADF;&#x662F;&#x524D;&#x7AEF;&#x6700;&#x57FA;&#x7840;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x5E26;&#x7740;&#x95EE;&#x9898;&#x53BB;&#x770B;&#x4E66;&#xFF0C;&#x6536;&#x83B7;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x3002;&#x7280;&#x725B;&#x4E66;&#x4E0D;&#x96BE;&#x5543;&#xFF0C;&#x96BE;&#x7684;&#x662F;&#x4F60;&#x5BF9;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x70B9;&#x7684;&#x7406;&#x89E3;&#x6DF1;&#x5EA6;&#x3002;</p></div>
</div>

</body>
</html>