<!DOCTYPE html>
<html>
<head>
  
  <title>&#x8C08;&#x4E00;&#x8C08;&#x535A;&#x5BA2;&#x7684;&#x8457;&#x4F5C;&#x7248;&#x6743;&#x95EE;&#x9898;</title>
  
</head>
<body>

<div id="wrap">
  <h1>&#x8C08;&#x4E00;&#x8C08;&#x535A;&#x5BA2;&#x7684;&#x8457;&#x4F5C;&#x7248;&#x6743;&#x95EE;&#x9898;</h1>
  <div id="content"><p>&#x53E4;&#x4EBA;&#x5BF9;&#x300C;&#x8457;&#x4F5C;&#x300D;&#x548C;&#x300C;&#x7F16;&#x8FF0;&#x300D;&#x4E24;&#x4E2A;&#x8BCD;&#x7684;&#x542B;&#x4E49;&#x533A;&#x5206;&#x7684;&#x6BD4;&#x8F83;&#x660E;&#x663E;&#xFF0C;&#x5B50;&#x66F0;&#xFF1A;&#x201C;&#x8FF0;&#x800C;&#x4E0D;&#x4F5C;&#xFF0C;&#x4FE1;&#x800C;&#x597D;&#x53E4;&#x201D;&#xFF0C;&#x610F;&#x601D;&#x662F;&#xFF0C;&#x53EA;&#x8D1F;&#x8D23;&#x4F20;&#x627F;&#x53E4;&#x4EE3;&#x7684;&#x4F18;&#x79C0;&#x6587;&#x5316;&#xFF0C;&#x4E0D;&#x641E;&#x6539;&#x9769;&#xFF0C;&#x76F8;&#x4FE1;&#x5E76;&#x4E14;&#x559C;&#x6B22;&#x73A9;&#x5473;&#x53E4;&#x4EE3;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x90A3;&#x4E2A;&#x65F6;&#x4EE3;&#x4EA7;&#x51FA;&#x7684;&#x77E5;&#x8BC6;&#x4F53;&#x91CF;&#x5C0F;&#xFF0C;&#x800C;&#x73B0;&#x5728;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x4FE1;&#x606F;&#x65F6;&#x4EE3;&#xFF0C;&#x5F88;&#x591A;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x5728;&#x6C89;&#x6DC0;&#x7684;&#x77E5;&#x8BC6;&#x4E2D;&#x505A;&#x5FAE;&#x521B;&#x65B0;&#x3001;&#x5FAE;&#x8457;&#x4F5C;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8981;&#x628A;&#x535A;&#x5BA2;&#x6587;&#x7AE0;&#x5212;&#x8FDB;&#x8FD9;&#x4E24;&#x4E2A;&#x8BCD;&#xFF0C;&#x8457;&#x4F5C;&#x6216;&#x8BB8;&#x66F4;&#x52A0;&#x9002;&#x5408;&#x4E9B;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x535A;&#x5BA2;&#x4E2D;&#x7684;&#x8BBA;&#x8FF0;&#xFF0C;&#x7A0D;&#x5FAE;&#x6709;&#x70B9;&#x542B;&#x91CF;&#x7684;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x79F0;&#x4E4B;&#x4E3A;&#x8457;&#x4F5C;&#x3002;</p>
<a id="more"/>
<p>&#x5728;&#x4E2D;&#x56FD;&#xFF0C;&#x76D7;&#x7248;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4E2A;&#x6DF1;&#x5165;&#x9AA8;&#x9AD3;&#x7684;&#x8BCD;&#x8BED;&#xFF0C;&#x5982;&#x679C;&#x54EA;&#x5929;&#x53D1;&#x73B0;&#x8EAB;&#x8FB9;&#x7684;&#x670B;&#x53CB;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x76D7;&#x7248;&#x7684;&#x8F6F;&#x4EF6;&#x3001;&#x770B;&#x76D7;&#x7248;&#x7684;&#x6570;&#x636E;&#x3001;&#x542C;&#x76D7;&#x7248;&#x7684;&#x97F3;&#x4E50;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x4E5C;&#x659C;&#x7740;&#x773C;&#x775B;&#x8BE7;&#x5F02;&#x7684;&#x76EF;&#x7740;&#x8FD9;&#x4E2A;&#x4EBA;&#xFF08;&#x5FC3;&#x91CC;&#x9ED8;&#x5FF5;&#x7740;&#x571F;&#x8C6A;&#xFF09;&#x3002;&#x8FD1;&#x4E24;&#x5E74;&#xFF0C;&#x56FD;&#x5BB6;&#x5728;&#x76D7;&#x7248;&#x7684;&#x6253;&#x51FB;&#x4E0A;&#x505A;&#x4E86;&#x5927;&#x91CF;&#x5DE5;&#x4F5C;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x4E66;&#x7C4D;&#x548C;&#x97F3;&#x4E50;&#x4E24;&#x5757;&#x3002;</p>
<p>&#x6700;&#x8FD1;&#x770B;&#x5230;&#x6280;&#x672F;&#x5708;&#x7684;&#x5185;&#x5BB9;&#x805A;&#x5408;&#x5E73;&#x53F0;&#x5982;&#x96E8;&#x540E;&#x6625;&#x7B0B;&#x822C;&#x5D1B;&#x8D77;&#xFF0C;&#x7136;&#x800C;&#x6709;&#x6781;&#x5C11;&#x6570;&#x7684;&#x670B;&#x53CB;&#x5728;&#x5206;&#x4EAB;&#x7684;&#x65F6;&#x5019;&#x5E76;&#x4E0D;&#x592A;&#x5728;&#x610F;&#x7248;&#x6743;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6240;&#x4EE5;&#x4ECA;&#x5929;&#x60F3;&#x628A;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x518D;&#x63D0;&#x5230;&#x7EB8;&#x9762;&#x4E0A;&#x8BF4;&#x8BF4;&#xFF0C;&#x52A0;&#x6DF1;&#x5927;&#x5BB6;&#x7684;&#x5370;&#x8C61;&#x3002;</p>
<h3 id="&#x5927;&#x4F17;&#x6CA1;&#x6709;&#x7248;&#x6743;&#x4FDD;&#x62A4;&#x7684;&#x610F;&#x8BC6;">&#x5927;&#x4F17;&#x6CA1;&#x6709;&#x7248;&#x6743;&#x4FDD;&#x62A4;&#x7684;&#x610F;&#x8BC6;</h3><p>&#x8FD1;&#x51E0;&#x5E74;&#xFF0C;&#x56FD;&#x5185;&#x51FA;&#x73B0;&#x4E86;&#x597D;&#x51E0;&#x4E2A;&#x652F;&#x6301;&#x9759;&#x6001;&#x90E8;&#x7F72;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x52A0;&#x4E4B;&#x6280;&#x672F;&#x5B66;&#x4E60;&#x95E8;&#x69DB;&#x8D8A;&#x6765;&#x8D8A;&#x4F4E;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x73A9;&#x8D77;&#x4E86;&#x535A;&#x5BA2;&#x3002;&#x6211;&#x5E73;&#x65F6;&#x4E5F;&#x559C;&#x6B22;&#x770B;&#x522B;&#x4EBA;&#x5199;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6BCF;&#x6BCF; Google &#x641C;&#x7D22;&#x90FD;&#x4F1A;&#x6389;&#x8FDB;&#x51E0;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x535A;&#x5BA2;&#xFF0C;&#x770B;&#x5230;&#x6709;&#x610F;&#x601D;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4FBF;&#x4F1A;&#x524A;&#x4E00;&#x4E2A;&#x82F9;&#x679C;&#x5750;&#x5728;&#x4E00;&#x65C1;&#xFF0C;&#x8FB9;&#x5403;&#x8FB9;&#x770B;&#x1F648;&#x3002;</p>
<p>&#x5927;&#x7EA6;&#x6709;&#x4E00;&#x534A;&#x7684;&#x670B;&#x53CB;&#x4F1A;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x6587;&#x7AE0;&#x4E2D;&#x5907;&#x6CE8;&#x7248;&#x6743;&#x4FE1;&#x606F;&#xFF0C;&#x544A;&#x8BC9;&#x8DEF;&#x4EBA;&#xFF0C;&#x6587;&#x7AE0;&#x53EF;&#x4EE5;&#x62FF;&#x8D70;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x8BB0;&#x5F97;&#x5E26;&#x4E0A;&#x540D;&#x5B57;&#x548C;&#x539F;&#x6587;&#x94FE;&#x63A5;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E60;&#x60EF;&#x5F88;&#x597D;&#x3002;&#x53EF;&#x662F;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x670B;&#x53CB;&#x5E76;&#x6CA1;&#x6709;&#x610F;&#x8BC6;&#x5230;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x524D;&#x6BB5;&#x770B;&#x5230;&#x56E2;&#x961F;&#x53F7;&#x53EC;&#x5404;&#x4F4D;&#x653B;&#x57CE;&#x5E08;&#x628A;&#x5DE5;&#x4F5C;&#x4E0A;&#x4E0D;&#x9519;&#x7684;&#x60F3;&#x6CD5;&#x63D0;&#x70BC;&#x6210;&#x4E13;&#x5229;&#xFF0C;&#x5E76;&#x5BF9;&#x6211;&#x4EEC;&#x505A;&#x4E86;&#x76F8;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#x666E;&#x53CA;&#xFF0C;&#x6211;&#x53D1;&#x73B0;&#xFF0C;&#x5F88;&#x591A;&#x4E13;&#x5229;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x9AD8;&#x6DF1;&#x7684;&#x6280;&#x672F;&#x3002;&#x5176;&#x5B9E;&#x8457;&#x4F5C;&#x4E5F;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x7528;&#x5FC3;&#x53BB;&#x5199;&#xFF0C;&#x641E;&#x4E0D;&#x597D;&#x4F60;&#x67D0;&#x7BC7;&#x6587;&#x7AE0;&#x5C31;&#x53EF;&#x4EE5;&#x7ED9;&#x4F60;&#x5E26;&#x6765;&#x4E00;&#x4E9B;&#x6B63;&#x5411;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x4EE5;&#x524D;&#x7684;&#x8457;&#x4F5C;&#xFF0C;&#x6743;&#x9650;&#x63A7;&#x5236;&#x5F88;&#x6781;&#x7AEF;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x4E0D;&#x7ED9;&#x4EFB;&#x4F55;&#x6743;&#x5229;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x628A;&#x6240;&#x6709;&#x6743;&#x5229;&#x90FD;&#x7ED9;&#x51FA;&#x53BB;&#x3002;&#x4F60;&#x662F;&#x5426;&#x4E5F;&#x7ECF;&#x5E38;&#x770B;&#x5230; Apache &#x534F;&#x8BAE;&#x3001;MIT &#x534F;&#x8BAE;&#x7B49;&#x7B49;&#x5BF9;&#x4EE3;&#x7801;&#x5F00;&#x6E90;&#x7684;&#x6743;&#x5229;&#x63A7;&#x5236;&#xFF1F;&#x6211;&#x4E4B;&#x524D;&#x6574;&#x7406;&#x4E86;&#x4E00;&#x4EFD;&#x6587;&#x6863;&#xFF0C;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x53EF;&#x4EE5;&#x770B;&#x770B;&#xFF1A;<a href="http://www.barretlee.com/blog/2013/08/13/cb-license/">&#x300A;&#x4E94;&#x79CD;&#x5F00;&#x6E90;&#x534F;&#x8BAE;&#x7684;&#x6BD4;&#x8F83;(BSD,Apache,GPL,LGPL,MIT)&#x300B;</a>&#xFF0C;&#x9002;&#x5F53;&#x5BF9;&#x8457;&#x4F5C;&#x6743;&#x505A;&#x4FDD;&#x7559;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x6709;&#x5229;&#x4E8E;&#x5C06;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8BC6;&#x6210;&#x679C;&#x5206;&#x4EAB;&#x51FA;&#x53BB;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x4E5F;&#x662F;&#x5BF9;&#x81EA;&#x5DF1;&#x6743;&#x76CA;&#x7684;&#x7EF4;&#x62A4;&#x3002;</p>
<h3 id="Creative_Commons">Creative Commons</h3><p>&#x535A;&#x5BA2;&#x6587;&#x7AE0;&#x5199;&#x4F5C;&#x4E00;&#x822C;&#x4F1A;&#x7528;&#x5230; Creative Commons &#x76F8;&#x5173;&#x534F;&#x8BAE;&#xFF0C;&#x4E2D;&#x6587;&#x53EB;&#x505A;&#x300C;&#x77E5;&#x8BC6;&#x5171;&#x4EAB;&#x534F;&#x8BAE;&#x300D;&#xFF0C;&#x7B80;&#x79F0; CC&#x3002;&#x5BF9;&#x6743;&#x5229;&#x7684;&#x5F52;&#x7C7B;&#x5206;&#x4E3A;&#x56DB;&#x79CD;&#xFF1A;</p>
<ul>
<li>&#x7F72;&#x540D;&#xFF08;Attribution&#xFF0C;&#x7B80;&#x5199;&#x4E3A; BY&#xFF09;&#xFF1A;&#x5FC5;&#x987B;&#x63D0;&#x5230;&#x539F;&#x4F5C;&#x8005;&#x3002;</li>
<li>&#x975E;&#x5546;&#x4E1A;&#x7528;&#x9014;&#xFF08;Noncommercial&#xFF0C;&#x7B80;&#x5199;&#x4E3A; NC&#xFF09;&#xFF1A;&#x4E0D;&#x5F97;&#x7528;&#x4E8E;&#x76C8;&#x5229;&#x6027;&#x76EE;&#x7684;&#x3002;</li>
<li>&#x7981;&#x6B62;&#x6F14;&#x7ECE;&#xFF08;No Derivative Works&#xFF0C;&#x7B80;&#x5199;&#x4E3A; ND&#xFF09;&#xFF1A;&#x4E0D;&#x5F97;&#x4FEE;&#x6539;&#x539F;&#x4F5C;&#x54C1;, &#x4E0D;&#x5F97;&#x518D;&#x521B;&#x4F5C;&#x3002;</li>
<li>&#x76F8;&#x540C;&#x65B9;&#x5F0F;&#x5171;&#x4EAB;&#xFF08;Share Alike&#xFF0C;&#x7B80;&#x5199;&#x4E3A; SA&#xFF09;&#xFF1A;&#x5141;&#x8BB8;&#x4FEE;&#x6539;&#x539F;&#x4F5C;&#x54C1;&#xFF0C;&#x4F46;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x8BB8;&#x53EF;&#x8BC1;&#x53D1;&#x5E03;&#x3002;</li>
</ul>
<p>&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9;&#x4EE5;&#x4E0A;&#x968F;&#x673A;&#x7EC4;&#x5408;&#xFF0C;&#x7528;&#x7684;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x7EC4;&#x5408;&#x6709;&#x8FD9;&#x4E48;&#x51E0;&#x4E2A;&#xFF1A;</p>
<ul>
<li><a href="https://creativecommons.org/licenses/by-nc-sa/2.5/cn/" target="_blank" rel="external">&#x7F72;&#x540D;-&#x975E;&#x5546;&#x4E1A;&#x6027;&#x4F7F;&#x7528;-&#x76F8;&#x540C;&#x65B9;&#x5F0F;&#x5171;&#x4EAB; 2.5 &#x4E2D;&#x56FD;&#x5927;&#x9646; (CC BY-NC-SA 2.5 CN)</a></li>
<li><a href="https://creativecommons.org/licenses/by-nc-nd/3.0/cn/" target="_blank" rel="external">&#x7F72;&#x540D;-&#x975E;&#x5546;&#x4E1A;&#x6027;&#x4F7F;&#x7528;-&#x7981;&#x6B62;&#x6F14;&#x7ECE; 3.0 &#x4E2D;&#x56FD;&#x5927;&#x9646; (CC BY-NC-ND 3.0 CN)</a></li>
<li><a href="https://creativecommons.org/licenses/by-sa/4.0/deed.zh" target="_blank" rel="external">&#x7F72;&#x540D;-&#x76F8;&#x540C;&#x65B9;&#x5F0F;&#x5171;&#x4EAB; 4.0 &#x56FD;&#x9645; (CC BY-SA 4.0)</a></li>
</ul>
<p>&#x6211;&#x7684;&#x535A;&#x5BA2;&#x4F7F;&#x7528;&#x4E0A;&#x9762;&#x7B2C;&#x4E8C;&#x79CD;&#x534F;&#x8BAE;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x5A92;&#x4ECB;&#x4EE5;&#x4EFB;&#x4F55;&#x5F62;&#x5F0F;&#x590D;&#x5236;&#x3001;&#x53D1;&#x884C;&#x535A;&#x5BA2;&#x4F5C;&#x54C1;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x4FDD;&#x7559;&#x7F72;&#x540D;&#xFF0C;&#x4E0D;&#x5141;&#x8BB8;&#x5546;&#x7528;&#xFF0C;&#x4E0D;&#x80FD;&#x5BF9;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x548C;&#x518D;&#x521B;&#x4F5C;&#x3002;&#x8FD8;&#x7B97;&#x6BD4;&#x8F83;&#x5BBD;&#x677E;&#xFF0C;&#x5BF9;&#x4E00;&#x822C;&#x7684;&#x805A;&#x5408;&#x5E73;&#x53F0;&#x800C;&#x8A00;&#xFF0C;&#x5728;&#x9192;&#x76EE;&#x4F4D;&#x7F6E;&#x7559;&#x4E0B;&#x4F5C;&#x8005;&#x540D;&#x5B57;&#x548C;&#x539F;&#x6587;&#x94FE;&#x63A5;&#x5373;&#x53EF;&#x3002;</p>
<h3 id="&#x4E0D;&#x6B62;&#x4E8E;&#x534F;&#x8BAE;">&#x4E0D;&#x6B62;&#x4E8E;&#x534F;&#x8BAE;</h3><p>&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x6280;&#x672F;&#x5185;&#x5BB9;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x9769;&#x65B0;&#x7684;&#xFF0C;&#x4E0A;&#x534A;&#x5E74;&#x8FD8;&#x5728;&#x6D41;&#x884C;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E0B;&#x534A;&#x5E74;&#x53EF;&#x80FD;&#x5C31;&#x5DF2;&#x7ECF;&#x6DF9;&#x6CA1;&#x5728;&#x5386;&#x53F2;&#x6D2A;&#x6D41;&#x4E4B;&#x4E2D;&#x3002;&#x535A;&#x5BA2;&#x6587;&#x7AE0;&#x4E2D;&#x7684;&#x8868;&#x8FF0;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x8BF8;&#x591A;&#x9519;&#x8BEF;&#x6216;&#x8005;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x540E;&#x5185;&#x5BB9;&#x8FC7;&#x65F6;&#x4E86;&#xFF0C;&#x5F53;&#x4F5C;&#x8005;&#x53D1;&#x73B0;&#x8FD9;&#x4E9B;&#x9519;&#x8BEF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4FBF;&#x4F1A;&#x5BF9;&#x5185;&#x5BB9;&#x505A;&#x4FEE;&#x6539;&#xFF0C;copy &#x65B9;&#x5F0F;&#x7684;&#x8F6C;&#x8F7D;&#x6700;&#x5927;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x6CA1;&#x6CD5;&#x5373;&#x65F6;&#x4E0E;&#x539F;&#x6587;&#x4FDD;&#x6301;&#x540C;&#x6B65;&#xFF0C;&#x5018;&#x82E5;&#x8F6C;&#x8F7D;&#x65F6;&#x8FD8;&#x4E0D;&#x4FDD;&#x7559;&#x539F;&#x6587;&#x5730;&#x5740;&#xFF0C;&#x4FE1;&#x606F;&#x7684;&#x4F20;&#x9012;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x65AD;&#x5C42;&#xFF0C;&#x4E00;&#x4E9B;&#x9519;&#x8BEF;&#x7684;&#x8868;&#x8FF0;&#x548C;&#x5185;&#x5BB9;&#xFF0C;&#x5BB9;&#x6613;&#x5BF9;&#x521A;&#x5165;&#x95E8;&#x7684;&#x65B0;&#x4EBA;&#x9020;&#x6210;&#x8D1F;&#x9762;&#x7684;&#x523B;&#x677F;&#x5370;&#x8C61;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x662F;&#x9700;&#x8981;&#x5404;&#x4F4D;&#x670B;&#x53CB;&#x5728;&#x8F6C;&#x8F7D;&#x6587;&#x7AE0;&#x7684;&#x65F6;&#x5019;&#x6CE8;&#x610F;&#x7684;&#xFF01;</p>
<p>&#x597D;&#x5427;&#xFF0C;&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x5C31;&#x5F53;&#x6211;&#x5570;&#x55E6;&#x4E86;&#x4E0B;&#x3002;</p></div>
</div>

</body>
</html>