<!DOCTYPE html>
<html>
<head>
  
  <title>WiFi &#x4E07;&#x80FD;&#x94A5;&#x5319;&#x539F;&#x7406;&#x548C;&#x5371;&#x5BB3;&#x63A2;&#x7A76;</title>
  
</head>
<body>

<div id="wrap">
  <h1>WiFi &#x4E07;&#x80FD;&#x94A5;&#x5319;&#x539F;&#x7406;&#x548C;&#x5371;&#x5BB3;&#x63A2;&#x7A76;</h1>
  <div id="content"><p>&#x672C;&#x6587;&#x4E0D;&#x4F1A;&#x4ECE;&#x4EE3;&#x7801;&#x89D2;&#x5EA6;&#x5206;&#x6790; WiFi &#x4E07;&#x80FD;&#x94A5;&#x5319;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x662F;&#x5982;&#x4F55;&#x300C;&#x7834;&#x89E3;&#x300D;&#x5BC6;&#x7801;&#x7684;&#xFF0C;&#x4E3B;&#x8981;&#x4ECE;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x540E;&#x7684;&#x611F;&#x53D7;&#x51FA;&#x53D1;&#xFF0C;&#x5206;&#x6790;&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x7528;&#x5230;&#x7684;&#x624B;&#x6BB5;&#x4EE5;&#x53CA;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x7684;&#x98CE;&#x9669;&#x3002;</p>
<a id="more"/>
<p>&#x4EE5;&#x524D;&#x56E0;&#x4E3A;&#x597D;&#x5947;&#xFF0C;&#x5B89;&#x88C5;&#x4E86; WiFi &#x4E07;&#x80FD;&#x94A5;&#x5319;&#xFF0C;&#x4F46;&#x662F;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x6253;&#x5F00;&#x8FC7;&#xFF0C;&#x5F53;&#x65F6;&#x6211;&#x5FC3;&#x91CC;&#x5F88;&#x6E05;&#x695A;&#xFF0C;&#x8E6D;&#x7F51;&#x7684;&#x524D;&#x63D0;&#x5C31;&#x662F;&#x81EA;&#x5DF1;&#x5BB6;&#x88AB;&#x8E6D;&#x3002;&#x665A;&#x4E0A;&#x5237;&#x5FAE;&#x535A;&#x770B;&#x5230;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#xFF0C;iphone &#x8BBE;&#x5907;&#x7684; WiFi &#x5217;&#x8868;&#x4E2D;&#x7ADF;&#x7136;&#x51FA;&#x73B0;&#x4E86;&#x300C;&#x1F511;&#x4E00;&#x952E;&#x514D;&#x8D39;&#x8FDE;&#x63A5;&#x1F511;&#x300D;&#x76F8;&#x5173;&#x7684;&#x63D0;&#x793A;&#xFF0C;&#x6211;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x624B;&#x673A;&#x6D4B;&#x8BD5;&#x4E86;&#x4E0B;&#xFF0C;&#x679C;&#x771F;&#x5982;&#x6B64;&#xFF1A;</p>
<p><img src="./resource/20098897c115.jpg" alt="WiFi &#x7834;&#x89E3;&#x6548;&#x679C;&#x5217;&#x8868;" style="width:300px;"><!-- ![WiFi 破解效果列表](http://www.barretlee.com/blogimgs/2016/02/20160203_82a6609a.png) --></img></p>
<h3 id="&#x8F6F;&#x4EF6;&#x5BF9;_WiFi_&#x5BC6;&#x7801;&#x7684;&#x652B;&#x53D6;">&#x8F6F;&#x4EF6;&#x5BF9; WiFi &#x5BC6;&#x7801;&#x7684;&#x652B;&#x53D6;</h3><p>&#x83B7;&#x53D6;&#x5B89;&#x88C5;&#x8BE5;&#x8F6F;&#x4EF6;&#x7528;&#x6237;&#x8FDE;&#x63A5;&#x8FC7;&#x7684; WiFi &#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x8FD9;&#x662F; WiFi &#x4E07;&#x80FD;&#x94A5;&#x5319;&#x9700;&#x8981;&#x653B;&#x514B;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x96BE;&#x9898;&#xFF0C;&#x653B;&#x514B;&#x4E4B;&#x540E;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x8EAB;&#x4E0A;&#x53EF;&#x4EE5;&#x6316;&#x5230; 1-10 &#x4E2A; WiFi id &#x548C; WiFi &#x5BC6;&#x7801;&#x3002;&#x653B;&#x514B;&#x7684;&#x65B9;&#x5F0F;&#x561B;&#xFF0C;&#x53EF;&#x4EE5;&#x53BB;&#x7F51;&#x4E0A;&#x641C;&#x7F57;&#x4E0B;&#xFF0C;&#x5F88;&#x591A;&#x4FDD;&#x5B58;&#x4E0B;&#x6765;&#x7684;&#x5BC6;&#x7801;&#x90FD;&#x662F;&#x660E;&#x6587;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x53EA;&#x7ECF;&#x8FC7;&#x4E86;&#x7B80;&#x5355;&#x7684;&#x52A0;&#x5BC6;&#x64CD;&#x4F5C;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x6237; root &#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x624B;&#x673A;&#xFF0C;&#x8F6F;&#x4EF6;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x83B7;&#x53D6;&#x3002;</p>
<p>&#x663E;&#x7136;&#xFF0C;WiFi &#x4E07;&#x80FD;&#x94A5;&#x5319;&#x6709;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x4E91;&#x7AEF;&#xFF0C;&#x50A8;&#x5B58;&#x4E86;&#x5927;&#x91CF;&#x4ECE;&#x7528;&#x6237;&#x624B;&#x673A;&#x91CC;&#x652B;&#x53D6;&#x5230;&#x7684; WiFi &#x4FE1;&#x606F;&#xFF0C;&#x6BCF;&#x4E2A;&#x50A8;&#x5B58;&#x5355;&#x5143;&#x5E94;&#x8BE5;&#x5305;&#x542B;&#x4E86;&#x5982;&#x4E0B;&#x4FE1;&#x606F;&#xFF08;&#x6309;&#x7167;&#x91CD;&#x8981;&#x6027;&#x4ECE;&#x4E0A;&#x5F80;&#x4E0B;&#x4F9D;&#x6B21;&#x6392;&#x5217;&#xFF09;&#xFF1A;</p>
<ul>
<li>WiFi &#x5BB9;&#x5668;&#x7684;&#x7269;&#x7406;&#x5730;&#x5740;&#xFF08;MAC &#x4FE1;&#x606F;&#xFF09;</li>
<li>WiFi &#x7684;&#x5BC6;&#x7801;</li>
<li>WiFi &#x540D;&#x79F0;</li>
<li>WiFi &#x5BB9;&#x5668;&#x7684;&#x533A;&#x57DF;&#x4FE1;&#x606F;</li>
<li>WiFi &#x5BB9;&#x5668;&#x7684; IP &#x5730;&#x5740;</li>
</ul>
<p>&#x7531;&#x4E8E;&#x6C11;&#x4F17;&#x5BF9;&#x5FEB;&#x901F;&#x4E0A;&#x7F51;&#x7684;&#x6781;&#x5EA6;&#x6E34;&#x671B;&#xFF0C;&#x5076;&#x7136;&#x542C;&#x5230;&#x6216;&#x8005;&#x770B;&#x5230;&#x6709;&#x8FD9;&#x4E48;&#x4E2A;&#x795E;&#x5668;&#xFF0C;&#x5F53;&#x673A;&#x7ACB;&#x65AD;&#x5C06;&#x5176;&#x4E0B;&#x8F7D;&#x5230;&#x4E86;&#x624B;&#x673A;&#x4E0A;&#xFF0C;&#x5728;&#x8FD9;&#x4E24;&#x5E74;&#x65F6;&#x95F4;&#x95F4;&#xFF0C;&#x8BE5;&#x8F6F;&#x4EF6;&#x7684;&#x7528;&#x6237;&#x91CF;&#x8FBE;&#x5230;&#x4E86; 5 &#x4EBF;&#x4E4B;&#x591A;&#xFF0C;&#x6708;&#x6D3B;&#x8DC3;&#x7528;&#x6237;&#x5728; 2.3 &#x4EBF;&#xFF08;&#x6570;&#x636E;&#x6765;&#x81EA;&#x7F51;&#x7EDC;&#xFF09;&#xFF0C;&#x5176;&#x7528;&#x6237;&#x91CF;&#x4E4B;&#x591A;&#x3001;&#x7C98;&#x6027;&#x4E4B;&#x5F3A;&#xFF0C;&#x6050;&#x6015;&#x53EA;&#x6709;&#x793E;&#x4EA4;&#x7C7B;&#x7684;&#x8F6F;&#x4EF6;&#x53EF;&#x4EE5;&#x6BD4;&#x62DF;&#x4E86;&#x3002;&#x7531;&#x6B64;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x60F3;&#x8C61; WiFi &#x4E07;&#x80FD;&#x94A5;&#x5319;&#x7684;&#x4E91;&#x7AEF;&#x6570;&#x636E;&#x5E93;&#x6709;&#x591A;&#x4E48;&#x5E9E;&#x5927;&#x3002;</p>
<h3 id="WiFi_&#x7684;&#x8FDE;&#x63A5;">WiFi &#x7684;&#x8FDE;&#x63A5;</h3><p>&#x521D;&#x6B21;&#x6253;&#x5F00;&#x8F6F;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x770B;&#x5230;&#x4E86;&#x5B83;&#x4F1A;&#x5411;&#x4F60;&#x7533;&#x8BF7;&#x300C;&#x83B7;&#x53D6;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#x300D;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x76EE;&#x7684;&#x6709;&#x4E24;&#x4E2A;&#xFF0C;&#x7B2C;&#x4E00;&#x662F;&#x83B7;&#x53D6;&#x4F60;&#x6240;&#x5728;&#x533A;&#x57DF;&#x7684;&#x5927;&#x6982;&#x4F4D;&#x7F6E;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8BE5;&#x4F4D;&#x7F6E;&#x9644;&#x8FD1;&#x7684; WiFi &#x4FE1;&#x606F;&#x5168;&#x90E8;&#x7F13;&#x5B58;&#x5230;&#x4F60;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x5730;&#x51CF;&#x5C11;&#x5BF9;&#x670D;&#x52A1;&#x5668;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x5176;&#x4E8C;&#xFF0C;&#x76EE;&#x524D; WiFi &#x4E07;&#x80FD;&#x94A5;&#x5319;&#x4E5F;&#x4F1A;&#x505A;&#x4E00;&#x4E9B;&#x5546;&#x54C1;/&#x5546;&#x5BB6;&#x7684;&#x63A8;&#x5E7F;&#xFF0C;&#x62FF;&#x5230;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#x65B9;&#x4FBF;&#x4E2A;&#x6027;&#x5316;&#x6295;&#x653E;&#x3002;</p>
<p><strong>1. &#x5BC6;&#x7801;&#x5339;&#x914D;</strong></p>
<p>&#x4EE5;&#x524D;&#x624B;&#x673A;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x6743;&#x9650;&#x7ED9;&#x5B83;&#x83B7;&#x53D6; WiFi &#x5217;&#x8868;&#xFF0C;&#x6240;&#x4EE5;&#x8F6F;&#x4EF6;&#x4F1A;&#x5F15;&#x5BFC;&#x7528;&#x6237;&#x5C06; WiFi &#x5217;&#x8868;&#x754C;&#x9762;&#x622A;&#x56FE;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x56FE;&#x7247;&#x5206;&#x6790;&#x62FF;&#x5230; WiFi &#x540D;&#x79F0;&#x3002;&#x800C;&#x5982;&#x4ECA;&#xFF0C;iOS &#x8BBE;&#x5907;&#x4E0D;&#x4EC5;&#x63D0;&#x4F9B;&#x4E86;&#x83B7;&#x53D6;&#x5468;&#x8FB9; WiFi &#x5217;&#x8868;&#x7684;&#x6743;&#x9650;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x5141;&#x8BB8;&#x8F6F;&#x4EF6;&#x5BF9;&#x6BCF;&#x4E2A; WiFi &#x8FDB;&#x884C;&#x6587;&#x5B57;&#x5907;&#x6CE8;&#xFF0C;&#x5982;&#x6700;&#x4E0A;&#x9762;&#x7834;&#x89E3;&#x6548;&#x679C;&#x5217;&#x8868;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x731C;&#x6D4B;&#xFF0C;&#x4EE5;&#x524D;&#x8F6F;&#x4EF6;&#x53EA;&#x80FD;&#x901A;&#x8FC7; WiFi &#x540D;&#x79F0;&#x8FDB;&#x884C;&#x5339;&#x914D;&#xFF0C;&#x800C;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; WiFi &#x7684;&#x5176;&#x4ED6;&#x4FE1;&#x606F;&#x5982;&#xFF08;MAC &#x5730;&#x5740;&#xFF09;&#x8FDB;&#x884C;&#x5339;&#x914D;&#xFF0C;&#x5339;&#x914D;&#x5EA6;&#x66F4;&#x9AD8;&#xFF0C;&#x56E0;&#x4E3A; WiFi &#x540D;&#x79F0;&#x53EF;&#x80FD;&#x4F1A;&#x5B58;&#x5728;&#x91CD;&#x590D;&#x95EE;&#x9898;&#x3002;</p>
<p><strong>2. &#x649E;&#x5E93;&#x5206;&#x6790;</strong></p>
<p>&#x62FF;&#x5230;&#x4E86;&#x51E0;&#x4E2A;&#x4EBF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x81EA;&#x7136;&#x5C11;&#x4E0D;&#x4E86;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7EDF;&#x8BA1;&#x548C;&#x5206;&#x6790;&#xFF0C;&#x62FF;&#x5230;&#x4E00;&#x4E9B;&#x5E38;&#x7528;&#x7684;&#x5F31;&#x53E3;&#x4EE4;&#xFF0C;&#x5982;&#x516B;&#x4E2A;8&#x3001;&#x56DB;&#x4E2A;123&#x3001;&#x516B;&#x4E2A;0&#x7B49;&#xFF0C;&#x4E86;&#x89E3;&#x8DEF;&#x7531;&#x8BBE;&#x7F6E;&#x548C; WiFi &#x8BBE;&#x7F6E;&#x7684;&#x4EBA;&#x672C;&#x6765;&#x5C31;&#x4E0D;&#x591A;&#xFF0C;&#x5F88;&#x591A;&#x4E0A;&#x95E8;&#x670D;&#x52A1;&#x7684;&#x5E08;&#x5085;&#x4E00;&#x822C;&#x5C31;&#x5C06;&#x5BC6;&#x7801;&#x8BBE;&#x7F6E;&#x6210;&#x7B80;&#x5355;&#x597D;&#x8BB0;&#x7684;&#xFF0C;&#x8FD9;&#x4E5F;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x63D0;&#x9AD8;&#x4E86;&#x649E;&#x5E93;&#x7684;&#x6210;&#x529F;&#x7387;&#x3002;&#x5BF9;&#x4E8E;&#x62FF;&#x4E0D;&#x5230;&#x5BC6;&#x7801;&#x7684; WiFi&#xFF0C;&#x8F6F;&#x4EF6;&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#x4F1A;&#x4F5C;&#x51FA;&#x8FD9;&#x79CD;&#x5C1D;&#x8BD5;&#xFF0C;&#x6210;&#x672C;&#x4F4E;&#x3001;&#x6210;&#x529F;&#x7387;&#x8FD8;&#x9AD8;&#x3002;</p>
<p><strong>3. &#x66B4;&#x529B;&#x7834;&#x89E3;</strong></p>
<p>&#x66B4;&#x7834;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x7528;&#x4E8E;&#x5B9E;&#x65F6;&#x7684;&#x5BC6;&#x7801;&#x83B7;&#x53D6;&#xFF0C;&#x800C;&#x662F;&#x4F1A;&#x5728;&#x6C89;&#x9ED8;&#x72B6;&#x6001;&#x4E0B;&#xFF0C;&#x5BF9;&#x672A;&#x77E5; WiFi &#x8FDB;&#x884C;&#x66B4;&#x529B;&#x7834;&#x89E3;&#xFF0C;&#x7834;&#x89E3;&#x6210;&#x529F;&#x7684; WiFi &#x4E0A;&#x4F20;&#x5230;&#x4E91;&#x7AEF;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x53EF;&#x80FD;&#x5728;&#x8F6F;&#x4EF6;&#x4E0A;&#x7EBF;&#x7684;&#x521D;&#x671F;&#x4F7F;&#x7528;&#xFF0C;&#x53EA;&#x662F;&#x6211;&#x7684;&#x4E00;&#x79CD;&#x731C;&#x6D4B;&#x3002;</p>
<h3 id="&#x88AB;&#x8E6D;&#x7F51;&#x5B58;&#x5728;&#x7684;&#x5371;&#x5BB3;">&#x88AB;&#x8E6D;&#x7F51;&#x5B58;&#x5728;&#x7684;&#x5371;&#x5BB3;</h3><p>&#x5982;&#x679C;&#x5BB6;&#x91CC;&#x7684;&#x7F51;&#x7EDC;&#x88AB;&#x5C0F;&#x767D;&#x7528;&#x6237;&#x8E6D;&#x4E86;&#xFF0C;&#x65E0;&#x975E;&#x5C31;&#x662F;&#x5927;&#x5BB6;&#x540C;&#x65F6;&#x4E0A;&#x7F51;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7F51;&#x901F;&#x4F1A;&#x6162;&#x4E00;&#x70B9;&#xFF0C;&#x800C;&#x5982;&#x679C;&#x4F60;&#x5BB6;&#x7F51;&#x7EDC;&#x88AB;&#x4E00;&#x4E2A;&#x5177;&#x5907;&#x9ED1;&#x5BA2;&#x7D20;&#x8D28;&#x7684;&#x4EBA;&#x8E6D;&#x4E0A;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5F15;&#x8D77;&#x6CE8;&#x610F;&#x4E86;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5BB6;&#x91CC;&#x6709; WiFi&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x5B9A;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x8DEF;&#x7531;&#x5668;&#x5427;&#xFF0C;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x5BC6;&#x7801;&#x8FD8;&#x662F;&#x521D;&#x59CB;&#x72B6;&#x6001;&#x7684; guest/admin &#x4E48;&#xFF0C;&#x6216;&#x8005;&#x88AB;&#x4F60;&#x8BBE;&#x7F6E;&#x6210;&#x4E86;&#x516D;&#x4E2A;8&#xFF1F;&#x5982;&#x679C;&#x6211;&#x662F;&#x8FD9;&#x4E2A;&#x653B;&#x51FB;&#x8005;&#xFF0C;&#x4E00;&#x5B9A;&#x4F1A;&#x60F3;&#x5404;&#x79CD;&#x529E;&#x6CD5;&#x62FF;&#x5230;&#x4F60;&#x4EEC;&#x5BB6;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x5982;&#x679C;&#x8FD0;&#x6C14;&#x597D;&#x8FDB;&#x53BB;&#x4E86;&#xFF0C;&#x4E0B;&#x4E00;&#x6B65;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x628A;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x7F51;&#x5173;&#x8BBE;&#x7F6E;&#x6210;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x7535;&#x8111;&#xFF0C;&#x7136;&#x540E;&#x5404;&#x79CD;&#x622A;&#x83B7;&#x548C;&#x6CE8;&#x5165;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6CA1;&#x6709;&#x653B;&#x514B;&#x8DEF;&#x7531;&#x5668;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x5728;&#x4E00;&#x4E2A;&#x5C40;&#x57DF;&#x7F51;&#x5185;&#x7684;&#x6761;&#x4EF6;&#xFF0C;&#x901A;&#x8FC7;&#x5171;&#x4EAB;&#x3001;&#x7F51;&#x7EDC;&#x5E7F;&#x64AD;&#x7B49;&#x5404;&#x79CD;&#x6B3A;&#x9A97;&#x624B;&#x6BB5;&#x5FFD;&#x60A0;&#x5C0F;&#x767D;&#x7528;&#x6237;&#x4E0A;&#x5F53;&#xFF0C;&#x65B9;&#x6CD5;&#x603B;&#x662F;&#x5F88;&#x591A;&#x7684;&#x3002;&#x53EA;&#x8981;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x53E3;&#x5B50;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x4F60;&#x7684;&#x624B;&#x673A;/&#x7535;&#x8111;&#x5C31;&#x88AB;&#x63A7;&#x5236;&#x4E86;&#xFF0C;&#x6295;&#x6BD2;&#x3001;&#x6B3A;&#x9A97;&#x3001;&#x8BF1;&#x9A97;&#x7B49;&#xFF0C;&#x80FD;&#x7528;&#x4E0A;&#x7684;&#x90FD;&#x4F1A;&#x7528;&#x4E0A;&#x3002;</p>
<h3 id="&#x5982;&#x4F55;&#x9632;&#x6B62;&#x88AB;&#x8E6D;">&#x5982;&#x4F55;&#x9632;&#x6B62;&#x88AB;&#x8E6D;</h3><p>&#x4F60;&#x624B;&#x673A;&#x4E0A;&#x6CA1;&#x6709;&#x5B89;&#x88C5; WiFi &#x4E07;&#x80FD;&#x94A5;&#x5319;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x5C06;&#x5BC6;&#x7801;&#x544A;&#x8BC9;&#x65C1;&#x8FB9;&#x7684;&#x90BB;&#x5C45;&#x3001;&#x8DEF;&#x4EBA;&#xFF0C;&#x7ED3;&#x679C;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x7F51;&#x7EDC;&#x8FD8;&#x662F;&#x88AB;&#x8E6D;&#x5230;&#x4E86;&#x3002;&#x4E3A;&#x5565;&#x5462;&#xFF1F;&#x56DE;&#x60F3;&#x4E0B;&#xFF0C;&#x539F;&#x6765;&#x4E0A;&#x4E2A;&#x6708;&#x4F60;&#x5BB6;&#x5916;&#x7525;&#x8FC7;&#x6765;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x4ED6;&#x624B;&#x673A;&#x4E0A;&#x6709;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x2026;</p>
<p>&#x9632;&#x6B62;&#x88AB;&#x8E6D;&#x7684;&#x6700;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#xFF0C;&#x5BC6;&#x7801;&#x4E0D;&#x544A;&#x8BC9;&#x4EFB;&#x4F55;&#x4EBA;&#xFF0C;&#x5373;&#x4FBF;&#x662F;&#x5916;&#x7525;&#x3002;&#x73B0;&#x5728;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x9ED8;&#x8BA4;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x4E24;&#x4E2A; WiFi&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5BF9; sub-WiFi &#x8FDB;&#x884C;&#x6D41;&#x91CF;&#x9650;&#x5236;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6709;&#x4E9B; WiFi &#x505A;&#x7684;&#x6BD4;&#x8F83;&#x6210;&#x719F;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x81EA;&#x5DF1;&#x7684;&#x624B;&#x673A;&#x76D1;&#x63A7;&#x8FDE;&#x63A5;&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x7136;&#x540E;&#x8BBE;&#x7F6E;&#x767D;&#x540D;&#x5355;&#x548C;&#x9ED1;&#x540D;&#x5355;&#x3002;&#x4E0D;&#x8FC7;&#x4F30;&#x8BA1;&#x7528;&#x8FD9;&#x79CD; WiFi &#x7684;&#x4EBA;&#x4E0D;&#x4F1A;&#x5F88;&#x591A;&#xFF0C;&#x4E00;&#x822C;&#x7684; WiFi &#x4E5F;&#x652F;&#x6301;&#x5728; Web &#x754C;&#x9762;&#x4E0A;&#x63A7;&#x5236;&#x4E0A;&#x7F51;&#x8BBE;&#x5907;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x662F;&#xFF0C;&#x5728;&#x8DEF;&#x7531;&#x5668;&#x4E2D;&#xFF0C;&#x5C06;&#x65E0;&#x7EBF;&#x8BBE;&#x7F6E;&#x7684; SSID &#x5E7F;&#x64AD;&#x6539;&#x4E3A;&#x300C;&#x9690;&#x85CF;&#x300D;&#xFF0C;&#x5468;&#x8FB9;&#x8BBE;&#x5907;&#x5C31;&#x6CA1;&#x529E;&#x6CD5;&#x627E;&#x5230;&#x4F60;&#x5BB6;&#x7684; WiFi &#x7F51;&#x7EDC;&#x4E86;&#x3002;</p>
<h3 id="&#x5E38;&#x89C4;&#x7684;_WiFi_&#x70ED;&#x70B9;&#x8BBE;&#x7F6E;&#x539F;&#x7406;">&#x5E38;&#x89C4;&#x7684; WiFi &#x70ED;&#x70B9;&#x8BBE;&#x7F6E;&#x539F;&#x7406;</h3><p>&#x5206;&#x4EAB;&#x4E00;&#x6BB5;&#x8DD1;&#x9898;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x4EE5;&#x524D;&#x4F7F;&#x7528; Window/Linux &#x7CFB;&#x7EDF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C1D;&#x8BD5;&#x8FC7;&#x5C06;&#x81EA;&#x5DF1;&#x7684;&#x7535;&#x8111;&#x4F5C;&#x4E3A;&#x70ED;&#x70B9;&#x628A;&#x7F51;&#x7EDC;&#x5206;&#x4EAB;&#x7ED9;&#x5176;&#x4ED6;&#x540C;&#x5B66;&#xFF0C;&#x521A;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x4E86;&#x53EB;&#x505A; &#x730E;&#x8C79;WiFi &#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x540E;&#x6765;&#x81EA;&#x5DF1;&#x4E5F;&#x5F00;&#x59CB;&#x6572;&#x4EE3;&#x7801;&#x6298;&#x817E;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5728; window &#x4E0B;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x5C31;&#x80FD;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x65E0;&#x7EBF;&#x70ED;&#x70B9;&#xFF1A;</p>
<table><tr><td class="code"><pre><div><span class="line">netsh wlan <span class="built_in">set</span> myWiFi mode=allow ssid=YOUR_WiFi_NAME key=WiFi_PASSWORD</span></div></pre></td></tr></table>
<p>&#x4E0A;&#x8FF0;&#x547D;&#x4EE4;&#x4F1A;&#x5728;&#x7CFB;&#x7EDF;&#x7684;&#x67D0;&#x4E2A;&#x4F4D;&#x7F6E;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x5176;&#x4E2D; key &#x662F;&#x660E;&#x6587;&#x4FDD;&#x5B58;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x5982;&#x4E0B;&#x547D;&#x4EE4;&#x5C31;&#x80FD;&#x5F00;&#x542F; WiFi&#xFF1A;</p>
<table><tr><td class="code"><pre><div><span class="line"><span class="comment"># &#x5F00;&#x542F; WiFi</span></span></div><div><span class="line">net wlan start myWiFi </span></div><div><span class="line"><span class="comment"># &#x5173;&#x95ED; WiFi</span></span></div><div><span class="line">net wlan stop myWiFi</span></div></pre></td></tr></table>
<p>Linux &#x4E0B;&#x7A0D;&#x5FAE;&#x8D39;&#x52B2;&#x4E9B;&#xFF0C;&#x914D;&#x5408; hostpd &#x548C; dnsmasq&#xFF0C;&#x4E0D;&#x8FC7;&#x4E5F;&#x662F;&#x5DEE;&#x4E0D;&#x591A;&#x51E0;&#x884C;&#x4EE3;&#x7801;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<h3 id="&#x6700;&#x540E;">&#x6700;&#x540E;</h3><p>&#x672C;&#x6587;&#x4E3B;&#x8981;&#x662F;&#x5BF9; WiFi &#x4E07;&#x80FD;&#x94A5;&#x5319;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x76F8;&#x5173;&#x529F;&#x80FD;&#x7684;&#x4E00;&#x4E9B;&#x731C;&#x6D4B;&#xFF0C;&#x5177;&#x4F53;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#xFF0C;&#x53EF;&#x4EE5;&#x53BB;&#x7F51;&#x4E0A;&#x89C2;&#x6469;&#x4E0B;&#x9A87;&#x5BA2;&#x4EEC;&#x5BF9;&#x8F6F;&#x4EF6;&#x4EE3;&#x7801;&#x7684;&#x53CD;&#x7F16;&#x8BD1;&#x3002;</p></div>
</div>

</body>
</html>