<!DOCTYPE html>
<html>
<head>
  
  <title>&#x9875;&#x9762;&#x8DF3;&#x8F6C;&#x65F6;&#xFF0C;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#x4E22;&#x5931;&#x95EE;&#x9898;&#x63A2;&#x8BA8;</title>
  
</head>
<body>

<div id="wrap">
  <h1>&#x9875;&#x9762;&#x8DF3;&#x8F6C;&#x65F6;&#xFF0C;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#x4E22;&#x5931;&#x95EE;&#x9898;&#x63A2;&#x8BA8;</h1>
  <div id="content"><p>&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x5730;&#x4E86;&#x89E3;&#x7528;&#x6237;&#x5BF9;&#x4EA7;&#x54C1;&#x7684;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#xFF0C;&#x4E1A;&#x52A1;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x4F1A;&#x6536;&#x5230;&#x57CB;&#x70B9;&#x7EDF;&#x8BA1;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x6536;&#x96C6;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x7528;&#x6237;&#x5149;&#x6807;&#x5728;&#x9875;&#x9762;&#x4E2D;&#x7684;&#x8FD0;&#x52A8;&#x60C5;&#x51B5;&#xFF0C;&#x5305;&#x62EC;&#x5149;&#x6807;&#x79FB;&#x52A8;&#x3001;&#x70B9;&#x51FB;&#x7B49;&#x884C;&#x4E3A;</li>
<li>&#x7EDF;&#x8BA1;&#x7528;&#x6237;&#x6EDA;&#x5C4F;&#x884C;&#x4E3A;</li>
<li>&#x7EDF;&#x8BA1;&#x7528;&#x6237;&#x5728;&#x7AD9;&#x70B9;&#x7684;&#x505C;&#x7559;&#x65F6;&#x957F;</li>
<li>&#x6536;&#x96C6;&#x9875;&#x9762;&#x94FE;&#x63A5;&#x7684;&#x70B9;&#x51FB;&#x6570;&#x91CF;&#x7B49;</li>
</ul>
<a id="more"/>
<p>&#x65E0;&#x8BBA;&#x662F;&#x79FB;&#x52A8;&#x7AEF;&#x8FD8;&#x662F; PC &#x7AEF;&#xFF0C;&#x76F8;&#x4FE1;&#x5F88;&#x591A;&#x670B;&#x53CB;&#x90FD;&#x9047;&#x5230;&#x4E86;&#x8FD9;&#x4E48;&#x51E0;&#x4E2A;&#x5341;&#x5206;&#x8BA9;&#x4EBA;&#x5934;&#x75BC;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x7EDF;&#x8BA1;&#x67D0;&#x4E2A;&#x94FE;&#x63A5;&#x7684;&#x70B9;&#x51FB;&#x91CF;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x94FE;&#x63A5;&#x70B9;&#x51FB;&#x540E;&#x76F4;&#x63A5;&#x8DF3;&#x8F6C;&#x8D70;&#x4E86;</li>
<li>&#x7EDF;&#x8BA1;&#x9875;&#x9762;&#x65F6;&#x957F;&#x95EE;&#x9898;&#xFF0C;unload &#x7684;&#x65F6;&#x5019;&#x53D1;&#x9001;&#x7684;&#x7EDF;&#x8BA1;&#x4E22;&#x5931;&#x4E86;</li>
<li>&#x7EDF;&#x8BA1;&#x811A;&#x672C;&#x8FD8;&#x6CA1;&#x6709;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x7528;&#x6237;&#x4E0D;&#x611F;&#x5174;&#x8DA3;&#x5DF2;&#x7ECF;&#x8D70;&#x4EBA;&#x4E86;&#x7B49;</li>
</ul>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x6837;&#x7684;&#x6570;&#x636E;&#x4EA4;&#x7ED9;&#x4E86;&#x4EA7;&#x54C1;&#x540C;&#x5B66;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x4ED6;&#x4EEC;&#x5BF9;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x4EA7;&#x751F;&#x9519;&#x8BEF;&#x7684;&#x8BA4;&#x77E5;&#xFF0C;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x5F71;&#x54CD;&#x4EA7;&#x54C1;&#x7684;&#x4E0B;&#x4E00;&#x6B65;&#x6539;&#x5584;&#x3002;</p>
<h3 id="&#x4F20;&#x7EDF;&#x89E3;&#x51B3;&#x65B9;&#x6848;">&#x4F20;&#x7EDF;&#x89E3;&#x51B3;&#x65B9;&#x6848;</h3><p>&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4ECE;&#x6280;&#x672F;&#x89D2;&#x5EA6;&#x53EF;&#x4EE5;&#x5F52;&#x7EB3;&#x4E3A;&#x4E24;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x7528;&#x6237;&#x5173;&#x95ED;&#x9875;&#x9762;&#x8FC7;&#x65E9;&#xFF0C;&#x7EDF;&#x8BA1;&#x811A;&#x672C;&#x8FD8;&#x672A;&#x52A0;&#x8F7D;/&#x521D;&#x59CB;&#x5316;&#x5B8C;&#x6210;</li>
<li>&#x7528;&#x6237;&#x5173;&#x95ED;&#x6216;&#x8005;&#x8DF3;&#x51FA;&#x9875;&#x9762;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8BF7;&#x6C42;&#x672A;&#x53D1;&#x51FA;</li>
</ul>
<p>&#x9488;&#x5BF9;&#x7B2C;&#x4E00;&#x70B9;&#xFF0C;&#x6982;&#x7387;&#x8F83;&#x5C0F;&#xFF0C;&#x4E00;&#x822C;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#xFF0C;&#x4E0D;&#x8981;&#x628A;&#x7EDF;&#x8BA1;&#x811A;&#x672C;&#x53C2;&#x5408;&#x5230;&#x5176;&#x4ED6;&#x811A;&#x672C;&#x4E2D;&#xFF0C;&#x5355;&#x72EC;&#x52A0;&#x8F7D;&#xFF0C;&#x5E76;&#x4E14;&#x653E;&#x5728;&#x524D;&#x5934;&#xFF0C;&#x8BA9;&#x5B83;&#x4F18;&#x5148;&#x52A0;&#x8F7D;&#x3002;&#x5F88;&#x591A;&#x516C;&#x53F8;&#x7684;&#x505A;&#x6CD5;&#x662F;&#xFF0C;&#x4E0D;&#x8BA9;&#x5F00;&#x53D1;&#x8005;&#x5173;&#x5FC3;&#x7EDF;&#x8BA1;&#x811A;&#x672C;&#x7684;&#x52A0;&#x8F7D;&#xFF0C;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#x9875;&#x9762;&#x7684;&#x65F6;&#x5019;&#xFF0C;Nginx &#x4F1A;&#x5728; Body &#x5F00;&#x59CB;&#x6807;&#x7B7E;&#x4F4D;&#x7F6E;&#x6CE8;&#x5165;&#x4E00;&#x6BB5;&#x811A;&#x672C;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x95EE;&#x9898;&#x4E8C;&#xFF0C;&#x5904;&#x7406;&#x65B9;&#x6848;&#x5C31;&#x6709;&#x5F88;&#x591A;&#x4E86;&#x3002;</p>
<p><strong>1. &#x963B;&#x585E;&#x5F0F;&#x7684; Ajax &#x8BF7;&#x6C42;</strong></p>
<p>&#x8FD8;&#x8BB0;&#x5F97; <code>XMLHttpRequest::open</code> &#x65B9;&#x6CD5;&#x7684;&#x7B2C;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x5427;&#xFF0C;&#x5982;&#x679C;&#x8BBE;&#x7F6E;&#x4E3A; false &#x5C31;&#x662F;&#x540C;&#x6B65;&#x52A0;&#x8F7D;&#xFF0C;</p>
<table><tr><td class="code"><pre><div><span class="line"><span class="built_in">window</span>.addEventListener(<span class="string">&apos;unload&apos;</span>, <span class="function"><span class="keyword">function</span>(<span class="params">event</span>) </span>{</span></div><div><span class="line">  <span class="keyword">var</span> xhr = <span class="keyword">new</span> XMLHttpRequest(),</span></div><div><span class="line">  xhr.setRequestHeader(<span class="string">&quot;Content-Type&quot;</span>, <span class="string">&quot;text/plain;charset=UTF-8&quot;</span>);</span></div><div><span class="line">  xhr.open(<span class="string">&apos;post&apos;</span>, <span class="string">&apos;/log&apos;</span>, <span class="literal">false</span>); <span class="comment">// &#x540C;&#x6B65;&#x8BF7;&#x6C42;</span></span></div><div><span class="line">  xhr.send(data);</span></div><div><span class="line">});</span></div></pre></td></tr></table>
<p>&#x963B;&#x585E;&#x9875;&#x9762;&#x5173;&#x95ED;&#xFF0C;&#x5F53;&#x7136;&#x53EF;&#x4EE5;&#x5728; <code>readState</code> &#x4E3A; 2 &#x7684;&#x65F6;&#x5019;&#x5C31; abort &#x8BF7;&#x6C42;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4E0D;&#x5173;&#x5FC3;&#x54CD;&#x5E94;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x53EA;&#x8981;&#x8BF7;&#x6C42;&#x53D1;&#x51FA;&#x53BB;&#x5C31;&#x884C;&#x4E86;&#x3002;</p>
<p><strong>2. &#x66B4;&#x529B;&#x7684;&#x6B7B;&#x5FAA;&#x73AF;</strong></p>
<p>&#x539F;&#x7406;&#x8DDF;&#x4E0A;&#x9762;&#x7C7B;&#x4F3C;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x7A7A;&#x7684;&#x6B7B;&#x5FAA;&#x73AF;&#x963B;&#x585E;&#x9875;&#x9762;&#x5173;&#x95ED;&#xFF0C;</p>
<table><tr><td class="code"><pre><div><span class="line"><span class="built_in">window</span>.addEventListener(<span class="string">&apos;unload&apos;</span>, <span class="function"><span class="keyword">function</span>(<span class="params">event</span>) </span>{</span></div><div><span class="line">  send(data);</span></div><div><span class="line">  <span class="keyword">var</span> now = +<span class="keyword">new</span> <span class="built_in">Date</span>;</span></div><div><span class="line">  <span class="keyword">while</span>(<span class="keyword">new</span> <span class="built_in">Date</span> - now &gt;= <span class="number">10</span>) {} <span class="comment">// &#x963B;&#x585E; 10ms</span></span></div><div><span class="line">});</span></div></pre></td></tr></table>
<p><strong>3. &#x53D1;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#x8BF7;&#x6C42;&#x963B;&#x585E;</strong></p>
<p>&#x5927;&#x90E8;&#x5206;&#x6D4F;&#x89C8;&#x5668;&#x90FD;&#x4F1A;&#x7B49;&#x5F85;&#x56FE;&#x7247;&#x7684;&#x52A0;&#x8F7D;&#xFF0C;&#x8D81;&#x8FD9;&#x4E2A;&#x673A;&#x4F1A;&#x628A;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#x53D1;&#x9001;&#x51FA;&#x53BB;</p>
<table><tr><td class="code"><pre><div><span class="line"><span class="built_in">window</span>.addEventListener(<span class="string">&apos;unload&apos;</span>, <span class="function"><span class="keyword">function</span>(<span class="params">event</span>) </span>{</span></div><div><span class="line">  send(data);</span></div><div><span class="line">  (<span class="keyword">new</span> Image).src = <span class="string">&apos;http://example.com/s.gif&apos;</span>;</span></div><div><span class="line">});</span></div></pre></td></tr></table>
<p>&#x4EE5;&#x4E0A;&#x63D0;&#x5230;&#x7684;&#x51E0;&#x4E2A;&#x65B9;&#x6848;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x539F;&#x7406;&#xFF0C;&#x8BA9;&#x6D4F;&#x89C8;&#x5668;&#x7EE7;&#x7EED;&#x4FDD;&#x6301;&#x963B;&#x585E;&#x72B6;&#x6001;&#xFF0C;&#x7B49;&#x6570;&#x636E;&#x53D1;&#x9001;&#x51FA;&#x53BB;&#x540E;&#x518D;&#x8DF3;&#x8F6C;&#xFF0C;&#x8FD9;&#x91CC;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF1A;</p>
<ul>
<li>&#x5C11;&#x91CF;&#x6D4F;&#x89C8;&#x5668;&#x4E0B;&#x53EF;&#x80FD;&#x4E0D;&#x594F;&#x6548;</li>
<li>&#x7B49;&#x5F85;&#x4E00;&#x4F1A;&#x513F;&#x518D;&#x8DF3;&#x8F6C;&#xFF0C;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x4E0A;&#x6253;&#x4E86;&#x6298;&#x6263;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x79FB;&#x52A8;&#x7AEF;&#x4E0A;</li>
</ul>
<p>&#x662F;&#x5426;&#x6709;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6848;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5462;&#xFF0C;&#x524D;&#x7AEF;&#x540C;&#x5B66;&#x79C9;&#x7740;&#x300C;&#x5C0F;&#x5F3A;&#x7CBE;&#x795E;&#x300D;&#x4E5F;&#x63D0;&#x51FA;&#x4E86;&#x4E24;&#x4E2A;&#x53EF;&#x5B9E;&#x8DF5;&#x7684;&#x65B9;&#x6848;&#x3002;</p>
<h3 id="&#x4F18;&#x5316;&#x65B9;&#x6848;">&#x4F18;&#x5316;&#x65B9;&#x6848;</h3><p>&#x4E0D;&#x5C31;&#x662F;&#x57CB;&#x70B9;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#x561B;&#xFF0C;&#x975E;&#x5F97;&#x5728;&#x5F53;&#x524D;&#x9875;&#x9762;&#x53D1;&#x9001;&#x51FA;&#x53BB;&#xFF1F;&#x4F18;&#x5316;&#x65B9;&#x6848;&#x7684;&#x601D;&#x8DEF;&#x5177;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x8DF3;&#x8DC3;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x5C06;&#x6570;&#x636E;&#x5728;&#x4E0B;&#x8DF3;&#x9875;&#x4E2D;&#x53D1;&#x9001;&#xFF0C;&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x5C31;&#x8F6C;&#x6362;&#x4E3A;&#xFF0C;&#x5982;&#x4F55;&#x5C06;&#x6570;&#x636E;&#x4F20;&#x9012;&#x7ED9;&#x4E0B;&#x8DF3;&#x9875;&#xFF1F;</p>
<p>&#x5BF9;&#x4E8E;&#x94FE;&#x63A5;&#x70B9;&#x51FB;&#x91CF;&#x7684;&#x7EDF;&#x8BA1;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x94FE;&#x63A5;&#x4FE1;&#x606F;&#x901A;&#x8FC7; url &#x4F20;&#x9012;&#x7ED9;&#x4E0B;&#x8DF3;&#x9875;&#xFF0C;&#x4F20;&#x9012;&#x601D;&#x8DEF;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><strong>1. url &#x4F20;&#x53C2;</strong></p>
<p>&#x901A;&#x8FC7;&#x6570;&#x7EC4;&#x6807;&#x8BC6;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x7684;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#xFF0C;&#x5982; <code>[&#x7AD9;&#x70B9;id&#xFF0C;&#x9875;&#x9762;id&#xFF0C;&#x6A21;&#x5757;id&#xFF0C;&#x94FE;&#x63A5;index]</code>&#xFF0C;&#x901A;&#x8FC7;&#x56DB;&#x4E2A;&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x60DF;&#x4E00;&#x6807;&#x8BC6;&#x94FE;&#x63A5;&#x4F4D;&#x7F6E;&#x5C5E;&#x6027;&#xFF0C;&#x4F7F;&#x7528; URL param &#x53C2;&#x6570;&#x5C06;&#x6570;&#x7EC4;&#x6570;&#x636E;&#x4F20;&#x9012;&#x7ED9;&#x4E0B;&#x8DF3;&#x9875;&#xFF0C;&#x7B49;&#x5F85;&#x7531;&#x4E0B;&#x8DF3;&#x9875;&#x5C06;&#x6570;&#x636E;&#x53D1;&#x9001;&#x51FA;&#x53BB;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x4E0B;&#x8DF3;&#x9875;&#x4E2D;&#x5FC5;&#x987B;&#x90E8;&#x7F72;&#x540C;&#x6837;&#x7684;&#x7EDF;&#x8BA1;&#x811A;&#x672C;&#xFF0C;&#x4F46;&#x5BF9;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x505A;&#x5230;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x4E0D;&#x4F1A;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x7F51;&#x9875;&#x4E0A;&#x653E;&#x5176;&#x4ED6;&#x7F51;&#x7AD9;&#x7684;&#x94FE;&#x63A5;&#x5427;&#xFF0C;&#x6240;&#x4EE5;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x7684;&#x7EDF;&#x8BA1;&#x90FD;&#x5728;&#x4E00;&#x4E2A;&#x95ED;&#x73AF;&#x5185;&#x3002;</p>
<p><strong>2. &#x901A;&#x8FC7; <code>window.name</code> &#x4F20;&#x9012;&#x6570;&#x636E;</strong></p>
<p><code>window.name</code> &#x662F;&#x6D4F;&#x89C8;&#x5668;&#x7ED9;&#x6211;&#x4EEC;&#x5F00;&#x653E;&#x7684;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x8BBE;&#x7F6E;&#x8BE5;&#x5C5E;&#x6027;&#x7684;&#x503C;&#x540E;&#xFF0C;&#x5373;&#x4FBF;&#x9875;&#x9762;&#x53D1;&#x751F;&#x4E86;&#x8DF3;&#x8F6C;&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;&#x4F9D;&#x7136;&#x4E0D;&#x4F1A;&#x53D8;&#x5316;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x8DE8;&#x57DF;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x8BE5;&#x5C5E;&#x6027;&#x53EF;&#x80FD;&#x88AB;&#x5F00;&#x53D1;&#x8005;&#x7528;&#x4E8E;&#x5176;&#x4ED6;&#x9014;&#x5F84;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x9650;&#x5236;&#x5F00;&#x53D1;&#x8005;&#x76F4;&#x63A5;&#x4F7F;&#x7528; <code>window.name</code>&#xFF0C;&#x5C01;&#x88C5;&#x63A5;&#x53E3;&#xFF0C;&#x901A;&#x8FC7;&#x63A5;&#x53E3;&#x8C03;&#x7528;&#xFF0C;&#x5982; aralejs &#x63D0;&#x4F9B;&#x7684; <a href="https://github.com/aralejs/name-storage" target="_blank" rel="external">nameStorage</a>&#xFF0C;</p>
<table><tr><td class="code"><pre><div><span class="line">nameStorage.setItem(key, value);</span></div><div><span class="line">nameStorage.getItem(key);</span></div><div><span class="line">nameStorage.removeItem(key);</span></div></pre></td></tr></table>
<p>&#x50A8;&#x5B58;&#x5F62;&#x5F0F;&#x4E3A;&#xFF1A;</p>
<table><tr><td class="code"><pre><div><span class="line">    scheme                  nameStorage datas</span></div><div><span class="line">      |                            |</span></div><div><span class="line"><span class="comment">------------           ------------------------</span></span></div><div><span class="line">nameStorage:origin-<span class="property">name</span>?key1=value1&amp;key2=value2</span></div><div><span class="line">            <span class="comment">-----------</span></span></div><div><span class="line">                 |</span></div><div><span class="line">         window origin <span class="property">name</span></span></div></pre></td></tr></table>
<p>&#x4EE5;&#x4E0A;&#x867D;&#x7136;&#x57FA;&#x672C;&#x89E3;&#x51B3;&#x4E86;&#x6570;&#x636E;&#x4E22;&#x5931;&#x548C;&#x4F53;&#x9A8C;&#x5DEE;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E5F;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4F9D;&#x8D56;&#x4E8E;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x7F16;&#x7A0B;&#x4E60;&#x60EF;&#xFF0C;&#x5982;&#x4E0D;&#x80FD;&#x968F;&#x4FBF;&#x73A9;&#x800D; <code>window.name</code>&#xFF1B;&#x4E5F;&#x5BF9;&#x7CFB;&#x7EDF;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x5FC5;&#x987B;&#x5728;&#x6240;&#x6709;&#x9875;&#x9762;&#x4E0A;&#x90E8;&#x7F72;&#x540C;&#x6837;&#x7684;&#x57CB;&#x70B9;&#x811A;&#x672C;&#x3002;</p>
<h3 id="&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x5E94;&#x8BE5;&#x4EA4;&#x7ED9;&#x6D4F;&#x89C8;&#x5668;&#x6765;&#x89E3;&#x51B3;">&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x5E94;&#x8BE5;&#x4EA4;&#x7ED9;&#x6D4F;&#x89C8;&#x5668;&#x6765;&#x89E3;&#x51B3;</h3><p>&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x5404;&#x79CD;&#x65B9;&#x6848;&#xFF0C;&#x4E0D;&#x4E4F;&#x9ED1;&#x79D1;&#x6280;&#xFF0C;&#x7136;&#x800C;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;&#x8FD8;&#x662F;&#x4E00;&#x5927;&#x5806;&#xFF0C;&#x5982;&#x679C;&#x56E2;&#x961F;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x6267;&#x884C;&#x529B;&#x4E0D;&#x591F;&#xFF0C;&#x4E2D;&#x9014;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x5404;&#x79CD;&#x9EBB;&#x70E6;&#x3002;&#x6240;&#x4EE5;&#x771F;&#x6B63;&#x80FD;&#x591F;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x5FC5;&#x7136;&#x8FD8;&#x662F;&#x6D4F;&#x89C8;&#x5668;&#x672C;&#x8EAB;&#xFF01;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x80FD;&#x7ED9;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x8FD9;&#x6837;&#x4E00;&#x4E2A; API&#xFF0C;&#x5373;&#x4F7F;&#x9875;&#x9762;&#x8DF3;&#x8F6C;&#x4E86;&#xFF0C;&#x4E5F;&#x80FD;&#x591F;&#x5C06;&#x4E0A;&#x4E2A;&#x9875;&#x9762;&#x7684;&#x8BF7;&#x6C42;&#x53D1;&#x51FA;&#x53BB;&#x5462;&#xFF1F;&#x5E86;&#x5E78;&#x7684;&#x662F;&#xFF0C;W3C &#x5DE5;&#x4F5C;&#x7EC4;&#x4E5F;&#x60F3;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x63D0;&#x51FA;&#x4E86; <code>Beacon API</code> &#x7684; <a href="https://www.w3.org/TR/beacon/" target="_blank" rel="external">&#x8349;&#x6848;</a>&#x3002;</p>
<p><code>Beacon API</code> &#x5141;&#x8BB8;&#x5F00;&#x53D1;&#x8005;&#x53D1;&#x9001;&#x5C11;&#x91CF;&#x9519;&#x8BEF;&#x5206;&#x6790;&#x548C;&#x4E0A;&#x62A5;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5B83;&#x7684;&#x7279;&#x70B9;&#x5F88;&#x660E;&#x663E;&#xFF1A;</p>
<ul>
<li>&#x5728;&#x7A7A;&#x95F2;&#x7684;&#x65F6;&#x5019;&#x5F02;&#x6B65;&#x53D1;&#x9001;&#x7EDF;&#x8BA1;&#xFF0C;&#x4E0D;&#x5F71;&#x54CD;&#x9875;&#x9762;&#x8BF8;&#x5982; JS&#x3001;CSS Animation &#x7B49;&#x6267;&#x884C;</li>
<li>&#x5373;&#x4F7F;&#x9875;&#x9762;&#x5728; unload &#x72B6;&#x6001;&#x4E0B;&#xFF0C;&#x4E5F;&#x4F1A;&#x5F02;&#x6B65;&#x53D1;&#x9001;&#x7EDF;&#x8BA1;&#xFF0C;&#x4E0D;&#x5F71;&#x54CD;&#x9875;&#x9762;&#x8FC7;&#x6E21;/&#x8DF3;&#x8F6C;&#x5230;&#x4E0B;&#x8DF3;&#x9875;</li>
<li>&#x80FD;&#x591F;&#x88AB;&#x5BA2;&#x6237;&#x7AEF;&#x4F18;&#x5316;&#x53D1;&#x9001;&#xFF0C;&#x5C24;&#x5176;&#x5728; Mobile &#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06; Beacon &#x8BF7;&#x6C42;&#x5408;&#x5E76;&#x5230;&#x5176;&#x4ED6;&#x8BF7;&#x6C42;&#x4E0A;&#xFF0C;&#x4E00;&#x540C;&#x5904;&#x7406;</li>
</ul>
<p><code>sendBeacon</code> &#x51FD;&#x6570;&#x6302;&#x5728;&#x5728; navigator &#x4E0A;&#xFF0C;&#x5728; unload &#x4E4B;&#x524D;&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x4E00;&#x5B9A;&#x662F;&#x88AB;&#x521D;&#x59CB;&#x5316;&#x4E86;&#x7684;&#x3002;&#x5176;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x4E3A;&#xFF1A;</p>
<table><tr><td class="code"><pre><div><span class="line"><span class="built_in">window</span>.addEventListener(<span class="string">&apos;unload&apos;</span>, <span class="function"><span class="keyword">function</span>(<span class="params">event</span>) </span>{</span></div><div><span class="line">  navigator.sendBeacon(<span class="string">&apos;/collector&apos;</span>, data);</span></div><div><span class="line">});</span></div></pre></td></tr></table>
<p><code>navigator.sendBeacon(url, data);</code>&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x4E3A;&#x6570;&#x636E;&#x4E0A;&#x62A5;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x4E3A;&#x8981;&#x53D1;&#x9001;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x652F;&#x6301;&#x7684;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x6709;&#xFF1A;ArrayBufferView, Blob, DOMString, &#x548C; FormData&#x3002;</p>
<p><code>Beacon</code> &#x7684;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5B9E;&#x7528;&#x7684;&#x79FB;&#x52A8;&#x7AEF;&#x4F7F;&#x7528;&#x573A;&#x666F;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x4ECE;&#x6D4F;&#x89C8;&#x5668;&#x5207;&#x6362;&#x5230;&#x5176;&#x4ED6; app &#x754C;&#x9762;&#x6216;&#x8005; Home &#x5C4F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90E8;&#x5206;&#x6D4F;&#x89C8;&#x5668;&#x9ED8;&#x8BA4;&#x4F1A;&#x505C;&#x6B62;&#x9875;&#x9762;&#x811A;&#x672C;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#x4E86; unload &#x65F6;&#x95F4;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x4F60;&#x5931;&#x671B;&#xFF0C;&#x56E0;&#x4E3A; unload &#x4E8B;&#x4EF6;&#x5E76;&#x4E0D;&#x4F1A;&#x89E6;&#x53D1;&#xFF0C;&#x6B64;&#x65F6;&#xFF0C;<code>Beacon</code> &#x5C31;&#x6D3E;&#x4E0A;&#x7528;&#x9014;&#x4E86;&#xFF0C;&#x5B83;&#x662F;&#x4E0D;&#x4F1A;&#x53D7;&#x5F71;&#x54CD;&#x7684;&#x3002;</p>
<h3 id="&#x6700;&#x540E;">&#x6700;&#x540E;</h3><p>&#x672C;&#x6587;&#x662F;&#x5BF9;&#x9875;&#x9762;&#x6253;&#x70B9;&#x4E22;&#x5931;&#x95EE;&#x9898;&#x7684;&#x7B80;&#x5355;&#x63A2;&#x8BA8;&#xFF0C;&#x679A;&#x4E3E;&#x4E86;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4F1A;&#x7528;&#x5230;&#x7684;&#x4E00;&#x4E9B;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x5F88;&#x5B8C;&#x5584;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x66F4;&#x597D;&#x7684;&#x5EFA;&#x8BAE;&#xFF0C;&#x53EF;&#x4EE5;&#x63D0;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x7EDE;&#x5C3D;&#x8111;&#x6C41;&#xFF0C;&#x53EF;&#x80FD;&#x5F88;&#x5C11;&#x4F1A;&#x8003;&#x8651;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x4E0D;&#x662F;&#x5E94;&#x8BE5;&#x6709;&#x6211;&#x4EEC;&#x6765;&#x89E3;&#x51B3;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4EA4;&#x7ED9;&#x8C01;&#x5904;&#x7406;&#x662F;&#x6700;&#x6070;&#x5F53;&#x7684;&#x3002;&#x672C;&#x6587;&#x7684;&#x63A2;&#x8BA8;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x672C;&#x8EAB;&#x624D;&#x662F;&#x6700;&#x597D;&#x7684;&#x95EE;&#x9898;&#x89E3;&#x51B3;&#x65B9;&#xFF0C;&#x5F53;&#x7F51;&#x7AD9;&#x6D41;&#x91CF;&#x53D8;&#x5927;&#x4E4B;&#x540E;&#xFF0C;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x4E22;&#x5931;&#x95EE;&#x9898;&#x5C31;&#x66F4;&#x52A0;&#x660E;&#x663E;&#xFF0C;&#x8FD9;&#x4E5F;&#x8FEB;&#x4F7F;&#x6D4F;&#x89C8;&#x5668;&#x672C;&#x8EAB;&#x505A;&#x4E86;&#x6539;&#x5584;&#xFF0C;&#x81EA;&#x7136;&#x4E5F;&#x5728;&#x60C5;&#x7406;&#x4E4B;&#x4E2D;&#x3002;</p></div>
</div>

</body>
</html>