<!DOCTYPE html>
<html>
<head>
  
  <title>&#x5173;&#x4E8E;&#x542F;&#x7528; HTTPS &#x7684;&#x4E00;&#x4E9B;&#x7ECF;&#x9A8C;&#x5206;&#x4EAB;&#xFF08;&#x4E09;&#xFF09;</title>
  
</head>
<body>

<div id="wrap">
  <h1>&#x5173;&#x4E8E;&#x542F;&#x7528; HTTPS &#x7684;&#x4E00;&#x4E9B;&#x7ECF;&#x9A8C;&#x5206;&#x4EAB;&#xFF08;&#x4E09;&#xFF09;</h1>
  <div id="content"><p>&#x5173;&#x4E8E;&#x300C;<a href="https://imququ.com/search.html?s=%E5%85%B3%E4%BA%8E%E5%90%AF%E7%94%A8+HTTPS+%E7%9A%84%E7%BB%8F%E9%AA%8C%E5%88%86%E4%BA%AB">&#x542F;&#x7528; HTTPS &#x7684;&#x7ECF;&#x9A8C;&#x5206;&#x4EAB;</a>&#x300D;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x5199;&#x8FC7;&#x4E24;&#x7BC7;&#x6587;&#x7AE0;&#xFF1A;<a href="https://imququ.com/post/sth-about-switch-to-https.html">&#x7B2C;&#x4E00;&#x7BC7;</a>&#x4E3B;&#x8981;&#x4ECB;&#x7ECD; HTTPS &#x5982;&#x4F55;&#x4E0E;&#x4E00;&#x4E9B;&#x8F83;&#x65B0;&#x7684;&#x5B89;&#x5168;&#x89C4;&#x8303;&#x914D;&#x5408;&#x4F7F;&#x7528;&#xFF0C;&#x9762;&#x5411;&#x7684;&#x662F;&#x73B0;&#x4EE3;&#x6D4F;&#x89C8;&#x5668;&#xFF1B;<a href="https://imququ.com/post/sth-about-switch-to-https-2.html">&#x7B2C;&#x4E8C;&#x7BC7;</a>&#x4E3B;&#x8981;&#x8BA8;&#x8BBA;&#x542F;&#x7528; HTTPS &#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5728; SSL &#x7248;&#x672C;&#x3001;Cipher Suite&#x3001;&#x8BC1;&#x4E66;&#x3001;SSL &#x6269;&#x5C55;&#xFF08;&#x5982; SNI&#xFF09;&#x7B49;&#x65B9;&#x9762;&#x53EF;&#x80FD;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;&#x8001;&#x65E7;&#x6D4F;&#x89C8;&#x5668;&#x4E0B;&#x5982;&#x4F55;&#x53D6;&#x820D;&#x3002;&#x672C;&#x6587;&#x505A;&#x4E3A;&#x672C;&#x7CFB;&#x5217;&#x6700;&#x540E;&#x4E00;&#x7BC7;&#xFF0C;&#x6211;&#x60F3;&#x8865;&#x5145;&#x4E00;&#x4E9B;&#x542F;&#x7528; HTTPS &#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x3002;</p>
<h3 id="-">&#x8D44;&#x6E90;&#x66FF;&#x6362;</h3>
<p>HTTPS &#x7F51;&#x9875;&#x4E2D;&#x52A0;&#x8F7D;&#x7684; HTTP &#x8D44;&#x6E90;&#x88AB;&#x79F0;&#x4E4B;&#x4E3A; Mixed Content&#xFF08;&#x6DF7;&#x5408;&#x5185;&#x5BB9;&#xFF09;&#xFF0C;&#x6211;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x6587;&#x7AE0;&#x4E2D;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x4E86; <code>Optionally-blockable</code> &#x548C; <code>Blockable</code> &#x4E24;&#x7C7B; Mixed Content&#xFF0C;&#x4E5F;&#x4ECB;&#x7ECD;&#x4E86;&#x5404;&#x79CD;&#x6D4F;&#x89C8;&#x5668;&#x5BF9; Mixed Content &#x7684;&#x52A0;&#x8F7D;&#x7B56;&#x7565;&#x3002;&#x4E3A;&#x4E86;&#x6700;&#x597D;&#x7684;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;HTTPS &#x7F51;&#x7AD9;&#x4E0D;&#x8981;&#x51FA;&#x73B0;&#x4EFB;&#x4F55; Mixed Content&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;HTTPS &#x9875;&#x9762;&#x4E2D;&#x6240;&#x6709;&#x8D44;&#x6E90;&#x90FD;&#x5FC5;&#x987B;&#x66FF;&#x6362;&#x4E3A; HTTPS &#x7684;&#x3002;</p>
<p>&#x4EE3;&#x7801;&#x5C42;&#x7684;&#x66FF;&#x6362;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x4E00;&#x4E9B;&#x5B58;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6587;&#x672C;&#xFF08;&#x4F8B;&#x5982;&#x5546;&#x54C1;&#x63CF;&#x8FF0;&#x4E2D;&#x7684;&#x56FE;&#x7247;&#x5730;&#x5740;&#xFF09;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x9057;&#x6F0F;&#xFF0C;&#x9700;&#x8981;&#x7279;&#x522B;&#x6CE8;&#x610F;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#x53EA;&#x6253;&#x7B97;&#x652F;&#x6301; HTTPS&#xFF0C;&#x5C06;&#x6240;&#x6709;&#x5916;&#x94FE;&#x8D44;&#x6E90;&#xFF08;CSS&#x3001;JS&#x3001;&#x56FE;&#x7247;&#x3001;&#x97F3;&#x9891;&#x3001;&#x5B57;&#x4F53;&#x6587;&#x4EF6;&#x3001;&#x5F02;&#x6B65;&#x63A5;&#x53E3;&#x7B49;&#x7B49;&#xFF09;&#x76F4;&#x63A5;&#x66FF;&#x6362;&#x4E3A; HTTPS &#x5730;&#x5740;&#xFF0C;&#x518D;&#x628A;&#x7F51;&#x7AD9; HTTP &#x8BF7;&#x6C42;&#x91CD;&#x5B9A;&#x5411;&#x5230; HTTPS &#x5373;&#x53EF;&#x3002;</p>
<p>&#x5F53;&#x524D;&#x5F88;&#x591A;&#x652F;&#x6301; HTTPS &#x7684;&#x7F51;&#x7AD9;&#x51FA;&#x4E8E;&#x5404;&#x79CD;&#x539F;&#x56E0;&#xFF0C;&#x9488;&#x5BF9;&#x8001;&#x65E7;&#x6D4F;&#x89C8;&#x5668;&#x6216;&#x7279;&#x6B8A;&#x7F51;&#x7EDC;&#x8FD8;&#x662F;&#x5141;&#x8BB8;&#x901A;&#x8FC7; HTTP &#x8BBF;&#x95EE;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#xFF0C;&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x8BA9;&#x6240;&#x6709;&#x8D44;&#x6E90;&#x670D;&#x52A1;&#x90FD;&#x540C;&#x65F6;&#x652F;&#x6301; HTTP/HTTPS &#x8BBF;&#x95EE;&#x3002;&#x8FD9;&#x6837;&#x53EA;&#x8981;&#x9875;&#x9762;&#x5728;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x65F6;&#x7701;&#x7565;&#x534F;&#x8BAE;&#x90E8;&#x5206;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x5C31;&#x80FD;&#x6839;&#x636E;&#x4E3B;&#x9875;&#x9762;&#x534F;&#x8BAE;&#x7C7B;&#x578B;&#x6765;&#x81EA;&#x52A8;&#x9009;&#x62E9; HTTP/HTTPS &#x8D44;&#x6E90;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code class="lang-xml"><span class="hljs-tag">&lt;<span class="hljs-title">img</span> <span class="hljs-attribute">src</span>=<span class="hljs-value">&quot;https://example.com/static/img/blog/ququ.jpg&quot;</span> /&gt;</span>
=&gt;
<span class="hljs-tag">&lt;<span class="hljs-title">img</span> <span class="hljs-attribute">src</span>=<span class="hljs-value">&quot;//example.com/static/img/blog/ququ.jpg&quot;</span> /&gt;</span>
</code></pre>
<p>&#x9488;&#x5BF9;&#x73B0;&#x4EE3;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; <code>upgrade-insecure-requests</code> &#x8FD9;&#x4E2A; CSP &#x6307;&#x4EE4;&#xFF0C;&#x8BA9;&#x6D4F;&#x89C8;&#x5668;&#x81EA;&#x52A8;&#x66FF;&#x6362;&#x3002;&#x66F4;&#x591A;&#x8BF4;&#x660E;&#xFF0C;<a href="https://imququ.com/post/sth-about-switch-to-https.html#toc-1-1">&#x8BE6;&#x89C1;&#x8FD9;&#x91CC;</a>&#x3002;</p>
<p>&#x7701;&#x7565; URL &#x534F;&#x8BAE;&#x6709;&#x4E2A;&#x98CE;&#x9669;&#x70B9;&#xFF1A;&#x4E2A;&#x522B;&#x79FB;&#x52A8;&#x7F51;&#x7EDC;&#x63D0;&#x4F9B;&#x5546;&#x7BE1;&#x6539;&#x9875;&#x9762;&#x65F6;&#xFF0C;&#x4F1A;&#x5C06;&#x8FD9;&#x79CD;&#x5199;&#x6CD5;&#x7684; URL &#x6539;&#x574F;&#xFF0C;&#x5BFC;&#x81F4;&#x8D44;&#x6E90;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x3002;&#x8BE6;&#x89C1;&#x300A;<a href="https://imququ.com/post/datauri-and-404.html">&#x8BE1;&#x5F02;&#x95EE;&#x9898;&#x6392;&#x67E5;&#x4E4B;&#x300C;DataURI &#x5F15;&#x53D1;&#x7684;&#x8840;&#x6848;&#x300D;</a>&#x300B;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x3002;</p>
<h3 id="-">&#x670D;&#x52A1;&#x7AEF;&#x4EE3;&#x7406;</h3>
<p>&#x5728;&#x542F;&#x7528; HTTPS &#x7684;&#x5B9E;&#x9645;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x672C;&#x7AD9;&#x7684;&#x9759;&#x6001;&#x8D44;&#x6E90;&#x548C;&#x63A5;&#x53E3;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#x6539;&#x9020;&#xFF0C;&#x6BD5;&#x7ADF;&#x90FD;&#x53EF;&#x63A7;&#x3002;&#x4F46;&#x5F88;&#x591A;&#x7B2C;&#x4E09;&#x65B9;&#x8D44;&#x6E90;&#x6216;&#x63A5;&#x53E3;&#x5C31;&#x662F;&#x4E0D;&#x63D0;&#x4F9B; HTTPS&#xFF0C;&#x90A3;&#x5C31;&#x53EA;&#x80FD;&#x5728;&#x670D;&#x52A1;&#x7AEF;&#x505A;&#x4E00;&#x5C42; HTTPS &#x4EE3;&#x7406;&#x3002;</p>
<p>&#x670D;&#x52A1;&#x7AEF;&#x4EE3;&#x7406;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x5E94;&#x7528;&#x662F;&#x7528;&#x6765;&#x89E3;&#x51B3;&#x8DE8;&#x57DF;&#x95EE;&#x9898;&#x3002;&#x901A;&#x5E38;&#x4EE3;&#x7406;&#x672C;&#x8EAB;&#x8981;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x4E0D;&#x591A;&#xFF0C;&#x76F4;&#x63A5;&#x7528; Nginx &#x505A;&#x53CD;&#x5411;&#x4EE3;&#x7406;&#xFF0C;&#x6216;&#x8005;&#x7528; Lua&#x3001;Node.js &#x7B49;&#x8BED;&#x8A00;&#x6784;&#x5EFA;&#x8F7B;&#x91CF;&#x4E2D;&#x8F6C;&#x670D;&#x52A1;&#x90FD;&#x662F;&#x4E0D;&#x9519;&#x7684;&#x9009;&#x62E9;&#x3002;&#x4F46;&#x4E5F;&#x6709;&#x51E0;&#x70B9;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF1A;</p>
<ul>
<li>&#x4EE3;&#x7406;&#x5BF9;&#x8BF7;&#x6C42; Referrer&#x3001;&#x88AB;&#x4EE3;&#x7406;&#x7684; URL &#x90FD;&#x9700;&#x8981;&#x505A;&#x597D;&#x767D;&#x540D;&#x5355;&#x673A;&#x5236;&#xFF1B;</li>
<li>&#x4EE3;&#x7406;&#x4F1A;&#x9020;&#x6210;&#x7B2C;&#x4E09;&#x65B9;&#x901A;&#x8FC7; <code>REMOTE_ADDR</code> &#x62FF;&#x5230;&#x7684;&#x662F;&#x4EE3;&#x7406; IP&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x8FD9;&#x4E2A; IP &#x88AB;&#x9650;&#x5236;&#x8BF7;&#x6C42;&#x9891;&#x7387;&#x6216;&#x88AB;&#x5C01;&#xFF1B;</li>
<li>&#x4EE3;&#x7406;&#x53EA;&#x80FD;&#x62FF;&#x5230;&#x81EA;&#x5DF1;&#x57DF;&#x540D;&#x4E0B;&#x7684; Cookie&#xFF0C;&#x9700;&#x8981;&#x4ECE;&#x5176;&#x5B83;&#x57DF;&#x83B7;&#x53D6; Cookie &#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x63A5;&#x53E3;&#x88AB;&#x4EE3;&#x7406;&#x540E;&#x53EF;&#x80FD;&#x4E0D;&#x80FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF1B;</li>
</ul>
<p>&#x53E6;&#x5916;&#xFF0C;&#x5BF9;&#x4E8E;&#x9875;&#x9762;&#x4E0A;&#x901A;&#x8FC7; iframe &#x5D4C;&#x5165;&#x7684;&#x7B2C;&#x4E09;&#x65B9; HTTP &#x9875;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x505A; HTTPS &#x4EE3;&#x7406;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x9875;&#x9762;&#x91CC;&#x7684;&#x6240;&#x6709;&#x8D44;&#x6E90;&#x94FE;&#x63A5;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x51FA;&#x95EE;&#x9898;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x8054;&#x7CFB;&#x7B2C;&#x4E09;&#x65B9;&#x4FEE;&#x6539;&#x6216;&#x8005;&#x6362;&#x4EA7;&#x54C1;&#x65B9;&#x6848;&#xFF0C;&#x4E0D;&#x8981;&#x5728; HTTPS &#x4EE3;&#x7406;&#x4E0A;&#x8017;&#x8D39;&#x592A;&#x591A;&#x7CBE;&#x529B;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x4E0D;&#x90A3;&#x4E48;&#x5E38;&#x89C1;&#x7684;&#x95EE;&#x9898;&#x987A;&#x4FBF;&#x8BF4;&#x4E0B;&#xFF1A;&#x5982;&#x679C;&#x9875;&#x9762;&#x8868;&#x5355;&#x7684; <code>action</code> &#x5730;&#x5740;&#x4F7F;&#x7528;&#x4E86; HTTP &#x5730;&#x5740;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4; Chrome &#x5730;&#x5740;&#x680F;&#x7EFF;&#x8272;&#x5C0F;&#x9501;&#x6D88;&#x5931;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x793A;&#x4F8B;&#xFF1A;</p>
<pre><code class="lang-xml"><span class="hljs-tag">&lt;<span class="hljs-title">form</span> <span class="hljs-attribute">action</span>=<span class="hljs-value">&quot;http://imququ.com&quot;</span>&gt;</span><span class="hljs-tag">&lt;/<span class="hljs-title">form</span>&gt;</span>
</code></pre>
<p>
<div id="form-container"></div>
<button onclick="document.getElementById(&apos;form-container&apos;).innerHTML=&apos;&lt;form action=&quot;http://imququ.com&quot;&gt;&lt;/form&gt;&apos;;this.disabled=true;">&#x70B9;&#x51FB;&#x8FD9;&#x91CC;&#xFF0C;&#x5C06;&#x8868;&#x5355;&#x63D2;&#x5165;&#x672C;&#x6587;&#xFF08;Chrome &#x4E2D;&#x5C0F;&#x7EFF;&#x9501;&#x4F1A;&#x6D88;&#x5931;&#xFF09;</button>
</p>

<p>&#x6700;&#x540E;&#xFF0C;&#x518D;&#x8BA8;&#x8BBA;&#x4E00;&#x4E2A;&#x7B2C;&#x4E09;&#x65B9;&#x63A5;&#x53E3;&#x7531;&#x672C;&#x5730;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x7684;&#x7279;&#x6B8A;&#x573A;&#x666F;&#xFF08;&#x4F8B;&#x5982; Android APP &#x5728;&#x672C;&#x5730;&#x5F00;&#x4E00;&#x4E2A; 127.0.0.1 &#x7684; HTTP &#x670D;&#x52A1;&#xFF0C;&#x7ED9;&#x7F51;&#x9875;&#x8C03;&#x7528;&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x670D;&#x52A1;&#x51E0;&#x4E4E;&#x4E0D;&#x53EF;&#x80FD;&#x5347;&#x7EA7;&#x4E3A; HTTPS&#xFF0C;&#x663E;&#x7136;&#x4E5F;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x670D;&#x52A1;&#x7AEF;&#x4EE3;&#x7406;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x5728;&#x300A;<a href="https://imququ.com/post/use-image-to-transfer-data.html">&#x5229;&#x7528;&#x56FE;&#x7247;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x7684;&#x53E6;&#x7C7B;&#x601D;&#x8DEF;</a>&#x300B;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x91CC;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x80FD;&#x7528;&#x4F46;&#x4E0D;&#x5B8C;&#x7F8E;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<h3 id="referrer">Referrer</h3>
<p>&#x76EE;&#x524D;&#x5927;&#x90E8;&#x5206;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x5728;&#x53D1;&#x751F;&#x534F;&#x8BAE;&#x964D;&#x7EA7;&#x65F6;&#x9ED8;&#x8BA4;&#x4E0D;&#x53D1;&#x9001; Referrer &#x4FE1;&#x606F;&#xFF0C;&#x6700;&#x5178;&#x578B;&#x7684;&#x573A;&#x666F;&#x5C31;&#x662F;&#x4ECE; HTTPS &#x9875;&#x9762;&#x70B9;&#x94FE;&#x63A5;&#x8DF3;&#x5230; HTTP &#x7F51;&#x7AD9;&#x65F6;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x5E76;&#x4E0D;&#x4F1A;&#x5728;&#x8BF7;&#x6C42;&#x5934;&#x4E2D;&#x5E26;&#x4E0A; Referer &#x5B57;&#x6BB5;&#x3002;&#x5BF9;&#x4E8E;&#x7ED9;&#x7B2C;&#x4E09;&#x65B9;&#x5BFC;&#x6D41;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x80AF;&#x5B9A;&#x65E0;&#x6CD5;&#x63A5;&#x53D7;&#x3002;</p>
<p>&#x9488;&#x5BF9;&#x73B0;&#x4EE3;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7ED9;&#x9875;&#x9762;&#x52A0;&#x4E0A;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A; meta &#x6807;&#x7B7E;&#x6765;&#x89E3;&#x51B3;&#xFF1A;</p>
<pre><code class="lang-xml"><span class="hljs-tag">&lt;<span class="hljs-title">meta</span> <span class="hljs-attribute">name</span>=<span class="hljs-value">&quot;referrer&quot;</span> <span class="hljs-attribute">content</span>=<span class="hljs-value">&quot;always&quot;</span> /&gt;</span>
</code></pre>
<p>&#x6709;&#x5173;&#x8FD9;&#x4E2A; meta &#x7684;&#x66F4;&#x591A;&#x7528;&#x6CD5;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x300A;<a href="https://imququ.com/post/referrer-policy.html">Referrer Policy &#x4ECB;&#x7ECD;</a>&#x300B;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x3002;</p>
<p>&#x9488;&#x5BF9;&#x8001;&#x65E7;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728;&#x672C;&#x7AD9;&#x90E8;&#x7F72; HTTP &#x8DF3;&#x8F6C;&#x670D;&#x52A1;&#x6765;&#x89E3;&#x51B3;&#xFF0C;&#x501F;&#x52A9; HTTP &#x9875;&#x9762;&#x628A; Referrer &#x4F20;&#x7ED9;&#x7B2C;&#x4E09;&#x65B9;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x672C;&#x6587;&#x540C;&#x65F6;&#x51FA;&#x73B0;&#x4E86; <code>Referrer</code> &#x548C; <code>Referer</code> &#x4E24;&#x79CD;&#x5199;&#x6CD5;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x6B64;&#x6709;&#x56F0;&#x60D1;&#xFF0C;&#x63A8;&#x8350;&#x9605;&#x8BFB;&#x300A;<a href="https://imququ.com/post/referrer-or-referer.html">Referrer &#x8FD8;&#x662F; Referer&#xFF1F;</a>&#x300B;&#x3002;</p>
<h3 id="-">&#x8FDE;&#x901A;&#x6027;</h3>
<p>&#x5F88;&#x591A;&#x7F51;&#x7AD9;&#x5728;&#x542F;&#x7528; HTTPS &#x4E4B;&#x540E;&#xFF0C;&#x90FD;&#x4F1A;&#x63A5;&#x5230;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x7684;&#x7528;&#x6237;&#x53CD;&#x9988;&#x3002;&#x9664;&#x53BB;&#x81EA;&#x8EAB;&#x914D;&#x7F6E;&#x95EE;&#x9898;&#xFF08;&#x6211;&#x5728;&#x300A;<a href="https://imququ.com/post/why-tls-handshake-failed-with-http2-enabled.html">&#x4ECE;&#x542F;&#x7528; HTTP/2 &#x5BFC;&#x81F4;&#x7F51;&#x7AD9;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x8BF4;&#x8D77;</a>&#x300B;&#x4E00;&#x6587;&#x4E2D;&#x5217;&#x4E3E;&#x4E86;&#x5E38;&#x89C1;&#x7684;&#x914D;&#x7F6E;&#x9519;&#x8BEF;&#xFF09;&#x4E4B;&#x5916;&#xFF0C;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x662F; HTTPS &#x8FDE;&#x901A;&#x6027;&#x53D7;&#x5230;&#x4E86;&#x5E72;&#x6270;&#x3002;</p>
<p>&#x6700;&#x5E38;&#x89C1;&#x7684;&#x5E72;&#x6270;&#x662F;&#x8FD0;&#x8425;&#x5546;&#x52AB;&#x6301;&#x4E86;&#x57DF;&#x540D; DNS &#x89E3;&#x6790;&#xFF0C;&#x8FD9;&#x79CD;&#x52AB;&#x6301;&#x670D;&#x52A1;&#x5668;&#x4E00;&#x822C;&#x4F1A;&#x5C06;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#x53CD;&#x4EE3;&#x5230;&#x6E90;&#x7F51;&#x7AD9;&#xFF0C;&#x518D;&#x5728;&#x54CD;&#x5E94;&#x91CC;&#x5939;&#x5E26;&#x79C1;&#x8D27;&#x3002;&#x5728; HTTP &#x65F6;&#x4EE3;&#xFF0C;&#x8FD9;&#x79CD;&#x52AB;&#x6301;&#x591A;&#x534A;&#x53EA;&#x4F1A;&#x9020;&#x6210;&#x9875;&#x9762;&#x51FA;&#x73B0;&#x5E7F;&#x544A;&#xFF0C;&#x7F51;&#x7AD9;&#x8FD8;&#x80FD;&#x7528;&#xFF1B;&#x800C;&#x5347;&#x7EA7;&#x5230; HTTPS &#x540E;&#xFF0C;&#x7531;&#x4E8E;&#x8EAB;&#x4EFD;&#x8BA4;&#x8BC1;&#x673A;&#x5236;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x52AB;&#x6301;&#x670D;&#x52A1;&#x5668;&#x65E0;&#x6CD5;&#x6210;&#x529F;&#x53CD;&#x4EE3;&#x7B2C;&#x4E09;&#x65B9;&#x7F51;&#x7AD9;&#xFF08;&#x6210;&#x529F;&#x5B9E;&#x65BD; HTTPS &#x4E2D;&#x95F4;&#x4EBA;&#x653B;&#x51FB;&#x7684;&#x6761;&#x4EF6;&#x8BF7;&#x770B;&#x300A;<a href="https://imququ.com/post/how-to-decrypt-https.html">&#x4E09;&#x79CD;&#x89E3;&#x5BC6; HTTPS &#x6D41;&#x91CF;&#x7684;&#x65B9;&#x6CD5;&#x4ECB;&#x7ECD;</a>&#x300B;&#xFF09;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x7F51;&#x7AD9;&#x5B8C;&#x5168;&#x4E0D;&#x53EF;&#x7528;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6700;&#x8FD1;&#x5728;&#x79FB;&#x52A8;&#x7AEF;&#x505A;&#x8FC7;&#x4E00;&#x4E2A;&#x7EDF;&#x8BA1;&#xFF1A;&#x5BF9;&#x6BD4;&#x5728; HTTP &#x7F51;&#x7AD9;&#x52A0;&#x8F7D;&#x672C;&#x57DF; HTTP/HTTPS &#x7A7A;&#x56FE;&#x7247;&#x7684;&#x5931;&#x8D25;&#x7387;&#xFF08;&#x6211;&#x4EEC;&#x5BF9;&#x5931;&#x8D25;&#x7684;&#x5B9A;&#x4E49;&#x662F;&#x89E6;&#x53D1;&#x56FE;&#x7247;&#x7684; error &#x4E8B;&#x4EF6;&#xFF0C;&#x6216;&#x8005;&#x8D85;&#x8FC7; 9s &#x4ECD;&#x672A;&#x89E6;&#x53D1; load &#x4E8B;&#x4EF6;&#xFF09;&#xFF0C;HTTPS &#x8981;&#x9AD8;&#x51FA;&#x4E09;&#x4E2A;&#x767E;&#x5206;&#x70B9;&#x3002;</p>
<p>&#x5BF9;&#x4E8E; HTTPS &#x8BF7;&#x6C42;&#x5931;&#x8D25;&#x65E5;&#x5FD7;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x5206;&#x6790;&#xFF0C;&#x6BD4;&#x5982;&#x627E;&#x51FA;&#x662F;&#x54EA;&#x4E9B;&#x8FD0;&#x8425;&#x5546; / &#x5730;&#x57DF;&#x7684; HTTPS &#x8054;&#x901A;&#x6027;&#x6BD4;&#x8F83;&#x5DEE;&#xFF0C;&#x4ECE;&#x800C;&#x6709;&#x9488;&#x5BF9;&#x6027;&#x505A;&#x4E00;&#x4E9B;&#x7B56;&#x7565;&#x3002;&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x4E1A;&#x52A1;&#x60C5;&#x51B5;&#x90FD;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x8FD9;&#x91CC;&#x53EA;&#x629B;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x8BE6;&#x7EC6;&#x7684;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#x548C;&#x5E94;&#x5BF9;&#x63AA;&#x65BD;&#x4E0D;&#x5728;&#x8FD9;&#x91CC;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x672C;&#x6587;&#x5148;&#x5199;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x6709;&#x65B0;&#x7684;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x6211;&#x4F1A;&#x968F;&#x65F6;&#x8865;&#x5145;&#x8FDB;&#x6765;&#x3002;&#x6700;&#x540E;&#x6211;&#x60F3;&#x8BF4;&#x7684;&#x662F;&#xFF0C;&#x542F;&#x7528; HTTPS &#x5E76;&#x4E0D;&#x590D;&#x6742;&#xFF0C;&#x867D;&#x7136;&#x4F1A;&#x9047;&#x5230;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x90FD;&#x80FD;&#x627E;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x6240;&#x9700;&#x7684;&#x65E0;&#x975E;&#x5C31;&#x662F;&#x51B3;&#x5FC3;&#x3001;&#x8010;&#x5FC3;&#x548C;&#x7EC6;&#x5FC3;&#x3002;&#x5728;&#x73B0;&#x4EE3;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x65B0;&#x529F;&#x80FD;&#x90FD;&#x9650;&#x5B9A;&#x5728; HTTPS &#x4E0B;&#x624D;&#x80FD;&#x4F7F;&#x7528;&#xFF0C;HTTPS &#x4E5F;&#x662F;&#x90E8;&#x7F72; HTTP/2 &#x7684;&#x5148;&#x51B3;&#x6761;&#x4EF6;&#x3002;HTTPS &#x548C; HTTP/2 &#x5DF2;&#x7ECF;&#x6210;&#x4E3A; WEB &#x670D;&#x52A1;&#x7684;&#x6807;&#x914D;&#xFF0C;&#x8D76;&#x7D27;&#x884C;&#x52A8;&#x8D77;&#x6765;&#x5427;&#x3002;</p>
<p>&#x672C;&#x6587;&#x94FE;&#x63A5;&#xFF1A;<a href="https://imququ.com/post/sth-about-switch-to-https-3.html">https://imququ.com/post/sth-about-switch-to-https-3.html</a>&#xFF0C;<a href="https://imququ.com/post/sth-about-switch-to-https-3.html#comments" target="_blank">&#x53C2;&#x4E0E;&#x8BA8;&#x8BBA;</a></p><p>&#x2665; &#x672C;&#x7AD9;&#x6240;&#x6709;&#x6587;&#x7AE0;&#x5747;&#x4E3A;&#x672C;&#x4EBA;&#x539F;&#x521B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8BA4;&#x4E3A;&#x6211;&#x7684;&#x6587;&#x7AE0;&#x5BF9;&#x4F60;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x6B22;&#x8FCE;&#x8D5E;&#x52A9;&#x672C;&#x7AD9;&#x3002;<a target="_blank" href="https://imququ.com/post/about.html#toc-2">&#x8BE6;&#x60C5;&#x8BF7;&#x70B9;&#x8FD9;&#x91CC; &#xBB;</a></p></div>
</div>

</body>
</html>