<!DOCTYPE html>
<html>
<head>
  
  <title>&#x8BA4;&#x8BC6;&#x7F51;&#x9875;&#x65E0;&#x969C;&#x788D;</title>
  
</head>
<body>

<div id="wrap">
  <h1>&#x8BA4;&#x8BC6;&#x7F51;&#x9875;&#x65E0;&#x969C;&#x788D;</h1>
  <div id="content"><p>&#x6700;&#x8FD1;&#x5FD9;&#x91CC;&#x5077;&#x95F2;&#x575A;&#x6301;&#x4E86;&#x597D;&#x51E0;&#x4E2A;&#x661F;&#x671F;&#x7F51;&#x9875;&#x65E0;&#x969C;&#x788D;&#x76F8;&#x5173;&#x7684;&#x5B66;&#x4E60;&#x548C;&#x7814;&#x7A76;&#xFF0C;&#x770B;&#x4E86;&#x5F88;&#x591A;&#x6587;&#x6863;&#xFF0C;&#x4E5F;&#x5728; Google &#x4E2D;&#x5BFB;&#x89C5;&#x4E86;&#x4E0D;&#x5C11;&#x535A;&#x5BA2;&#x6587;&#x7AE0;&#xFF0C;&#x603B;&#x7684;&#x6765;&#x8BF4;&#x5C31;&#x4E00;&#x4E2A;&#x611F;&#x53D7;&#xFF1A;&#x89C4;&#x8303;&#x6587;&#x6863;&#x592A;&#x7EC6;&#x8282;&#x592A;&#x957F;&#xFF0C;&#x535A;&#x5BA2;&#x6307;&#x5BFC;&#x6027;&#x4E0D;&#x5F3A;&#x3002;</p>
<a id="more"/>
<p>&#x5728; <a href="/blog/2016/02/28/step-in-aria/">&#x4E0A;&#x6587;</a> &#x4E2D;&#x63D0;&#x5230;&#xFF0C;&#x4FE1;&#x606F;&#x65E0;&#x969C;&#x788D;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x7231;&#x5FC3;&#x516C;&#x76CA;&#x6D3B;&#x52A8;&#xFF0C;&#x53EA;&#x662F;&#x5728;&#x5927;&#x591A;&#x6570;&#x516C;&#x53F8;&#x4E2D;&#xFF0C;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x6280;&#x672F;/&#x4EA7;&#x54C1;&#x6295;&#x5165;&#x96BE;&#x4EE5;&#x5E26;&#x6765;&#x53EF;&#x89C2;&#x7684;&#x5229;&#x6DA6;&#xFF0C;&#x4E8E;&#x662F;&#x4FE1;&#x606F;&#x65E0;&#x969C;&#x788D;&#x96BE;&#x4EE5;&#x8FDB;&#x5165;&#x5F00;&#x53D1;&#x7684;&#x6D41;&#x7A0B;&#x4E4B;&#x4E2D;&#xFF0C;&#x5373;&#x4FBF;&#x6709;&#x5DE5;&#x7A0B;&#x5E08;&#x96F6;&#x96F6;&#x788E;&#x788E;&#x5730;&#x5728;&#x9875;&#x9762;&#x4E2D;&#x52A0;&#x5165;&#x4E86;&#x65E0;&#x969C;&#x788D;&#x4F18;&#x5316;&#xFF0C;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x4EA7;&#x54C1;&#x8FED;&#x4EE3;&#x4E4B;&#x540E;&#xFF0C;&#x8FD9;&#x4E9B;&#x4F18;&#x5316;&#x53C8;&#x8361;&#x7136;&#x65E0;&#x5B58;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x5E0C;&#x671B;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x7814;&#x7A76;&#x548C;&#x5B9E;&#x8DF5;&#xFF0C;&#x80FD;&#x591F;&#x628A;&#x6211;&#x5BF9;&#x7F51;&#x9875;&#x65E0;&#x969C;&#x788D;&#x5316;&#x7684;&#x7406;&#x89E3;&#x8868;&#x8FBE;&#x51FA;&#x6765;&#xFF0C;&#x5728;&#x5B66;&#x4E60;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F1A;&#x53BB;&#x76F2;&#x4EBA;&#x793E;&#x533A;&#x4EA4;&#x6D41;&#xFF0C;&#x5207;&#x8EAB;&#x4F53;&#x4F1A;&#x89C6;&#x969C;&#x4EBA;&#x58EB;&#x7684;&#x5904;&#x5883;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x4F1A;&#x8DDF;&#x56FD;&#x5185;&#x51E0;&#x4F4D;&#x505A;&#x4E86;&#x6BD4;&#x8F83;&#x957F;&#x65F6;&#x95F4;&#x7F51;&#x9875;&#x65E0;&#x969C;&#x788D;&#x7814;&#x7A76;&#x7684;&#x76F2;&#x4EBA;&#x5F00;&#x53D1;&#x8005;&#x6C9F;&#x901A;&#xFF0C;&#x6536;&#x83B7;&#x4E00;&#x4E9B;&#x5FC3;&#x5F97;&#x3002;</p>
<h3 id="&#x8BA4;&#x8BC6;&#x7F51;&#x9875;&#x65E0;&#x969C;&#x788D;&#x5316;">&#x8BA4;&#x8BC6;&#x7F51;&#x9875;&#x65E0;&#x969C;&#x788D;&#x5316;</h3><p>&#x7AD9;&#x5728;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x89D2;&#x5EA6;&#x601D;&#x8003;&#x3002;&#x5F53;&#x7528;&#x6237;&#x8FDB;&#x5165;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x4ED6;&#x7684;&#x76EE;&#x7684;&#x5E94;&#x8BE5;&#x662F;&#x5F88;&#x660E;&#x786E;&#x7684;&#xFF0C;&#x5728;&#x6700;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x901A;&#x8FC7;&#x6700;&#x5FEB;&#x7684;&#x65B9;&#x5F0F;&#x627E;&#x5230;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x6B63;&#x5E38;&#x4EBA;&#x901A;&#x8FC7;&#x773C;&#x775B;&#x53BB;&#x6355;&#x6349;&#x7F51;&#x9875;&#x4E0A;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x800C;&#x89C6;&#x969C;&#x4EBA;&#x58EB;&#x4E3B;&#x8981;&#x901A;&#x8FC7;&#x8033;&#x6735;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x8BFB;&#x5C4F;&#x8F6F;&#x4EF6;&#x8F85;&#x52A9;&#x8BFB;&#x53D6;&#x9875;&#x9762;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x5982;&#x679C;&#x7F51;&#x9875;&#x5F88;&#x957F;&#xFF0C;&#x94FE;&#x63A5;&#x5F88;&#x591A;&#xFF0C;&#x6BD4;&#x5982;&#x4E00;&#x4E9B;&#x95E8;&#x6237;&#x7F51;&#x7AD9;&#xFF0C;&#x76F2;&#x4EBA;&#x7528;&#x8D77;&#x6765;&#x5C31;&#x4F1A;&#x7279;&#x522B;&#x5403;&#x529B;&#xFF0C;PC &#x4E0A;&#x901A;&#x8FC7; TAB &#x952E;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x5F80;&#x540E;&#x805A;&#x7126;&#xFF0C;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x4E2A;&#x94FE;&#x63A5;&#x5806;&#x53E0;&#x5728;&#x4E00;&#x5768;&#xFF0C;&#x5176;&#x6076;&#x5FC3;&#x7A0B;&#x5EA6;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x80FD;&#x591F;&#x9F13;&#x8D77;&#x52C7;&#x6C14;&#x8FDB;&#x5165;&#x8FD9;&#x4E9B;&#x7F51;&#x7AD9;&#x7684;&#x76F2;&#x4EBA;&#x90FD;&#x662F;&#x813E;&#x6C14;&#x76F8;&#x5F53;&#x4E0D;&#x9519;&#x7684;&#xFF08;&#x5982;&#x679C;&#x662F;&#x4F60;&#xFF0C;&#x4F60;&#x4F1A;&#x7838;&#x952E;&#x76D8;&#x4E48;&#x1F648;&#xFF09;&#x3002;</p>
<p>&#x8BFB;&#x5C4F;&#x8F6F;&#x4EF6;&#x4E0D;&#x77E5;&#x9053;&#x54EA;&#x4E9B;&#x4FE1;&#x606F;&#x662F;&#x300C;&#x91CD;&#x8981;&#x4FE1;&#x606F;&#x300D;&#x548C;&#x300C;&#x6B21;&#x8981;&#x4FE1;&#x606F;&#x300D;&#xFF0C;&#x66F4;&#x52A0;&#x4E0D;&#x6E05;&#x695A;&#x54EA;&#x4E9B;&#x4FE1;&#x606F;&#x662F;&#x91CD;&#x590D;&#x4FE1;&#x606F;&#xFF0C;&#x6709;&#x7684;&#x65F6;&#x5019;&#x8BFB;&#x5C4F;&#x8F6F;&#x4EF6;&#x8FD8;&#x4F1A;&#x8BFB;&#x5230;&#x4E00;&#x4E9B;&#x5E72;&#x6270;&#x4FE1;&#x606F;&#xFF08;&#x6BD4;&#x5982;&#x56FE;&#x5F62;&#x5B57;&#x7B26;&#x7B49;&#xFF09;&#x3002;</p>
<p>&#x6240;&#x8C13;&#x7684;&#x7F51;&#x9875;&#x65E0;&#x969C;&#x788D;&#x5316;&#xFF0C;&#x5C31;&#x662F;&#x5C06;&#x7F51;&#x9875;&#x4FE1;&#x606F;&#x6709;&#x5E8F;&#x7684;&#x6392;&#x5217;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5E76;&#x4E14;&#x63D0;&#x4F9B;&#x51E0;&#x4E2A;&#x5FEB;&#x6377;&#x5165;&#x53E3;&#x8BA9;&#x7528;&#x6237;&#x8FC5;&#x901F;&#x627E;&#x5230;&#x5173;&#x6CE8;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x6392;&#x9664;&#x5E72;&#x6270;&#xFF0C;&#x6211;&#x7B80;&#x5355;&#x5730;&#x7406;&#x4E86;&#x4E0B;&#x65E0;&#x969C;&#x788D;&#x5316;&#x7684;&#x601D;&#x8DEF;&#xFF1A;</p>
<ul>
<li>&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x77E5;&#x9053;&#x9875;&#x9762;&#x4E0A;&#x6709;&#x4EC0;&#x4E48;&#x5185;&#x5BB9;&#xFF0C;&#x6BD4;&#x5982;&#x4F7F;&#x7528; HTML5 &#x7684;&#x8BED;&#x4E49;&#x5316;&#x6807;&#x7B7E;&#x4EE5;&#x53CA; WAI-ARIA &#x4E2D;&#x7684; landmark &#x5730;&#x6807;&#xFF1B;</li>
<li>&#x7B2C;&#x4E8C;&#x6B65;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5728;&#x9875;&#x9762;&#x7684;&#x677F;&#x5757;&#x4E4B;&#x95F4;&#x5207;&#x6362;&#xFF0C;&#x6BD4;&#x5982;&#x6DFB;&#x52A0;&#x5FEB;&#x6377;&#x952E;&#x652F;&#x6301;&#xFF1B;</li>
<li>&#x7B2C;&#x4E09;&#x6B65;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x77E5;&#x9053;&#x54EA;&#x4E9B;&#x662F;&#x4E3B;&#x8981;&#x90E8;&#x5206;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x8FDB;&#x5165;&#x9875;&#x9762;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x63D0;&#x4F9B;&#x5FEB;&#x6377;&#x65B9;&#x5F0F;&#x8DF3;&#x5230;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#x7684;&#x951A;&#x70B9;&#xFF1B;</li>
<li>&#x7B2C;&#x56DB;&#x6B65;&#xFF0C;&#x53BB;&#x9664;&#x9875;&#x9762;&#x5E72;&#x6270;&#xFF0C;&#x5982; iconfont &#x6587;&#x5B57;&#xFF0C;&#x76F8;&#x90BB;&#x91CD;&#x590D;&#x7684;&#x94FE;&#x63A5;&#x7B49;&#xFF1B;</li>
<li>&#x7B2C;&#x4E94;&#x6B65;&#xFF0C;&#x63D0;&#x4F9B;&#x9875;&#x9762;&#x7684;&#x4EA4;&#x4E92;&#x652F;&#x6301;&#xFF0C;&#x8BA9;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x7EC4;&#x4EF6;&#x5982; tab&#x3001;slide &#x90FD;&#x5177;&#x5907;&#x65E0;&#x969C;&#x788D;&#x5C5E;&#x6027;&#x3002;</li>
</ul>
<p>&#x7A0D;&#x5FAE;&#x5398;&#x6E05;&#x4E0A;&#x9762;&#x4E94;&#x4E2A;&#x6B65;&#x9AA4;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x5176;&#x5B9E;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5C31;&#x662F;&#x8BA9;&#x4FE1;&#x606F;&#x6A21;&#x5757;&#x5316;&#x5730;&#x5448;&#x73B0;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x8BA9;&#x8033;&#x6735;&#x66F4;&#x597D;&#x7684;&#x4EE3;&#x66FF;&#x773C;&#x775B;&#x529E;&#x4E8B;&#x513F;&#x3002;</p>
<h3 id="&#x7406;&#x89E3;&#x548C;&#x5B9E;&#x8DF5;&#x7F51;&#x9875;&#x65E0;&#x969C;&#x788D;&#x5316;">&#x7406;&#x89E3;&#x548C;&#x5B9E;&#x8DF5;&#x7F51;&#x9875;&#x65E0;&#x969C;&#x788D;&#x5316;</h3><p>&#x638C;&#x63E1;&#x4E86;&#x6574;&#x4F53;&#x7684;&#x601D;&#x8DEF;&#x540E;&#x5C31;&#x4F1A;&#x6E05;&#x695A;&#xFF0C;&#x54EA;&#x4E9B;&#x64CD;&#x4F5C;&#x662F;&#x6709;&#x76CA;&#x4E8E;&#x7F51;&#x9875;&#x6574;&#x4F53;&#x65E0;&#x969C;&#x788D;&#x7684;&#xFF0C;&#x54EA;&#x4E9B;&#x64CD;&#x4F5C;&#x662F;&#x5C40;&#x90E8;&#x7684;&#x5FAE;&#x5C0F;&#x4F18;&#x5316;&#xFF0C;&#x5BF9;&#x4E8E;&#x5F88;&#x591A;&#x7F51;&#x7AD9;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x4E0D;&#x9700;&#x8981;&#x53BB;&#x5173;&#x6CE8;&#x7EC6;&#x5FAE;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x8BFB;&#x5C4F;&#x8F6F;&#x4EF6;&#x53EF;&#x4EE5;&#x80DC;&#x4EFB;&#x3002;&#x53EA;&#x8981;&#x80FD;&#x591F;&#x5728;&#x6574;&#x4F53;&#x4E0A;&#x5C06;&#x4E00;&#x4E2A;&#x7F51;&#x9875;&#x4E43;&#x81F3;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x7684;&#x65E0;&#x969C;&#x788D;&#x4F53;&#x9A8C;&#x505A;&#x597D;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x7F51;&#x9875;&#x65E0;&#x969C;&#x788D;&#x5316;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF01;</p>
<p>&#x6709;&#x4E9B;&#x540C;&#x5B66;&#x5728;&#x505A;&#x65E0;&#x969C;&#x788D;&#x5B9E;&#x8DF5;&#x7684;&#x65F6;&#x5019;&#x6CA1;&#x6709;&#x771F;&#x5B9E;&#x7406;&#x89E3;&#x76F2;&#x4EBA;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x6240;&#x4EE5;&#x505A;&#x51FA;&#x6765;&#x7684;&#x4E1C;&#x897F;&#x53CD;&#x800C;&#x6BD4;&#x6CA1;&#x4F18;&#x5316;&#x4E4B;&#x524D;&#x66F4;&#x52A0;&#x96BE;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x6EE5;&#x7528; tabindex&#xFF0C;&#x628A;&#x7F51;&#x9875;&#x5185;&#x5BB9;&#x7684;&#x987A;&#x5E8F;&#x6392;&#x5217;&#x5F97;&#x652F;&#x79BB;&#x7834;&#x788E;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6B63;&#x5728;&#x505A;&#x6216;&#x8005;&#x6B63;&#x51C6;&#x5907;&#x505A;&#x7F51;&#x9875;&#x65E0;&#x969C;&#x788D;&#xFF0C;&#x8BF7;&#x4F60;&#x4E00;&#x5B9A;&#x8981;&#x7AD9;&#x5728;&#x76F2;&#x4EBA;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#x95EE;&#x9898;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6700;&#x597D;&#x4F60;&#x8FD8;&#x80FD;&#x95ED;&#x4E0A;&#x773C;&#x775B;&#x62FF;&#x7740;&#x8BFB;&#x5C4F;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x4E0B;&#x4F60;&#x5199;&#x7684;&#x9875;&#x9762;&#x3002;</p>
<p>&#x4E0D;&#x540C;&#x7684;&#x5E73;&#x53F0;&#x4F1A;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x8BFB;&#x5C4F;&#x8F6F;&#x4EF6;&#xFF0C;&#x7531;&#x4E8E;&#x5404;&#x8BFB;&#x5C4F;&#x8F6F;&#x4EF6;&#x5BF9;&#x6807;&#x51C6;&#x7684;&#x5B9E;&#x73B0;&#x5B58;&#x5728;&#x504F;&#x5DEE;&#xFF0C;&#x751A;&#x81F3;&#x5B58;&#x5728;&#x5220;&#x51CF;&#xFF0C;&#x6700;&#x540E;&#x5BFC;&#x81F4;&#x4E0D;&#x540C;&#x5E73;&#x53F0;&#x4E0B;&#x7684;&#x8BFB;&#x5C4F;&#x4F53;&#x9A8C;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x5982;&#x540C;&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#x5404;&#x6D4F;&#x89C8;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x517C;&#x5BB9;&#x6027;&#x4E00;&#x822C;&#xFF0C;&#x5728;&#x505A;&#x65E0;&#x969C;&#x788D;&#x6D4B;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x8981;&#x5173;&#x6CE8;&#x4E0D;&#x540C;&#x8BFB;&#x5C4F;&#x8F6F;&#x4EF6;&#x7684;&#x5DEE;&#x5F02;&#x3002;</p>
<h3 id="&#x6700;&#x540E;">&#x6700;&#x540E;</h3><p>&#x6587;&#x672C;&#x4E3B;&#x8981;&#x4ECE;&#x7F51;&#x9875;&#x65E0;&#x969C;&#x788D;&#x7684;&#x601D;&#x8DEF;&#x4E0A;&#x505A;&#x4E86;&#x4E00;&#x4E9B;&#x9610;&#x8FF0;&#xFF0C;&#x53EF;&#x80FD;&#x4E0D;&#x4E25;&#x8C28;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x6709;&#x8868;&#x8FF0;&#x4E0D;&#x5F53;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x8FD9;&#x65B9;&#x9762;&#x6709;&#x7814;&#x7A76;&#xFF0C;&#x6B22;&#x8FCE;&#x63D0;&#x51FA;&#x4F60;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x4E5F;&#x671F;&#x5F85;&#x66F4;&#x591A;&#x4EBA;&#x5173;&#x6CE8;&#x7F51;&#x9875;&#x65E0;&#x969C;&#x788D;&#x5316;&#x3002;</p></div>
</div>

</body>
</html>