<!DOCTYPE html>
<html>
<head>
  
  <title>&#x7B80;&#x8FF0;&#x6DD8;&#x5B9D;&#x56E2;&#x961F;&#x7684;&#x6280;&#x672F;&#x6C89;&#x6DC0;&#x548C;&#x5BF9;&#x5916;&#x5206;&#x4EAB;</title>
  
</head>
<body>

<div id="wrap">
  <h1>&#x7B80;&#x8FF0;&#x6DD8;&#x5B9D;&#x56E2;&#x961F;&#x7684;&#x6280;&#x672F;&#x6C89;&#x6DC0;&#x548C;&#x5BF9;&#x5916;&#x5206;&#x4EAB;</h1>
  <div id="content"><p>&#x53BB;&#x5E74;&#x4E0B;&#x534A;&#x5E74;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x8D1F;&#x8D23;&#x6DD8;&#x5B9D;&#x524D;&#x7AEF;&#x56E2;&#x961F;&#xFF08;Taobao FED&#xFF09;&#x7684;&#x5BF9;&#x5916;&#x8FD0;&#x8425;&#xFF0C;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#x7684;&#x70B9;&#x5C31;&#x662F;<a href="http://taobaofed.org" target="_blank" rel="external">&#x300C;&#x56E2;&#x961F;&#x535A;&#x5BA2;&#x300D;</a>&#xFF0C;&#x575A;&#x6301;&#x4E86;&#x4E09;&#x4E2A;&#x591A;&#x6708;&#x7684;&#x6BCF;&#x65E5;&#x4E00;&#x6587;&#xFF0C;&#x5F88;&#x591A;&#x670B;&#x53CB;&#x4E0D;&#x7981;&#x60CA;&#x53F9;&#xFF0C;&#x201C;&#x4F60;&#x4EEC;&#x5B9E;&#x5728;&#x592A;&#x9AD8;&#x4EA7;&#xFF01;&#x201D;&#x3002;</p>
<a id="more"/>
<p>&#x7ECF;&#x5E38;&#x5199;&#x535A;&#x5BA2;&#x7684;&#x4EBA;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x5199;&#x4E00;&#x7BC7;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x6280;&#x672F;&#x6587;&#x7AE0;&#x662F;&#x4E00;&#x4EF6;&#x633A;&#x8D39;&#x65F6;&#x8D39;&#x529B;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5F88;&#x591A;&#x5584;&#x4E8E;&#x5206;&#x4EAB;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x4E5F;&#x53EA;&#x80FD;&#x505A;&#x5230;&#x6BCF;&#x6708;&#x4E24;&#x4E09;&#x7BC7;&#xFF0C;&#x7531;&#x4E8E;&#x4E1A;&#x52A1;&#x538B;&#x529B;&#xFF0C;&#x5076;&#x5C14;&#x4E00;&#x4E24;&#x4E2A;&#x6708;&#x8FD8;&#x6CA1;&#x6709;&#x4EA7;&#x51FA;&#x3002;&#x5018;&#x82E5;&#x770B;&#x5230;&#x6709;&#x4EBA;&#x6BCF;&#x5929;&#x53D1;&#x4E00;&#x7BC7;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x4E0B;&#x5DF4;&#x5F53;&#x7136;&#x4F1A;&#x6389;&#x5230;&#x5730;&#x4E0A;&#x3002;&#x6491;&#x8D77;&#x5927;&#x62C7;&#x6307;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x5FC3;&#x91CC;&#x4E5F;&#x5728;&#x5600;&#x5495;&#xFF0C;&#x4E3A;&#x4F55;&#x53EF;&#x4EE5;&#x6301;&#x4E45;&#x4FDD;&#x6301;&#xFF1F;&#x662F;&#x4E0D;&#x662F;&#x5199;&#x6587;&#x7AE0;&#x4E5F;&#x80CC;&#x4E86; KPI&#xFF1F;&#x6700;&#x8FD1;&#x4E5F;&#x6709;&#x4E0D;&#x5C11;&#x4EBA;&#x5411;&#x6211;&#x53D6;&#x7ECF;&#x3002;</p>
<h3 id="&#x56E2;&#x961F;&#x5206;&#x4EAB;&#x6C1B;&#x56F4;&#x7684;&#x5F62;&#x6210;">&#x56E2;&#x961F;&#x5206;&#x4EAB;&#x6C1B;&#x56F4;&#x7684;&#x5F62;&#x6210;</h3><p>&#x5206;&#x4EAB;&#x548C;&#x6C89;&#x6DC0;&#x662F;&#x56E2;&#x961F;&#x57FA;&#x7840;&#x5EFA;&#x8BBE;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x6CA1;&#x6709;&#x5206;&#x4EAB;&#x6CA1;&#x6709;&#x8BB0;&#x5F55;&#xFF0C;&#x5F88;&#x591A;&#x4EA4;&#x6D41;&#x548C;&#x5B66;&#x4E60;&#x7684;&#x4E1C;&#x897F;&#x5C31;&#x6C89;&#x6DC0;&#x4E0D;&#x4E0B;&#x6765;&#x3002;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x6C89;&#x6DC0;&#x7684;&#x56E2;&#x961F;&#xFF0C;&#x65B0;&#x6210;&#x5458;&#x9700;&#x8981;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x8E29;&#x5751;&#x548C;&#x78E8;&#x5408;&#x624D;&#x80FD;&#x5F97;&#x4EE5;&#x6210;&#x957F;&#xFF0C;&#x56E2;&#x961F;&#x5404;&#x4E2A;&#x5C0F;&#x7EC4;&#x7684;&#x4FE1;&#x606F;&#x4E92;&#x901A;&#x4E0D;&#x987A;&#x7545;&#x3001;&#x4FE1;&#x606F;&#x4E0D;&#x5BF9;&#x79F0;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x96BE;&#x4EE5;&#x5BF9;&#x5916;&#x5F62;&#x6210;&#x4E00;&#x5B9A;&#x7684;&#x5F71;&#x54CD;&#x529B;&#x3002;</p>
<p>14 &#x5E74; 3 &#x6708;&#x4EFD;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x6765;&#x6DD8;&#x5B9D;&#x8FD9;&#x8FB9;&#x5B9E;&#x4E60;&#x3002;&#x6DD8;&#x5B9D;&#x8FD9;&#x8FB9;&#x7684;&#x4E1C;&#x897F;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x57FA;&#x7840;&#x6846;&#x67B6;&#x3001;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x3001;&#x524D;&#x7AEF;&#x89C4;&#x8303;&#x3001;&#x5B89;&#x5168;&#x5B88;&#x5219;&#x3001;&#x642D;&#x5EFA;&#x5E73;&#x53F0;&#x3001;&#x4E1A;&#x52A1;&#x6C9F;&#x901A;&#x7B49;&#x7B49;&#xFF0C;&#x5BF9;&#x4E00;&#x4E2A;&#x65B0;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x4E86;&#x89E3;&#x5E76;&#x638C;&#x63E1;&#x56E2;&#x961F;&#x6574;&#x4E2A;&#x4E00;&#x5957;&#x771F;&#x4E0D;&#x662F;&#x5B9E;&#x4E60;&#x4E24;&#x4E2A;&#x6708;&#x5C31;&#x80FD;&#x641E;&#x5B9A;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x5B66;&#x4E60;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x6700;&#x5927;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x6BCF;&#x5929;&#x90FD;&#x662F;&#x5B66;&#x4E60; &amp; &#x57FA;&#x672C;&#x7684;&#x4E1A;&#x52A1;&#x6C9F;&#x901A;&#xFF0C;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x7591;&#x95EE;&#xFF0C;&#x4E5F;&#x4F1A;&#x4E0D;&#x65AD;&#x5730;&#x53BB;&#x63D0;&#x95EE;&#x3002;</p>
<p>&#x5B9E;&#x4E60;&#x751F;&#x6CA1;&#x6709; KPI&#xFF0C;&#x8DDF;&#x6B63;&#x5F0F;&#x5458;&#x5DE5;&#x7684;&#x5DEE;&#x5F02;&#x5728;&#x4E8E;&#xFF0C;&#x9664;&#x4E86;&#x8981;&#x6295;&#x5165;&#x5230;&#x4E1A;&#x52A1;&#x751F;&#x4EA7;&#x4E4B;&#x4E2D;&#xFF0C;&#x8FD8;&#x8981;&#x4E0D;&#x65AD;&#x5730;&#x5B66;&#x4E60;&#x5E76;&#x878D;&#x5165;&#x5230;&#x8FD9;&#x4E2A;&#x56E2;&#x961F;&#xFF0C;&#x6240;&#x4EE5;&#x505A;&#x6DD8;&#x5B9D;&#x7684;&#x5B9E;&#x4E60;&#x751F;&#x4E5F;&#x662F;&#x6BD4;&#x8F83;&#x8F9B;&#x82E6;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x867D;&#x8BF4;&#x6CA1;&#x6709; KPI&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x5F97;&#x5199;&#x5199;&#x5B9E;&#x4E60;&#x89C4;&#x5212;&#xFF0C;&#x5199;&#x4E00;&#x4E9B;&#x81EA;&#x5DF1;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x671F;&#x671B;&#xFF0C;Team Leader &#x4E5F;&#x4F1A;&#x5BF9;&#x5B9E;&#x4E60;&#x751F;&#x6709;&#x4E00;&#x4E9B;&#x671F;&#x671B;&#xFF0C;&#x4E24;&#x4E2A;&#x671F;&#x671B;&#x4E4B;&#x95F4;&#x6709;&#x5F88;&#x591A;&#x5951;&#x5408;&#x70B9;&#xFF0C;&#x6BD4;&#x5982;&#x4E86;&#x89E3;&#x4E1A;&#x52A1;&#xFF0C;&#x6709;&#x601D;&#x8003;&#xFF0C;&#x6709;&#x6C89;&#x6DC0;&#xFF0C;&#x6709;&#x5206;&#x4EAB;&#x3002;&#x521A;&#x5F00;&#x59CB;&#xFF0C;&#x5B9E;&#x4E60;&#x751F;&#x96BE;&#x4EE5;&#x5728;&#x4E1A;&#x52A1;&#x5F00;&#x53D1;&#x4E2D;&#x51FA;&#x6280;&#x672F;&#x4EAE;&#x70B9;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E00;&#x4E9B;&#x597D;&#x7684;&#x60F3;&#x6CD5;&#x548C;&#x601D;&#x8003;&#x4F1A;&#x5F15;&#x8D77;&#x56E2;&#x961F;&#x5176;&#x4ED6;&#x540C;&#x5B66;&#x7684;&#x5173;&#x6CE8;&#xFF0C;&#x4E5F;&#x4F1A;&#x7ED9;&#x81EA;&#x5DF1;&#x5E26;&#x6765;&#x673A;&#x4F1A;&#xFF0C;&#x6BD4;&#x5982; Team Leader &#x4F1A;&#x628A;&#x4F60;&#x653E;&#x5230;&#x66F4;&#x52A0;&#x9002;&#x5408;&#x4F60;&#x7684;&#x4F4D;&#x7F6E;&#x4E0A;&#x953B;&#x70BC;&#x4F60;&#x3002;</p>
<p>&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x6709;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x4E2A;&#x90E8;&#x95E8;&#xFF0C;&#x6BCF;&#x4E2A;&#x90E8;&#x95E8;&#xFF08;BU&#xFF09;&#x90FD;&#x4F1A;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x672F;&#x56E2;&#x961F;&#xFF0C;&#x524D;&#x7AEF;&#x56E2;&#x961F;&#x3001;&#x540E;&#x7AEF;&#x56E2;&#x961F;&#x3001;PE&#x3001;QA &#x7B49;&#x7B49;&#xFF0C;&#x5185;&#x90E8;&#x6709;&#x4E00;&#x4E2A;&#x535A;&#x5BA2;&#x5E73;&#x53F0;&#xFF0C;&#x8FD9;&#x4E2A;&#x5E73;&#x53F0;&#x4E0A;&#x6709;&#x4EE5;&#x5708;&#x5B50;&#x4E3A;&#x7EF4;&#x5EA6;&#x805A;&#x5408;&#x7684;&#xFF0C;&#x5982; Node.js &#x7CEF;&#x7C73;&#x5708;&#x3001;&#x5168;&#x7AD9; HTTPS&#x3001;JVM &#x4EA4;&#x6D41;&#x7B54;&#x7591;&#x3001;&#x8DE8;&#x7EC8;&#x7AEF;&#x7B49;&#x7B49;&#x51E0;&#x767E;&#x4E2A;&#x5708;&#x5B50;&#xFF1B;&#x4E5F;&#x6709;&#x4EE5; BU &#x4E3A;&#x7EF4;&#x62A4;&#x805A;&#x5408;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A; BU &#x7684; Team Leader &#x521B;&#x5EFA;&#x5708;&#x5B50;&#x540E;&#x5C06;&#x6574;&#x4E2A;&#x56E2;&#x961F;&#x7684;&#x4EBA;&#x5458;&#x62C9;&#x8FDB;&#x6765;&#x3002;&#x5F88;&#x591A;&#x4EBA;&#x5728;&#x8FD9;&#x4E2A;&#x535A;&#x5BA2;&#x5E73;&#x53F0;&#x4E0A;&#x5206;&#x4EAB;&#xFF0C;&#x516C;&#x53F8;&#x51E0;&#x4E07;&#x4EBA;&#xFF0C;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x8FD9;&#x91CC;&#x6C89;&#x6DC0;&#x7684;&#x5185;&#x5BB9;&#x4F53;&#x91CF;&#x6709;&#x591A;&#x4E48;&#x5E9E;&#x5927;&#xFF0C;&#x77E5;&#x8BC6;&#x9886;&#x57DF;&#x5305;&#x62EC;&#xFF1A;Java&#x6838;&#x5FC3;&#x6280;&#x672F;, &#x524D;&#x7AEF;&#x4E0E;&#x4EA4;&#x4E92;&#x8BBE;&#x8BA1;, &#x5B89;&#x5168;&#x4E0E;&#x98CE;&#x63A7;, &#x7CFB;&#x7EDF;&#x8F6F;&#x4EF6;, &#x6D4B;&#x8BD5;&#x6280;&#x672F;, &#x7F16;&#x7A0B;&#x8BED;&#x8A00;, &#x67B6;&#x6784;, &#x6570;&#x636E;&#x5B58;&#x50A8;&#x4E0E;&#x6570;&#x636E;&#x5E93;, &#x5F15;&#x64CE;&#x6280;&#x672F;, &#x9879;&#x76EE;&#x7BA1;&#x7406;&#x4E0E;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;, &#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x4E0E;&#x5BA2;&#x6237;&#x7AEF;, &#x7CFB;&#x7EDF;&#x7814;&#x53D1;&#x4E0E;&#x8FD0;&#x7EF4;, &#x4E92;&#x8054;&#x7F51;&#x4EA7;&#x54C1;&#x53CA;&#x5E94;&#x7528;, &#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E0E;&#x8BA1;&#x7B97;, &#x5F00;&#x53D1;&#x6846;&#x67B6;&#x4E0E;&#x4E2D;&#x95F4;&#x4EF6;, &#x7B97;&#x6CD5;, &#x7F51;&#x7EDC;&#x4E0E;&#x6570;&#x636E;&#x901A;&#x4FE1;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x51E0;&#x4E4E;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#x90FD;&#x80FD;&#x591F;&#x5728;&#x8FD9;&#x91CC;&#x627E;&#x5230;&#x7B54;&#x6848;&#xFF0C;&#x4E5F;&#x80FD;&#x5728;&#x4F17;&#x591A;&#x5708;&#x5B50;&#x4E2D;&#x627E;&#x5230;&#x5E2E;&#x52A9;&#x4F60;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x4EBA;&#x3002;&#x6709;&#x4EBA;&#x770B;&#x5C31;&#x4F1A;&#x6709;&#x4EBA;&#x5199;&#xFF0C;&#x6709;&#x4EBA;&#x70B9;&#x8D5E;&#xFF0C;&#x6709;&#x4EBA;&#x6536;&#x85CF;&#xFF0C;&#x6709;&#x4EBA;&#x8BC4;&#x8BBA;&#xFF1B;&#x9664;&#x4E86;&#x9875;&#x9762;&#x4E0A;&#x7684;&#x5206;&#x4EAB;&#xFF0C;&#x8FD8;&#x6709; BU &#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x6D41;&#xFF0C;&#x56E2;&#x961F;&#x4E4B;&#x95F4;&#x7684;&#x6C9F;&#x901A;&#xFF0C;&#x524D;&#x540E;&#x7AEF;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x5B66;&#x4E60;&#xFF1B;&#x8FD8;&#x6709;&#x524D;&#x7AEF;&#x591C;&#x6821;&#x3001;&#x96C6;&#x56E2;&#x591C;&#x6821;&#xFF0C;&#x4E0B;&#x73ED;&#x4E86;&#x4E0D;&#x60F3;&#x8D70;&#x5C31;&#x53C2;&#x52A0;&#x591C;&#x6821;&#x57F9;&#x8BAD;&#x5B66;&#x4E60;&#x3002;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x5728;&#x6280;&#x672F;&#x4EA4;&#x6D41;&#x8FD9;&#x4E00;&#x5757;&#x505A;&#x7684;&#x8FD8;&#x662F;&#x76F8;&#x5F53;&#x4E0D;&#x9519;&#x7684;&#x3002;</p>
<h3 id="&#x56E2;&#x961F;&#x77E5;&#x8BC6;&#x6C89;&#x6DC0;&#x7684;&#x5BF9;&#x5916;&#x4F20;&#x64AD;">&#x56E2;&#x961F;&#x77E5;&#x8BC6;&#x6C89;&#x6DC0;&#x7684;&#x5BF9;&#x5916;&#x4F20;&#x64AD;</h3><p>&#x5728;&#x4E00;&#x4E2A;&#x5584;&#x4E8E;&#x5206;&#x4EAB;&#x7684;&#x56E2;&#x961F;&#x4E2D;&#xFF0C;&#x65F6;&#x95F4;&#x4E45;&#x4E86;&#x81EA;&#x5DF1;&#x4E5F;&#x4F1A;&#x88AB;&#x85B0;&#x9676;&#x6210;&#x4E00;&#x4E2A;&#x5584;&#x4E8E;&#x5206;&#x4EAB;&#x7684;&#x4EBA;&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x4E1A;&#x52A1;&#x7684;&#x601D;&#x8003;&#x8FD8;&#x662F;&#x6280;&#x672F;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x5F88;&#x591A;&#x540C;&#x5B66;&#x4F1A;&#x628A;&#x597D;&#x7684;&#x4E1C;&#x897F;&#x5199;&#x4E0B;&#x6765;&#x5206;&#x4EAB;&#x7ED9;&#x5176;&#x4ED6;&#x4EBA;&#xFF0C;&#x5728;&#x5206;&#x4EAB;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x6709;&#x4EBA;&#x8DDF;&#x4F60;&#x4E00;&#x8D77;&#x4EA4;&#x6D41;&#xFF0C;&#x6307;&#x51FA;&#x4F60;&#x601D;&#x8003;&#x4E2D;&#x7684;&#x4E0D;&#x5B8C;&#x5584;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x76F8;&#x4E92;&#x63D0;&#x9AD8;&#x3002;&#x8FD9;&#x662F;&#x8001;&#x5927;&#x4EEC;&#x671F;&#x671B;&#x770B;&#x5230;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x4F1A;&#x4E3B;&#x52A8;&#x53C2;&#x4E0E;&#x548C;&#x63A8;&#x52A8;&#xFF0C;&#x7ECF;&#x5E38;&#x5206;&#x4EAB;&#x4E00;&#x4E9B;&#x60F3;&#x6CD5;&#x5F15;&#x6765;&#x8BA8;&#x8BBA;&#xFF0C;&#x8FD9;&#x6837;&#x5F88;&#x5229;&#x4E8E;&#x5E26;&#x52A8;&#x56E2;&#x961F;&#x7684;&#x5171;&#x540C;&#x8FDB;&#x6B65;&#x3002;</p>
<p>&#x5185;&#x90E8;&#x535A;&#x5BA2;&#x5E73;&#x53F0;&#x4E0A;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x662F;&#x4E0D;&#x80FD;&#x5BF9;&#x5916;&#x7684;&#xFF0C;&#x4E1A;&#x52A1;&#x8026;&#x5408;&#x5EA6;&#x592A;&#x9AD8;&#xFF0C;&#x5E76;&#x4E14;&#x53C2;&#x5408;&#x4E86;&#x5BF9;&#x4E1A;&#x52A1;&#x7684;&#x601D;&#x8003;&#x4E2D;&#x5F88;&#x591A;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x5916;&#x4F20;&#x64AD;&#x4E5F;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x6D41;&#x7A0B;&#x3002;</p>
<p>&#x6DD8;&#x5B9D; FED &#x7684;&#x535A;&#x5BA2;&#x662F;&#x9759;&#x6001;&#x53D1;&#x5E03;&#x7684;&#xFF0C;&#x6258;&#x7BA1;&#x5728; github/gitcafe &#x4E0A;&#xFF0C;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x5730;&#x7B5B;&#x9009;&#x3001;&#x8FC7;&#x6EE4;&#x548C;&#x68C0;&#x6D4B;&#x535A;&#x5BA2;&#x5185;&#x5BB9;&#xFF0C;&#x6211;&#x505A;&#x4E86;&#x4E00;&#x4E2A;&#x535A;&#x5BA2;&#x540E;&#x53F0;&#xFF0C;&#x5BF9;&#x535A;&#x5BA2;&#x6587;&#x7AE0;&#x683C;&#x5F0F;&#x548C;&#x56FE;&#x7247;&#x505A;&#x4E86;&#x786C;&#x6027;&#x7684;&#x89C4;&#x5B9A;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x6587;&#x7AE0;&#x5FC5;&#x987B;&#x6709;&#x9898;&#x56FE;&#xFF0C;&#x9898;&#x56FE;&#x5C3A;&#x5BF8;&#x4E3A; 900x500</li>
<li>&#x6587;&#x7AE0;&#x683C;&#x5F0F;&#x7B26;&#x5408;&#x6587;&#x6863;&#x901A;&#x7528;&#x89C4;&#x8303;&#xFF0C;&#x9488;&#x5BF9;&#x89C4;&#x8303;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x5F00;&#x53D1;&#x4E86;&#x68C0;&#x6D4B;&#x5DE5;&#x5177;&#xFF0C;&#x6BD4;&#x5982;&#x5168;&#x89D2;&#x548C;&#x534A;&#x89D2;&#x7684;&#x4F7F;&#x7528;&#x3001;&#x4E2D;&#x82F1;&#x6587;&#x4E4B;&#x95F4;&#x7684;&#x7A7A;&#x683C;&#x3001;&#x4E13;&#x6709;&#x8BCD;&#x6C47;&#x7684;&#x5927;&#x5C0F;&#x5199;&#x7B49;&#x7B49;</li>
</ul>
<p>&#x6587;&#x7AE0;&#x53EA;&#x6709; Team Leader &#x624D;&#x6709;&#x6743;&#x9650;&#x53D1;&#x5E03;&#x5230;&#x540E;&#x53F0;&#x7CFB;&#x7EDF;&#xFF0C;&#x6240;&#x6709; TL &#x90FD;&#x5FC5;&#x987B;&#x770B;&#x4E00;&#x904D;&#x53D1;&#x5E03;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x6570;&#x636E;&#x8131;&#x654F;&#xFF0C;&#x786E;&#x4FDD;&#x5BF9;&#x5916;&#x53D1;&#x5E03;&#x662F;&#x5B89;&#x5168;&#x7684;&#x3002;&#x535A;&#x5BA2;&#x540E;&#x53F0;&#x7684;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#x90FD;&#x4E0D;&#x4F1A;&#x540C;&#x6B65;&#x5230;&#x5916;&#x7F51;&#xFF0C;&#x6700;&#x540E;&#x4F1A;&#x7531;&#x6211;&#x786E;&#x8BA4;&#x4E00;&#x904D;&#xFF0C;&#x7136;&#x540E;&#x624B;&#x52A8;&#x540C;&#x6B65;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x7ED9;&#x5927;&#x5BB6;&#x63A8;&#x8350;&#x51E0;&#x4E2A;&#x6CA1;&#x6709;&#x7248;&#x6743;&#x95EE;&#x9898;&#x7684;&#x56FE;&#x7247;&#x4E0B;&#x8F7D;&#x5730;&#x5740;&#xFF1A;</p>
<ul>
<li><a href="http://publicdomainarchive.com/" target="_blank" rel="external">http://publicdomainarchive.com/</a></li>
<li><a href="http://www.gratisography.com/" target="_blank" rel="external">http://www.gratisography.com/</a></li>
<li><a href="https://unsplash.com/" target="_blank" rel="external">https://unsplash.com/</a></li>
<li><a href="https://picjumbo.com/" target="_blank" rel="external">https://picjumbo.com/</a></li>
<li><a href="https://pixabay.com/" target="_blank" rel="external">https://pixabay.com/</a></li>
</ul>
<p>&#x89C4;&#x8303;&#x548C;&#x6D41;&#x7A0B;&#x53EA;&#x662F;&#x6700;&#x540E;&#x73AF;&#x8282;&#xFF0C;&#x91CD;&#x70B9;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x56E2;&#x961F;&#x6709;&#x4EBA;&#x5206;&#x4EAB;&#x3002;</p>
<h3 id="&#x6700;&#x540E;">&#x6700;&#x540E;</h3><p>&#x5DE5;&#x4F5C;&#x65E5;&#x6BCF;&#x65E5;&#x4E00;&#x6587;&#xFF0C;&#x5DF2;&#x7ECF;&#x575A;&#x6301;&#x4E09;&#x4E2A;&#x591A;&#x6708;&#x4E86;&#x3002;&#x5F53;&#x521D;&#x89C4;&#x5212;&#x7684;&#x53D1;&#x5E03;&#x65F6;&#x95F4;&#x662F;&#xFF1A;</p>
<ul>
<li>&#x5468;&#x4E00;&#xFF1A;web &#x5F00;&#x53D1;</li>
<li>&#x5468;&#x4E8C;&#x3001;&#x5468;&#x56DB;&#xFF1A;node</li>
<li>&#x5468;&#x4E09;&#xFF1A;&#x65E0;&#x7EBF;</li>
<li>&#x5468;&#x4E94;&#xFF1A;&#x5DE5;&#x5177;&#x5E73;&#x53F0;</li>
<li>&#x65F6;&#x800C;&#xFF1A;&#x56E2;&#x961F;&#x751F;&#x6D3B;</li>
</ul>
<p>&#x8FD9;&#x4E2A;&#x9891;&#x7387;&#x5BF9;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x6765;&#x8BF4;&#xFF0C;&#x4E5F;&#x662F;&#x591F;&#x545B;&#x7684;&#x3002;&#x6709;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x4F1A;&#x51FA;&#x73B0;&#x67D0;&#x4E2A;&#x5206;&#x7C7B;&#x4E0B;&#xFF0C;&#x540C;&#x5B66;&#x4EEC;&#x7684;&#x4EA7;&#x51FA;&#x5E76;&#x4E0D;&#x591A;&#xFF0C;&#x6BD4;&#x5982;&#x65E0;&#x7EBF;&#x65B9;&#x9762;&#x3002;&#x4ECE;&#x4E2D;&#x4E5F;&#x80FD;&#x4F53;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x56E2;&#x961F;&#x5728;&#x65E0;&#x7EBF;&#x65B9;&#x9762;&#x7684;&#x94BB;&#x7814;&#x8FD8;&#x4E0D;&#x591F;&#x6DF1;&#x5165;&#x3002;</p>
<p>&#x6211;&#x6BCF;&#x5929;&#x90FD;&#x4F1A;&#x82B1;&#x8D39; 10-40 &#x5206;&#x949F;&#x6765;&#x4F20;&#x64AD;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#xFF0C;&#x5728; QQ &#x7FA4;&#xFF0C;&#x670B;&#x53CB;&#x5708;&#x548C;&#x5FAE;&#x535A;&#x4E0A;&#xFF0C;&#x4F20;&#x64AD;&#x7684;&#x76EE;&#x7684;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x8DDF;&#x5927;&#x5BB6;&#x4EA4;&#x6D41;&#xFF0C;&#x6536;&#x96C6;&#x5927;&#x5BB6;&#x7684;&#x610F;&#x89C1;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x4F1A;&#x5BF9;&#x5185;&#x5BB9;&#x505A;&#x4E00;&#x4E9B;&#x7B54;&#x7591;&#x3002;</p>
<p>&#x540E;&#x7EED;&#x53D1;&#x5E03;&#x9891;&#x7387;&#x4F1A;&#x964D;&#x4F4E;&#x4E00;&#x4E9B;&#xFF0C;&#x6BCF;&#x5468; 2-3 &#x7BC7;&#xFF0C;&#x4FDD;&#x8BC1;&#x8D28;&#x91CF;&#xFF0C;&#x4E5F;&#x4FDD;&#x8BC1;&#x70ED;&#x5EA6;&#x3002;</p></div>
</div>

</body>
</html>