<!DOCTYPE html>
<html>
<head>
  
  <title>&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5C3D;&#x5FEB;&#x5347;&#x7EA7;&#x5230; HTTPS&#xFF1F;</title>
  
</head>
<body>

<div id="wrap">
  <h1>&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5C3D;&#x5FEB;&#x5347;&#x7EA7;&#x5230; HTTPS&#xFF1F;</h1>
  <div id="content"><p>&#x6700;&#x8FD1;&#x4E00;&#x5E74;&#xFF0C;&#x6211;&#x5199;&#x4E86;&#x4E0D;&#x5C11;&#x6709;&#x5173; HTTPS &#x548C; HTTP/2 &#x7684;&#x6587;&#x7AE0;&#x3002;&#x5F88;&#x591A;&#x540C;&#x5B66;&#x90FD;&#x95EE;&#x6211;&#xFF0C;HTTPS &#x771F;&#x7684;&#x6709;&#x90A3;&#x4E48;&#x597D;&#x5417;&#xFF0C;&#x6211;&#x7684; WEB &#x670D;&#x52A1;&#x9700;&#x8981;&#x8FC1;&#x79FB;&#x5230; HTTPS &#x5417;&#xFF1F;&#x5BF9;&#x6B64;&#x6211;&#x7684;&#x89C2;&#x70B9;&#x662F;&#xFF1A;HTTPS &#x65E9;&#x5C31;&#x4E0D;&#x662F;&#x9526;&#x4E0A;&#x6DFB;&#x82B1;&#x7684;&#x53EF;&#x6709;&#x53EF;&#x65E0;&#x9879;&#xFF0C;&#x5B83;&#x5DF2;&#x7ECF;&#x9010;&#x6E10;&#x6210;&#x4E3A; WEB &#x670D;&#x52A1;&#x7684;&#x6807;&#x914D;&#xFF0C;&#x63A8;&#x8350;&#x5927;&#x5BB6;&#x5C3D;&#x65E9;&#x8FC1;&#x79FB;&#x3002;</p>
<p>HTTPS &#x53EF;&#x4EE5;&#x7ED9;&#x7528;&#x6237;&#x5E26;&#x6765;&#x66F4;&#x5B89;&#x5168;&#x3001;&#x66F4;&#x597D;&#x9690;&#x79C1;&#x4FDD;&#x62A4;&#x7684;&#x7F51;&#x7EDC;&#x4F53;&#x9A8C;&#xFF0C;&#x8FD9;&#x4E9B;&#x597D;&#x5904;&#x5927;&#x5BB6;&#x90FD;&#x8033;&#x719F;&#x80FD;&#x8BE6;&#xFF0C;&#x672C;&#x6587;&#x4E0D;&#x518D;&#x8D58;&#x8FF0;&#x3002;&#x76EE;&#x524D;&#x5404;&#x5927;&#x6D4F;&#x89C8;&#x5668;&#x90FD;&#x5728;&#x79EF;&#x6781;&#x63A8;&#x8FDB; HTTPS &#x7684;&#x666E;&#x53CA;&#xFF0C;&#x6211;&#x4EEC;&#x91CD;&#x70B9;&#x6765;&#x8BF4;&#x8BF4;&#x8FD9;&#x4E2A;&#x3002;</p>
<p>HTTP/2 &#x901A;&#x8FC7;&#x5F15;&#x5165;&#x4E8C;&#x8FDB;&#x5236;&#x5206;&#x5E27;&#x5C42;&#xFF0C;&#x5C06; HTTP &#x7684;&#x8BF7;&#x6C42;&#x548C;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x62C6;&#x5206;&#x4E3A;&#x4E8C;&#x8FDB;&#x5236;&#x5E27;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x4E86;&#x591A;&#x8DEF;&#x590D;&#x7528;&#x3001;&#x4F18;&#x5148;&#x7EA7;&#x3001;Server Push &#x7B49;&#x8BF8;&#x591A;&#x65B0;&#x7279;&#x6027;&#xFF0C;&#x5927;&#x5927;&#x63D0;&#x5347;&#x4E86; WEB &#x6027;&#x80FD;&#x3002;HTTP/2 &#x8FD8;&#x5F15;&#x5165;&#x4E86;&#x57FA;&#x4E8E;&#x9759;&#x6001;&#x5B57;&#x5178;&#x548C;&#x52A8;&#x6001;&#x5B57;&#x5178;&#x7684;&#x5934;&#x90E8;&#x538B;&#x7F29;&#x7B97;&#x6CD5; &#x2014;&#x2014; HPACK&#xFF0C;&#x6709;&#x6548;&#x51CF;&#x5C11;&#x4E86; HTTP &#x534F;&#x8BAE;&#x5934;&#x90E8;&#x5F00;&#x9500;&#x3002;&#x73B0;&#x9636;&#x6BB5;&#xFF0C;&#x6240;&#x6709;&#x6D4F;&#x89C8;&#x5668;&#x90FD;&#x53EA;&#x652F;&#x6301; HTTP/2 Over TLS&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x7684; HTTP/2 &#x5FC5;&#x987B;&#x57FA;&#x4E8E; HTTPS &#x90E8;&#x7F72;&#x3002;</p>
<p>&#x4E00;&#x4E9B; HTML5 API &#x53EF;&#x4EE5;&#x7528;&#x6765;&#x83B7;&#x53D6;&#x7528;&#x6237;&#x5730;&#x7406;&#x4F4D;&#x7F6E;&#x3001;&#x6444;&#x50CF;&#x5934;&#x97F3;&#x89C6;&#x9891;&#x7B49;&#x9690;&#x79C1;&#x6570;&#x636E;&#x3002;&#x5C3D;&#x7BA1;&#x7F51;&#x7AD9;&#x5728;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x6743;&#x9650;&#x524D;&#x9700;&#x8981;&#x83B7;&#x5F97;&#x7528;&#x6237;&#x6388;&#x6743;&#xFF0C;&#x4F46;&#x7531;&#x4E8E; HTTP &#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x52AB;&#x6301;&#xFF0C;&#x901A;&#x8FC7; HTTP &#x4F20;&#x8F93;&#x8FD9;&#x4E9B;&#x9690;&#x79C1;&#x6570;&#x636E;&#x5C06;&#x4F1A;&#x5341;&#x5206;&#x5371;&#x9669;&#x3002;</p>
<p>&#x4E8E;&#x662F;&#xFF0C;Chrome &#x542F;&#x7528;&#x4E86; <a href="https://sites.google.com/a/chromium.org/dev/Home/chromium-security/deprecating-powerful-features-on-insecure-origins">Deprecating Powerful Features on Insecure Origins</a> &#x8BA1;&#x5212;&#xFF0C;&#x4ECA;&#x540E;&#x4EE5;&#x4E0B; API &#x5FC5;&#x987B;&#x5728;&#x5B89;&#x5168;&#x73AF;&#x5883;&#xFF08;Secure Contexts&#xFF09;&#x4E2D;&#x624D;&#x80FD;&#x4F7F;&#x7528;&#xFF1A;</p>
<ul>
<li><a href="https://www.w3.org/TR/geolocation-API/">Geolocation</a></li>
<li><a href="https://www.w3.org/TR/orientation-event/">Device motion / orientation</a></li>
<li><a href="https://www.w3.org/TR/encrypted-media/">EME</a></li>
<li><a href="https://www.w3.org/TR/mediacapture-streams/#dom-mediadevices-getusermedia">getUserMedia</a></li>
<li>AppCache</li>
</ul>
<p>&#x5176;&#x4E2D;&#xFF0C;&#x5217;&#x8868;&#x4E2D;&#x7684; Geolocaiton &#x548C; getUserMedia &#x5728; Chrome 50 &#x4E2D;&#x5DF2;&#x7ECF;&#x53EA;&#x80FD;&#x7528;&#x4E8E;&#x5B89;&#x5168;&#x73AF;&#x5883;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5728;&#x6700;&#x65B0;&#x7684; Chrome &#x4E2D;&#xFF0C;&#x8981;&#x60F3;&#x901A;&#x8FC7; HTML5 API &#x83B7;&#x53D6;&#x7528;&#x6237;&#x4F4D;&#x7F6E;&#xFF0C;&#x6216;&#x8005;&#x8981;&#x7528; WebRTC &#x5B9E;&#x73B0;&#x89C6;&#x9891;&#x804A;&#x5929;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x5148;&#x90E8;&#x7F72; HTTPS&#x3002;</p>
<p>EME &#x5168;&#x79F0;&#x662F; Encrypted Media Extensions&#xFF08;&#x52A0;&#x5BC6;&#x5A92;&#x4F53;&#x6269;&#x5C55;&#xFF09;&#xFF0C;&#x5B83;&#x6269;&#x5C55;&#x4E86; HTMLMediaElement&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x7EC4; API &#x7528;&#x4E8E;&#x63A7;&#x5236;&#x53D7;&#x4FDD;&#x62A4;&#x7684;&#x6587;&#x6863;&#xFF0C;&#x5B9E;&#x73B0; HTML &#x5A92;&#x4F53;&#x7684;&#x6570;&#x5B57;&#x7248;&#x6743;&#x4FDD;&#x62A4;&#x80FD;&#x529B;&#x3002;EME &#x662F;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x51B7;&#x95E8;&#x7684; API&#x3002;</p>
<p>AppCache &#x529F;&#x80FD;&#x5DF2;&#x7ECF;&#x88AB;&#x5E9F;&#x5F03;&#xFF0C;&#x4E0D;&#x63A8;&#x8350;&#x7EE7;&#x7EED;&#x4F7F;&#x7528;&#xFF0C;&#x7C7B;&#x4F3C;&#x9700;&#x6C42;&#x5EFA;&#x8BAE;&#x7528; Service Workers &#x6765;&#x5B9E;&#x73B0;&#x3002;&#x66F4;&#x591A;&#x8BF4;&#x660E;&#x8BF7;&#x770B; <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Using_the_application_cache">MDN &#x8FD9;&#x7BC7;&#x6587;&#x6863;</a>&#x3002;</p>
<p>&#x81F3;&#x4E8E;&#x4EC0;&#x4E48;&#x662F;&#x5B89;&#x5168;&#x73AF;&#x5883;&#xFF08;Secure Contexts&#xFF09;&#xFF0C;<a href="https://w3c.github.io/webappsec-secure-contexts/">W3C &#x8FD9;&#x4EFD;&#x6587;&#x6863;</a>&#x8FDB;&#x884C;&#x4E86;&#x8BE6;&#x7EC6;&#x7684;&#x89E3;&#x91CA;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;HTTP &#x9875;&#x9762;<strong>&#x4E00;&#x5B9A;&#x4E0D;&#x662F;</strong>&#x5B89;&#x5168;&#x73AF;&#x5883;&#xFF1B;HTTPS &#x9875;&#x9762;<strong>&#x4E0D;&#x4E00;&#x5B9A;&#x662F;</strong>&#x5B89;&#x5168;&#x73AF;&#x5883;&#x3002;&#x5C24;&#x5176;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5728; HTTP &#x9875;&#x9762;&#x4E2D;&#x6253;&#x5F00;&#x7684; HTTPS &#x9875;&#x9762;&#xFF0C;&#x5982;&#x679C; window.opener &#x4E0D;&#x4E3A;&#x7A7A;&#xFF0C;<strong>&#x4E0D;&#x5C5E;&#x4E8E;</strong>&#x5B89;&#x5168;&#x73AF;&#x5883;&#x3002;</p>
<p>&#x81F3;&#x4E8E;&#x5927;&#x5BB6;&#x62C5;&#x5FC3;&#x7684;&#x672C;&#x5730;&#x8C03;&#x8BD5;&#x95EE;&#x9898;&#xFF0C;Chrome &#x4E5F;&#x6709;&#x8003;&#x8651;&#xFF1A;</p>
<ul>
<li><code>localhost</code> &#x4F1A;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x5B89;&#x5168;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x4F7F;&#x7528; <code>localhost</code> &#x57DF;&#x540D;&#x6D4B;&#x8BD5;&#x4E0A;&#x8FF0; API&#xFF1B;</li>
<li>&#x901A;&#x8FC7; <code>--user-data-dir=/test/only/profile/dir</code> &#x53C2;&#x6570;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684; Profile &#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; <code>--unsafely-treat-insecure-origin-as-secure=&quot;http://example.com</code> &#x53C2;&#x6570;&#x8BA9; Chrome &#x4FE1;&#x4EFB;&#x6307;&#x5B9A;&#x7684;&#x7F51;&#x7AD9;&#xFF1B;</li>
</ul>
<p>&#x53E6;&#x5916;&#xFF0C;Mozilla &#x516C;&#x53F8;&#x5728;&#x4E00;&#x5E74;&#x524D;&#x4E5F;&#x660E;&#x786E;&#x8868;&#x6001;&#x4F1A;&#x9010;&#x6B65;&#x6DD8;&#x6C70;&#x4E0D;&#x5B89;&#x5168;&#x7684; HTTP&#xFF0C;&#x8BE6;&#x89C1;&#xFF1A;<a href="https://blog.mozilla.org/security/2015/04/30/deprecating-non-secure-http/">Deprecating Non-Secure HTTP</a>&#x3002;</p>
<p>&#x5728;&#x5F80; HTTPS &#x8FC1;&#x79FB;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5927;&#x5BB6;&#x666E;&#x904D;&#x6709;&#x4E00;&#x4E9B;&#x62C5;&#x5FC3;&#xFF0C;&#x6211;&#x6311;&#x9009;&#x4E86;&#x4E00;&#x4E9B;&#x6709;&#x4EE3;&#x8868;&#x6027;&#x7684;&#x770B;&#x6CD5;&#x8FDB;&#x884C;&#x8BA8;&#x8BBA;&#x3002;</p>
<p><strong>HTTPS &#x4F1A;&#x589E;&#x52A0;&#x7CFB;&#x7EDF;&#x590D;&#x6742;&#x6027;</strong>&#x3002;&#x9996;&#x5148;&#xFF0C;&#x90E8;&#x7F72; HTTPS &#x786E;&#x5B9E;&#x4F1A;&#x5F15;&#x5165;&#x5F88;&#x591A;&#x65B0;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F8B;&#x5982;&#x8BC1;&#x4E66;&#x3001;SSL &#x914D;&#x7F6E;&#x3001;&#x5168;&#x7AD9;&#x8D44;&#x6E90;&#x66FF;&#x6362;&#x7B49;&#x7B49;&#xFF0C;&#x786E;&#x5B9E;&#x4F1A;&#x7ED9;&#x5F00;&#x53D1;&#x548C;&#x8FD0;&#x7EF4;&#x540C;&#x5B66;&#x589E;&#x52A0;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;&#x4ECE; HTTP &#x5207;&#x6362;&#x5230; HTTPS &#x7684;&#x8FC7;&#x7A0B;&#x662F;&#x6BD4;&#x8F83;&#x9EBB;&#x70E6;&#xFF0C;&#x4F46;&#x4E00;&#x65E6;&#x5B8C;&#x6210;&#x4E86;&#x5207;&#x6362;&#xFF0C;&#x4E4B;&#x540E;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x6295;&#x5165;&#x592A;&#x591A;&#x7CBE;&#x529B;&#x5728;&#x8FD9;&#x4E0A;&#x9762;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x90E8;&#x7F72; HTTPS &#x53EA;&#x9700;&#x8981;&#x6539;&#x9020;&#x76F4;&#x63A5;&#x8DDF;&#x7528;&#x6237;&#x6253;&#x4EA4;&#x9053;&#x7684; HTTP &#x63A5;&#x5165;&#x5C42;&#xFF0C;&#x5185;&#x90E8;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x8C03;&#x7528;&#x65E0;&#x9700;&#x6539;&#x9020;&#x3002;&#x63A8;&#x8350;&#x9605;&#x8BFB;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#xFF1A;<a href="https://imququ.com/search.html?s=%E5%85%B3%E4%BA%8E%E5%90%AF%E7%94%A8+HTTPS+%E7%9A%84%E7%BB%8F%E9%AA%8C%E5%88%86%E4%BA%AB">&#x542F;&#x7528; HTTPS &#x7684;&#x7ECF;&#x9A8C;&#x5206;&#x4EAB;</a>&#x3002;</p>
<p><strong>HTTPS &#x8BC1;&#x4E66;&#x4F1A;&#x589E;&#x52A0;&#x6210;&#x672C;</strong>&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E2A;&#x4EBA;&#x53CA;&#x5C0F;&#x516C;&#x53F8;&#x6765;&#x8BF4;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x96F6;&#x8D39;&#x7528;&#x7684;&#x8BC1;&#x4E66;&#x65B9;&#x6848;&#x53EF;&#x4F9B;&#x9009;&#x62E9;&#xFF0C;&#x5176;&#x4E2D;&#x4EE5; <a href="https://imququ.com/post/letsencrypt-certificate.html">Let&apos;s Encrypt</a> &#x6700;&#x4E3A;&#x51FA;&#x540D;&#xFF0C;&#x8DB3;&#x591F;&#x7B80;&#x5355;&#x597D;&#x7528;&#x3002;&#x800C;&#x5BF9;&#x4E8E;&#x4E2D;&#x5927;&#x578B;&#x516C;&#x53F8;&#x6765;&#x8BF4;&#xFF0C;&#x76F8;&#x6BD4;&#x5176;&#x4ED6;&#x5F00;&#x9500;&#xFF0C;HTTPS &#x8BC1;&#x4E66;&#x91C7;&#x8D2D;&#x6210;&#x672C;&#x57FA;&#x672C;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x4E0D;&#x8BA1;&#x3002;</p>
<p><strong>HTTPS &#x4F1A;&#x5BFC;&#x81F4;&#x6027;&#x80FD;&#x4E0B;&#x964D;</strong>&#x3002;HTTPS &#x589E;&#x52A0;&#x4E86; TLS &#x63E1;&#x624B;&#x73AF;&#x8282;&#xFF0C;&#x518D;&#x52A0;&#x4E0A; HTTPS &#x5E94;&#x7528;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x9700;&#x8981;&#x7ECF;&#x8FC7;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#xFF0C;HTTPS &#x786E;&#x5B9E;&#x7ED9;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x63D0;&#x51FA;&#x4E86;&#x66F4;&#x5927;&#x7684;&#x6311;&#x6218;&#x3002;&#x597D;&#x5728;&#x968F;&#x7740;&#x670D;&#x52A1;&#x5668;&#x3001;&#x6D4F;&#x89C8;&#x5668;&#x4EE5;&#x53CA; SSL &#x5E93;&#x5728;&#x6027;&#x80FD;&#x4E0A;&#x7684;&#x5927;&#x5E45;&#x63D0;&#x5347;&#xFF0C;&#x7ECF;&#x8FC7;&#x826F;&#x597D;&#x4F18;&#x5316;&#x540E; HTTPS &#x5E26;&#x6765;&#x7684;&#x6027;&#x80FD;&#x635F;&#x8017;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x3002;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x90E8;&#x7F72;&#x4E86; HTTPS &#x610F;&#x5473;&#x7740;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; HTTP/2&#xFF0C;&#x4ECE;&#x800C;&#x5E26;&#x7ED9;&#x7528;&#x6237;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#x4F53;&#x9A8C;&#x3002;&#x5982;&#x679C;&#x5BF9; TLS &#x4F18;&#x5316;&#x7EC6;&#x8282;&#x6709;&#x5174;&#x8DA3;&#xFF0C;&#x63A8;&#x8350;&#x9605;&#x8BFB; <a href="https://imququ.com/post/optimize-tls-handshake.html">TLS &#x63E1;&#x624B;&#x4F18;&#x5316;&#x8BE6;&#x89E3;</a>&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE; Google &#x6027;&#x80FD;&#x4F18;&#x5316;&#x4E13;&#x5BB6; Ilya Grigorik &#x521B;&#x529E;&#x7684; <a href="https://istlsfastyet.com">Is TLS Fast Yet?</a> &#x7F51;&#x7AD9;&#x3002;</p>
<p><strong>&#x975E;&#x654F;&#x611F;&#x5185;&#x5BB9;&#x4E0D;&#x9700;&#x8981; HTTPS</strong>&#x3002;&#x5F88;&#x591A;&#x4EBA;&#x89C9;&#x5F97;&#x53EA;&#x6709;&#x94F6;&#x884C;&#x3001;&#x7535;&#x5546;&#x7B49;&#x8DDF;&#x94B1;&#x6253;&#x4EA4;&#x9053;&#x7684;&#x7F51;&#x7AD9;&#x624D;&#x9700;&#x8981;&#x90E8;&#x7F72; HTTPS&#xFF0C;&#x5176;&#x5B9E;&#x4E0D;&#x7136;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x975E; HTTPS &#x7F51;&#x7AD9;&#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x52AB;&#x6301;&#x5E76;&#x63D2;&#x5165;&#x5E7F;&#x544A;&#xFF0C;&#x5F71;&#x54CD;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF1B;&#x5176;&#x6B21;&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#x4E0A;&#x6CA1;&#x6709;&#x4EA4;&#x6613;&#x652F;&#x4ED8;&#x7B49;&#x654F;&#x611F;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x53EA;&#x8981;&#x6709;&#x7528;&#x6237;&#x767B;&#x5F55;&#xFF0C;&#x5E10;&#x53F7;&#x5BC6;&#x7801;&#x88AB;&#x7B2C;&#x4E09;&#x65B9;&#x76D7;&#x53D6;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x793E;&#x5DE5;&#x6216;&#x649E;&#x5E93;&#xFF1B;&#x6700;&#x540E;&#xFF0C;&#x4E00;&#x4E9B;&#x6D41;&#x91CF;&#x5F88;&#x5927;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x90E8;&#x7F72; HTTPS &#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x522B;&#x6709;&#x7528;&#x5FC3;&#x7684;&#x4EBA;&#x5229;&#x7528;&#xFF0C;&#x4F8B;&#x5982; 2015 &#x5E74;&#x67D0;&#x5927;&#x578B;&#x7F51;&#x7AD9;&#x7684; JS &#x5C31;&#x88AB;&#x4EBA;&#x52AB;&#x6301;&#x7528;&#x6765; DDoS &#x653B;&#x51FB; Github&#x3002;</p>
<p>&#x6700;&#x540E;&#x7EA0;&#x6B63;&#x4E00;&#x4E2A;&#x8BEF;&#x533A;&#xFF1A;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x90E8;&#x7F72;&#x4E86; HTTPS&#xFF0C;&#x5B89;&#x5168;&#x65B9;&#x9762;&#x5C31;&#x53EF;&#x4EE5;&#x9AD8;&#x6795;&#x65E0;&#x5FE7;&#x3002;HTTPS &#x89E3;&#x51B3;&#x7684;&#x53EA;&#x662F;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x7684;&#x5B89;&#x5168;&#x6027;&#x548C;&#x4FDD;&#x5BC6;&#x6027;&#xFF0C;&#x5982;&#x679C; WEB &#x7A0B;&#x5E8F;&#x6216;&#x8005;&#x670D;&#x52A1;&#x5668;&#x6709;&#x5B89;&#x5168;&#x6F0F;&#x6D1E;&#xFF0C;&#x6216;&#x8005;&#x7528;&#x6237;&#x7535;&#x8111;&#x4E2D;&#x75C5;&#x6BD2;&#x4E86;&#xFF0C;&#x90A3;&#x5B89;&#x5168;&#x6027;&#x65E0;&#x4ECE;&#x8C08;&#x8D77;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x8981;&#x8BA9; HTTPS &#x53D1;&#x6325;&#x6700;&#x5927;&#x4F5C;&#x7528;&#xFF0C;&#x5F80;&#x5F80;&#x8FD8;&#x9700;&#x8981;&#x7ED3;&#x5408;&#x5176;&#x5B83;&#x6280;&#x672F;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#xFF0C;&#x4F8B;&#x5982; <a href="https://imququ.com/search.html?s=HSTS">HSTS</a>&#x3001;<a href="https://imququ.com/search.html?s=HPKP">HPKP</a> &#x7B49;&#xFF0C;&#x672C;&#x6587;&#x4E0D;&#x5C55;&#x5F00;&#x8BA8;&#x8BBA;&#x4E86;&#x3002;</p>
<p>&#x672C;&#x6587;&#x94FE;&#x63A5;&#xFF1A;<a href="https://imququ.com/post/moving-to-https-asap.html">https://imququ.com/post/moving-to-https-asap.html</a>&#xFF0C;<a href="https://imququ.com/post/moving-to-https-asap.html#comments" target="_blank">&#x53C2;&#x4E0E;&#x8BA8;&#x8BBA;</a></p><p>&#x2665; &#x672C;&#x7AD9;&#x6240;&#x6709;&#x6587;&#x7AE0;&#x5747;&#x4E3A;&#x672C;&#x4EBA;&#x539F;&#x521B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8BA4;&#x4E3A;&#x6211;&#x7684;&#x6587;&#x7AE0;&#x5BF9;&#x4F60;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x6B22;&#x8FCE;&#x8D5E;&#x52A9;&#x672C;&#x7AD9;&#x3002;<a target="_blank" href="https://imququ.com/post/about.html#toc-2">&#x8BE6;&#x60C5;&#x8BF7;&#x70B9;&#x8FD9;&#x91CC; &#xBB;</a></p></div>
</div>

</body>
</html>