<!DOCTYPE html>
<html>
<head>
  
  <title>Chrome &#x4E2D; scrollingElement &#x7684;&#x53D8;&#x5316;</title>
  
</head>
<body>

<div id="wrap">
  <h1>Chrome &#x4E2D; scrollingElement &#x7684;&#x53D8;&#x5316;</h1>
  <div id="content"><p>&#x76F8;&#x4FE1;&#x5927;&#x90E8;&#x5206;&#x524D;&#x7AEF;&#x540C;&#x5B66;&#x90FD;&#x77E5;&#x9053;&#xFF0C;Webkit &#x5BF9;&#x4E8E;&#x9875;&#x9762;&#x6EDA;&#x52A8;&#x6761;&#x4F4D;&#x7F6E;&#xFF0C;&#x6CA1;&#x6709;&#x6309;&#x7167;&#x6807;&#x51C6;&#x5904;&#x7406;&#x3002;&#x4EE5;&#x4E0B;&#x662F;&#x4E00;&#x6BB5;&#x76F8;&#x5173;&#x63CF;&#x8FF0;&#xFF0C;&#x6458;&#x81EA; <a href="http://w3help.org/zh-cn/causes/BX9008">W3Help</a>&#xFF1A;</p>
<blockquote>
<p>&#x5728;&#x6DF7;&#x6742;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x7531;&#x4E8E;&#x6240;&#x6709;&#x6D4F;&#x89C8;&#x5668;&#x5747;&#x4F7F;&#x7528; document.body.scrollTop &#x83B7;&#x53D6;&#x9875;&#x9762;&#x7684;&#x5782;&#x76F4;&#x6EDA;&#x52A8;&#x6761;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x517C;&#x5BB9;&#x6027;&#x95EE;&#x9898;&#x3002;&#x800C;&#x5728;&#x6807;&#x51C6;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x7531;&#x4E8E; Chrome &#x4E0E; Safari &#x4ECD;&#x7136;&#x4F7F;&#x7528; document.body.scrollTop&#xFF0C;&#x800C;&#x5BF9;&#x4E8E; document.documentElement.scrollTop &#x8FD4;&#x56DE;&#x4E3A; 0&#x3002;</p>
</blockquote>

<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5BF9; Webkit &#x6765;&#x8BF4;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x6DF7;&#x6742;&#x6A21;&#x5F0F;&#x8FD8;&#x662F;&#x6807;&#x51C6;&#x6A21;&#x5F0F;&#xFF0C;&#x5B83;&#x90FD;&#x8BA4;&#x4E3A;&#x9875;&#x9762;&#x6EDA;&#x52A8;&#x5143;&#x7D20;&#x662F; <code>BODY</code>&#xFF1B;&#x800C;&#x5176;&#x5B83;&#x6D4F;&#x89C8;&#x5668;&#x53EA;&#x6709;&#x5728;&#x6DF7;&#x6742;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x624D;&#x4F1A;&#x8BA4;&#x4E3A;&#x9875;&#x9762;&#x6EDA;&#x52A8;&#x5143;&#x7D20;&#x662F; <code>BODY</code>&#xFF0C;&#x6807;&#x51C6;&#x6A21;&#x5F0F;&#x4E0B;&#x5219;&#x662F; <code>HTML</code>&#x3002;</p>
<p>&#x5404;&#x79CD; JS &#x5E93;&#x901A;&#x5E38;&#x90FD;&#x4F1A;&#x62B9;&#x5E73;&#x4E0D;&#x540C;&#x6D4F;&#x89C8;&#x5668;&#x53CA;&#x4E0D;&#x540C;&#x6A21;&#x5F0F;&#x4E0B;&#x7684;&#x8FD9;&#x4E9B;&#x5DEE;&#x5F02;&#xFF0C;&#x7EDF;&#x4E00;&#x63D0;&#x4F9B;&#x83B7;&#x53D6;&#x6216;&#x8BBE;&#x7F6E; scrollTop / scrollLeft &#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5F80;&#x5F80;&#x4E0D;&#x4F1A;&#x66B4;&#x9732;&#x51FA;&#x6765;&#x3002;&#x5177;&#x4F53;&#x7684;&#x517C;&#x5BB9;&#x65B9;&#x6848;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x7565;&#x8FC7;&#x4E0D;&#x63D0;&#x3002;&#x4F46;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x4E00;&#x70B9;&#xFF0C;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x4F7F;&#x7528; UA &#x68C0;&#x6D4B;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x9488;&#x5BF9; UA &#x5305;&#x542B; <code>webkit</code> &#x7684;&#x6D4F;&#x89C8;&#x5668;&#x7EDF;&#x4E00;&#x4F7F;&#x7528; document.body &#x90A3;&#x5C31;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x540E;&#x9762;&#x4F1A;&#x8BB2;&#x5230;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x6700;&#x8FD1;&#x6211;&#x53D1;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x8BE1;&#x5F02;&#x7684;&#x73B0;&#x8C61;&#xFF1A;&#x5728;&#x6211;&#x7684; Chrome &#x91CC;&#x9700;&#x8981;&#x901A;&#x8FC7; document.documentElement &#x5143;&#x7D20;&#x83B7;&#x53D6;&#x9875;&#x9762;&#x6EDA;&#x52A8;&#x6761;&#x4F4D;&#x7F6E;&#x3002;&#x539F;&#x672C;&#x6211;&#x4EE5;&#x4E3A;&#x662F; Chrome &#x4FEE;&#x6539;&#x4E86;&#x5B9E;&#x73B0;&#xFF0C;&#x4FDD;&#x6301;&#x8DDF;&#x6807;&#x51C6;&#x4E00;&#x81F4;&#xFF1B;&#x4F46;&#x5947;&#x602A;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x7684; Chrome Canary &#x8FD8;&#x662F;&#x8001;&#x6837;&#x5B50;&#xFF0C;&#x522B;&#x4EBA;&#x8DDF;&#x6211;&#x7248;&#x672C;&#x4E00;&#x81F4;&#x7684; Chrome &#x4E5F;&#x8FD8;&#x662F;&#x8001;&#x6837;&#x5B50;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5F7B;&#x5E95;&#x641E;&#x660E;&#x767D;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x5728; Chromium Bug &#x7CFB;&#x7EDF;&#x4E2D;&#x5F00;&#x59CB;&#x4E86;&#x641C;&#x7D22;&#x3002;&#x5F88;&#x5FEB;&#xFF0C;&#x6211;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x63CF;&#x8FF0;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684; <a href="https://bugs.chromium.org/p/chromium/issues/detail?id=157855">BUG &#x8BB0;&#x5F55;</a>&#x3002;&#x8FD9;&#x6761;&#x8BB0;&#x5F55;&#x6700;&#x540E;&#x56DE;&#x590D;&#x66F4;&#x65B0;&#x4E8E;&#x51E0;&#x5929;&#x524D;&#xFF0C;&#x8BF4;&#x53D7;&#x5176;&#x5B83;&#x95EE;&#x9898;&#x5F71;&#x54CD;&#xFF0C;&#x8FD9;&#x4E2A; BUG &#x867D;&#x7136;&#x5DF2;&#x7ECF;&#x4FEE;&#x590D;&#xFF0C;&#x4F46;&#x662F;&#x5E76;&#x6CA1;&#x6709;&#x63A8;&#x5230;&#x4E3B;&#x7248;&#x672C;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;Chromium &#x56E2;&#x961F;&#x53D1;&#x73B0;&#x6539;&#x4E3A;&#x6807;&#x51C6;&#x5B9E;&#x73B0;&#x540E;&#xFF0C;&#x4E00;&#x4E9B;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x6269;&#x5C55;&#x548C;&#x4E00;&#x4E9B;&#x5927;&#x7AD9;&#x4F1A;&#x53D7;&#x5F71;&#x54CD;&#xFF0C;&#x6240;&#x4EE5;&#x51B3;&#x5B9A;&#x5148;&#x653E;&#x4E00;&#x653E;&#x3002;</p>
<p>&#x770B;&#x6765;&#x5373;&#x4FBF;&#x662F;&#x6280;&#x672F;&#x6FC0;&#x8FDB;&#x7684; Google&#xFF0C;&#x4E5F;&#x4E0D;&#x5F97;&#x4E0D;&#x80CC;&#x8D1F;&#x4E00;&#x4E9B;&#x6C89;&#x91CD;&#x7684;&#x5386;&#x53F2;&#x5305;&#x88B1;&#x3002;&#x65E2;&#x7136;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x96BE;&#x9053;&#x6211;&#x7684; Chrome &#x5DF2;&#x7ECF;&#x7A7F;&#x8D8A;&#x5230;&#x4E86;&#x672A;&#x6765;&#xFF1F;&#x6211;&#x767E;&#x601D;&#x4E0D;&#x5F97;&#x5176;&#x89E3;&#x3002;</p>
<p>&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x8FC7;&#x4E86;&#x591A;&#x4E45;&#xFF0C;&#x6211;&#x7A81;&#x7136;&#x7075;&#x5149;&#x4E4D;&#x73B0;&#xFF0C;&#x60F3;&#x5230;&#x67D0;&#x6B21;&#x6211;&#x4E3A;&#x4E86;&#x6D4B;&#x8BD5;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x5F00;&#x542F;&#x4E86; <code>chrome://flags</code> &#x4E2D;&#x7684;&#x300C;Experimental Web Platform features&#xFF08;&#x5B9E;&#x9A8C;&#x6027;&#x7F51;&#x7EDC;&#x5E73;&#x53F0;&#x529F;&#x80FD;&#xFF09;&#x300D;&#x9009;&#x9879;&#xFF0C;&#x83AB;&#x975E;&#x662F;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;&#x3002;&#x679C;&#x7136;&#xFF0C;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x4ECE;&#x54EA;&#x4E2A;&#x7248;&#x672C;&#x5F00;&#x59CB;&#xFF0C;Chromium &#x5077;&#x5077;&#x4FEE;&#x590D;&#x4E86;&#x8FD9;&#x4E2A; BUG &#x2014;&#x2014; &#x53EA;&#x662F;&#x9ED8;&#x8BA4;&#x6CA1;&#x6709;&#x542F;&#x7528; &#x2014;&#x2014; &#x9664;&#x975E;&#x7528;&#x6237;&#x4E3B;&#x52A8;&#x6253;&#x5F00;&#x8FD9;&#x4E2A;&#x5B9E;&#x9A8C;&#x6027;&#x5F00;&#x5173;&#x3002;</p>
<p>&#x804A;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x987A;&#x4FBF;&#x518D;&#x8BF4;&#x8BF4; document.scrollingElement &#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x3002;&#x53EF;&#x80FD;&#x662F;&#x6D4F;&#x89C8;&#x5668;&#x5382;&#x5546;&#x4EEC;&#x4E5F;&#x89C9;&#x5F97;&#x73B0;&#x5728;&#x7684;&#x9875;&#x9762;&#x6EDA;&#x52A8;&#x5143;&#x7D20;&#x592A;&#x4E71;&#xFF0C;&#x4E00;&#x4F1A;&#x513F; BODY &#x4E00;&#x4F1A;&#x513F; HTML&#xFF0C;&#x8DDF;&#x9875;&#x9762;&#x6A21;&#x5F0F;&#x6709;&#x5173;&#xFF0C;&#x8FD8;&#x8DDF; Webkit &#x7684;&#x9057;&#x7559; BUG &#x6709;&#x5173;&#xFF0C;&#x4E8E;&#x662F;&#x641E;&#x51FA;&#x6765;&#x8FD9;&#x4E48;&#x4E2A;&#x4E1C;&#x897F;&#x3002;&#x6839;&#x636E; MDN &#x7684;&#x4ECB;&#x7ECD;&#xFF1A;</p>
<blockquote>
<p>Document &#x7684; scrollingElement &#x662F;&#x4E00;&#x4E2A;&#x53EA;&#x8BFB;&#x5C5E;&#x6027;&#xFF0C;&#x59CB;&#x7EC8;&#x6307;&#x5411;&#x9875;&#x9762;&#x6EDA;&#x52A8;&#x5143;&#x7D20;&#x3002;<a href="https://developer.mozilla.org/en/docs/Web/API/document/scrollingElement">via</a></p>
</blockquote>
<p>&#x8FD9;&#x6837;&#x5012;&#x4E5F;&#x65B9;&#x4FBF;&#xFF0C;&#x53EA;&#x662F;&#x76EE;&#x524D;&#x5B83;&#x7684;&#x652F;&#x6301;&#x5EA6;&#x8FD8;&#x5F88;&#x5DEE;&#xFF0C;&#x9700;&#x8981;&#x7248;&#x672C;&#x6BD4;&#x8F83;&#x9AD8;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#xFF1A;</p>
<ul>
<li>Chrome 44+&#xFF08;PC&#x3001;Mobile&#xFF09;&#xFF1B;</li>
<li>Safari 9+&#xFF08;PC&#x3001;Mobile&#xFF09;&#xFF1B;</li>
<li>Firefox 47+&#xFF08;PC&#x3001;Mobile&#xFF09;&#xFF1B;</li>
</ul>
<p>Chrome &#x5728;&#x5411;&#x6807;&#x51C6;&#x9760;&#x62E2;&#x4E4B;&#x524D;&#x5C31;&#x652F;&#x6301;&#x4E86;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x4EF6;&#x597D;&#x4E8B;&#x3002;&#x81F3;&#x5C11;&#xFF0C;&#x5728;&#x53EA;&#x9700;&#x8981;&#x652F;&#x6301; Webkit &#x7684;&#x573A;&#x5408;&#xFF0C;&#x8FD9;&#x6837;&#x83B7;&#x53D6;&#x9875;&#x9762;&#x6EDA;&#x52A8;&#x5143;&#x7D20;&#x5C31;&#x6CA1;&#x95EE;&#x9898;&#x4E86;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> rootElement = <span class="hljs-built_in">document</span>.scrollingElement || docuemnt.body;
</code></pre>
<p>&#x6700;&#x540E;&#xFF0C;&#x4EE5;&#x7B80;&#x5355;&#x5C0F;&#x7ED3;&#x6765;&#x7ED3;&#x675F;&#x672C;&#x6587;&#xFF1A;1&#xFF09;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x6709;&#x4E00;&#x4E9B;&#x8DDF;&#x522B;&#x4EBA;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x5982;&#x679C;&#x7248;&#x672C;&#x76F8;&#x540C;&#xFF0C;&#x90A3;&#x4E48;&#x5F88;&#x53EF;&#x80FD;&#x662F;&#x53D7;&#x5230;&#x67D0;&#x4E9B;&#x914D;&#x7F6E;&#x9879;&#x7684;&#x5F71;&#x54CD;&#xFF1B;2&#xFF09;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;Blink&#xFF08;Chrome&#xFF09;&#x548C; Webkit&#xFF08;Safari&#xFF09;&#x7684;&#x5DEE;&#x8DDD;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x5E73;&#x65F6;&#x53EF;&#x4EE5;&#x591A;&#x5173;&#x6CE8;&#x4E0B;&#x6D4F;&#x89C8;&#x5668;&#x5382;&#x5546;&#x7684;&#x5347;&#x7EA7;&#x516C;&#x544A;&#x548C;&#x65B0;&#x7684; WEB &#x6807;&#x51C6;&#x3002;</p>
<p>&#x6269;&#x5C55;&#x9605;&#x8BFB;&#xFF1A;<a href="https://dev.opera.com/articles/fixing-the-scrolltop-bug/">Dev.Opera Blog : Fixing the scrollTop bug</a>&#x3002;</p>
<p>&#x672C;&#x6587;&#x94FE;&#x63A5;&#xFF1A;<a href="https://imququ.com/post/document-scrollingelement-in-chrome.html">https://imququ.com/post/document-scrollingelement-in-chrome.html</a>&#xFF0C;<a href="https://imququ.com/post/document-scrollingelement-in-chrome.html#comments" target="_blank">&#x53C2;&#x4E0E;&#x8BA8;&#x8BBA;</a></p><p>&#x2665; &#x672C;&#x7AD9;&#x6240;&#x6709;&#x6587;&#x7AE0;&#x5747;&#x4E3A;&#x672C;&#x4EBA;&#x539F;&#x521B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8BA4;&#x4E3A;&#x6211;&#x7684;&#x6587;&#x7AE0;&#x5BF9;&#x4F60;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x6B22;&#x8FCE;&#x8D5E;&#x52A9;&#x672C;&#x7AD9;&#x3002;<a target="_blank" href="https://imququ.com/post/about.html#toc-2">&#x8BE6;&#x60C5;&#x8BF7;&#x70B9;&#x8FD9;&#x91CC; &#xBB;</a></p></div>
</div>

</body>
</html>