<!DOCTYPE html>
<html>
<head>
  
  <title>&#x79FB;&#x52A8; WEB &#x901A;&#x7528;&#x4F18;&#x5316;&#x7B56;&#x7565;&#x4ECB;&#x7ECD;&#xFF08;&#x4E00;&#xFF09;</title>
  
</head>
<body>

<div id="wrap">
  <h1>&#x79FB;&#x52A8; WEB &#x901A;&#x7528;&#x4F18;&#x5316;&#x7B56;&#x7565;&#x4ECB;&#x7ECD;&#xFF08;&#x4E00;&#xFF09;</h1>
  <div id="content"><p>&#x5728;&#x6211;&#x53BB;&#x5E74;&#x7684;&#x300A;<a href="https://imququ.com/post/amp-project.html">AMP&#xFF0C;&#x6765;&#x81EA; Google &#x7684;&#x79FB;&#x52A8;&#x9875;&#x9762;&#x4F18;&#x5316;&#x65B9;&#x6848;</a>&#x300B;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x91CC;&#xFF0C;&#x6211;&#x7ED9;&#x81EA;&#x5DF1;&#x6316;&#x4E86;&#x4E2A;&#x5751;&#xFF1A;</p>
<blockquote>
<p>&#x501F;&#x52A9;&#x5BA2;&#x6237;&#x7AEF;&#x6240;&#x505A;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x5982;&#x73B0;&#x5728;&#x5E7F;&#x4E3A;&#x6D41;&#x884C;&#x7684;&#x79FB;&#x52A8;&#x7AEF; Webview &#x5BB9;&#x5668;&#x52A0;&#x901F;&#x65B9;&#x6848;&#xFF0C;&#x4F18;&#x5316;&#x6548;&#x679C;&#x5C40;&#x9650;&#x5728;&#x6307;&#x5B9A; APP &#x5185;&#xFF0C;&#x751A;&#x81F3;&#x8FD8;&#x4F1A;&#x5BFC;&#x81F4;&#x4F7F;&#x7528;&#x901A;&#x7528;&#x6D4F;&#x89C8;&#x5668;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x66F4;&#x6162;&#xFF08;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x5F88;&#x6709;&#x610F;&#x601D;&#xFF0C;&#x6709;&#x673A;&#x4F1A;&#x4EE5;&#x540E;&#x518D;&#x8BA8;&#x8BBA;&#xFF09;&#x3002;</p>
</blockquote>
<p>&#x73B0;&#x5728;&#x8FC7;&#x53BB;&#x5FEB;&#x534A;&#x5E74;&#xFF0C;&#x6211;&#x7EC8;&#x4E8E;&#x60F3;&#x8D77;&#x6765;&#x628A;&#x8FD9;&#x4E2A;&#x5751;&#x586B;&#x4E0A;&#xFF0C;&#x4ECA;&#x5929;&#x5148;&#x6765;&#x5199;&#x8FD9;&#x4E2A;&#x7CFB;&#x5217;&#x7B2C;&#x4E00;&#x7BC7;&#x3002;</p>
<p>&#x6211;&#x5728;&#x6807;&#x9898;&#x91CC;&#x7528;&#x4E86;&#x300C;&#x901A;&#x7528;&#x300D;&#x4E8C;&#x5B57;&#xFF0C;&#x8BF4;&#x660E;&#x6211;&#x8981;&#x4ECB;&#x7ECD;&#x7684;&#x4F18;&#x5316;&#x7B56;&#x7565;&#x4E0D;&#x662F;&#x4E3A;&#x7279;&#x5B9A;&#x7684; Webview &#x5BB9;&#x5668;&#x5B9A;&#x5236;&#xFF0C;&#x5B83;&#x9762;&#x5411;&#x7684;&#x662F;&#x6240;&#x6709;&#x4E3B;&#x6D41;&#x7684;&#x79FB;&#x52A8;&#x7AEF;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x5305;&#x62EC;&#x5404;&#x79CD; APP &#x5D4C;&#x5165;&#x7684;&#x901A;&#x7528; Webview&#x3002;</p>
<p>&#x501F;&#x52A9;&#x5B9A;&#x5236;&#x5316;&#x7684; Webview &#x5BB9;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E3B;&#x52A8;&#x63D0;&#x524D;&#x672C;&#x5730;&#x5316;&#x8D44;&#x6E90;&#x5305;&#xFF0C;&#x4F7F;&#x5F97;&#x79FB;&#x52A8; WEB &#x5E94;&#x7528;&#x8DDF; Native &#x5E94;&#x7528;&#x4E00;&#x6837;&#xFF0C;&#x53EA;&#x9700;&#x8D70;&#x7F51;&#x7EDC;&#x83B7;&#x53D6;&#x5FC5;&#x8981;&#x7684;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x6027;&#x80FD;&#x4F18;&#x5316;&#xFF0C;&#x66F4;&#x591A;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x6548;&#x7387;&#xFF0C;&#x672C;&#x5730;&#x5316;&#x8D44;&#x6E90;&#x5305;&#x7684;&#x63A8;&#x9001;&#x6D41;&#x7A0B;&#x548C;&#x6210;&#x529F;&#x7387;&#x3002;</p>
<p>&#x800C;&#x5BF9;&#x4E8E;&#x901A;&#x7528;&#x7684;&#x79FB;&#x52A8; WEB &#x6027;&#x80FD;&#x4F18;&#x5316;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x8003;&#x8651;&#x7684;&#x662F;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x6027;&#x80FD;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x83B7;&#x53D6;&#x4E00;&#x4E2A;&#x8D44;&#x6E90;&#xFF0C;&#x82B1;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x5F00;&#x9500;&#x81F3;&#x5C11;&#x6709;&#x8FD9;&#x51E0;&#x5757;&#xFF1A;DNS &#x89E3;&#x6790;&#x3001;&#x5EFA;&#x7ACB; TCP &#x8FDE;&#x63A5;&#x3001;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x3001;&#x7B49;&#x5F85;&#x54CD;&#x5E94;&#x3001;&#x4F20;&#x8F93;&#x54CD;&#x5E94;&#x6B63;&#x6587;&#x3002;&#x76F8;&#x6BD4; PC &#x7684;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#xFF0C;&#x79FB;&#x52A8;&#x7AEF;&#x66F4;&#x4E3A;&#x7CDF;&#x7CD5;&#xFF0C;&#x96C6;&#x4E2D;&#x5728;&#x8FD9;&#x51E0;&#x70B9;&#xFF1A;&#x9AD8;&#x65F6;&#x5EF6;&#x3001;&#x9AD8;&#x4E22;&#x5305;&#x3001;&#x4F4E;&#x901F;&#x7387;&#x3001;&#x591A;&#x52AB;&#x6301;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x79FB;&#x52A8; WEB &#x4E0A;&#xFF0C;&#x5F15;&#x5165;&#x5916;&#x94FE;&#x8D44;&#x6E90;&#x7684;&#x7F51;&#x7EDC;&#x6210;&#x672C;&#x975E;&#x5E38;&#x9AD8;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x6700;&#x8FD1;&#x7684;&#x4E00;&#x6B21;&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;&#x79FB;&#x52A8;&#x7AEF;&#x540C;&#x57DF;&#x540D;&#x7A7A;&#x56FE;&#x7247;&#xFF08;&#x4F7F;&#x7528; Nginx &#x7684; <code>empty_gif</code> &#x6307;&#x4EE4;&#x6784;&#x9020;&#xFF09;&#x52A0;&#x8F7D;&#x5931;&#x8D25;&#x7387;&#xFF08;&#x6211;&#x4EEC;&#x5BF9;&#x5931;&#x8D25;&#x7684;&#x5B9A;&#x4E49;&#x662F;&#x89E6;&#x53D1;&#x56FE;&#x7247;&#x7684; <code>error</code> &#x4E8B;&#x4EF6;&#xFF0C;&#x6216;&#x8005;&#x8D85;&#x8FC7; 9s &#x4ECD;&#x672A;&#x89E6;&#x53D1; <code>load</code> &#x4E8B;&#x4EF6;&#xFF09;&#x9AD8;&#x8FBE; 2%&#xFF0C;&#x5916;&#x57DF;&#x56FE;&#x7247;&#x5931;&#x8D25;&#x7387;&#x8FD8;&#x8981;&#x9AD8;&#x4E0A;&#x51E0;&#x4E2A;&#x767E;&#x5206;&#x70B9;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x8FD8;&#x77E5;&#x9053;&#xFF0C;&#x5934;&#x90E8;&#x7684;&#x5916;&#x94FE; CSS&#x3001;JS &#x4F1A;&#x963B;&#x585E;&#x9875;&#x9762;&#x6E32;&#x67D3;&#xFF0C;&#x901A;&#x4FD7;&#x6765;&#x8BB2;&#x5C31;&#x662F;&#x5934;&#x90E8;&#x7684;&#x8FD9;&#x4E9B;&#x5916;&#x94FE;&#x8D44;&#x6E90;&#x52A0;&#x8F7D;&#x5B8C;&#x4E4B;&#x524D;&#xFF0C;&#x9875;&#x9762;&#x4F1A;&#x4E00;&#x76F4;&#x767D;&#x5C4F;&#x3002;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x7EDF;&#x8BA1;&#x8FC7;&#xFF0C;&#x4E00;&#x4E2A; GZip &#x540E;&#x5341;&#x51E0; KB &#x7684;&#x5934;&#x90E8; JS&#xFF0C;&#x4F1A;&#x589E;&#x52A0;&#x5927;&#x6982;&#x534A;&#x79D2;&#x7684;&#x767D;&#x5C4F;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x57FA;&#x4E8E;&#x4E0A;&#x8FF0;&#x539F;&#x56E0;&#xFF0C;&#x6211;&#x7684;&#x79FB;&#x52A8; WEB &#x901A;&#x7528;&#x4F18;&#x5316;&#x7B56;&#x7565;&#x7B2C;&#x4E00;&#x8981;&#x70B9;&#xFF1A;</p>
<blockquote>
<p>&#x91CD;&#x8981;&#x7684; CSS&#x3001;JS &#x76F4;&#x63A5;&#x5185;&#x8054;&#x5728; HTML &#x4E2D;&#xFF0C;&#x5934;&#x90E8;&#x7981;&#x6B62;&#x51FA;&#x73B0;&#x4EFB;&#x4F55;&#x5916;&#x94FE;&#x8D44;&#x6E90;&#x3002;</p>
</blockquote>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5F88;&#x591A;&#x6027;&#x80FD;&#x8BC4;&#x4F30;&#x5DE5;&#x5177; / &#x6587;&#x6863;&#x90FD;&#x8BF4; HTML &#x5934;&#x90E8;&#x4E0D;&#x8981;&#x6709;&#x4EFB;&#x4F55; JS&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x4E00;&#x70B9;&#x5728;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#x4E2D;&#x5F88;&#x96BE;&#x505A;&#x5230;&#xFF0C;&#x81F3;&#x5C11;&#x5927;&#x90E8;&#x5206;&#x9875;&#x9762;&#x6027;&#x80FD;&#x76D1;&#x63A7;&#x5C31;&#x9700;&#x8981;&#x5728;&#x5934;&#x90E8;&#x8BA1;&#x65F6;&#xFF08;Web Performance API &#x5E76;&#x4E0D;&#x80FD;&#x89E3;&#x51B3;&#x6240;&#x6709;&#x6027;&#x80FD;&#x76D1;&#x63A7;&#x95EE;&#x9898;&#xFF09;&#x3002;&#x5BF9;&#x4E8E;&#x5934;&#x90E8;&#x5185;&#x8054; JS&#xFF0C;&#x6211;&#x53EA;&#x6709;&#x4E24;&#x70B9;&#x8981;&#x6C42;&#xFF1A;1&#xFF09;&#x6CA1;&#x6709;&#x8017;&#x65F6;&#x64CD;&#x4F5C;&#xFF1B;2&#xFF09;&#x53EA;&#x4FDD;&#x7559;&#x5FC5;&#x8981;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x5F88;&#x591A; WEB &#x5E94;&#x7528;&#xFF0C;&#x5C24;&#x5176;&#x662F; SPA&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x5F80;&#x5F80;&#x90FD;&#x53EA;&#x63D0;&#x4F9B; RESTful &#x6570;&#x636E;&#x63A5;&#x53E3;&#x3002;&#x8FD9;&#x6837;&#x9875;&#x9762; JS &#x4EE3;&#x7801;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8FD8;&#x8981;&#x5F02;&#x6B65;&#x83B7;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x52A0;&#x8F7D;&#x5B8C;&#x6210;&#x4E4B;&#x524D;&#xFF0C;&#x9875;&#x9762;&#x4E00;&#x7247;&#x7A7A;&#x767D;&#x6216;&#x8005;&#x53EA;&#x6709; Loading&#x3002;&#x8FD9;&#x4E48;&#x505A;&#x4E5F;&#x8FDD;&#x80CC;&#x4E86;&#x6211;&#x63D0;&#x51FA;&#x7684;&#x7B2C;&#x4E00;&#x8981;&#x70B9;&#xFF0C;&#x8981;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6700;&#x7B80;&#x5355;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x670D;&#x52A1;&#x7AEF;&#x76F4;&#x63A5;&#x5C06;&#x9996;&#x5C4F;&#x6570;&#x636E;&#x4EE5; JSON &#x53D8;&#x91CF;&#x7684;&#x5F62;&#x5F0F;&#x8F93;&#x51FA;&#x5230;&#x9875;&#x9762;&#x4E0A;&#xFF1B;&#x9AD8;&#x7EA7;&#x70B9;&#x7684;&#x65B9;&#x6848;&#x662F;&#x5229;&#x7528; JavaScript &#x540C;&#x6784;&#x6846;&#x67B6;&#xFF0C;&#x9996;&#x5C4F;&#x76F4;&#x63A5;&#x8F93;&#x51FA; HTML&#x3002;</p>
<p>&#x5C06;&#x91CD;&#x8981; CSS&#x3001;JS &#x751A;&#x81F3;&#x6570;&#x636E;&#x63A5;&#x53E3;&#x90FD;&#x5185;&#x8054;&#x5728;&#x9875;&#x9762;&#x4E0A;&#xFF0C;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x7531;&#x4E8E;&#x79FB;&#x52A8;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x9020;&#x6210;&#x7684;&#x9875;&#x9762;&#x5448;&#x73B0;&#x6162;&#x6216;&#x8005;&#x4E0D;&#x53EF;&#x7528;&#x7B49;&#x60C5;&#x51B5;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x5E26;&#x6765;&#x53E6;&#x5916;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x591A;&#x6B21;&#x8BF7;&#x6C42;&#x4E4B;&#x95F4;&#x65E0;&#x6CD5;&#x5229;&#x7528;&#x7F13;&#x5B58;&#xFF0C;&#x6D6A;&#x8D39;&#x6D41;&#x91CF;&#xFF0C;&#x4E5F;&#x8BA9;&#x79FB;&#x52A8;&#x7F51;&#x7EDC;&#x4F4E;&#x901F;&#x7387;&#x7684;&#x95EE;&#x9898;&#x96EA;&#x4E0A;&#x52A0;&#x971C;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x805A;&#x7126;&#xFF0C;&#x672C;&#x6587;&#x4E0D;&#x8BA8;&#x8BBA;&#x4EE3;&#x7801;&#x538B;&#x7F29;&#x3001;&#x4F20;&#x8F93;&#x538B;&#x7F29;&#x4EE5;&#x53CA;&#x6E05;&#x7406;&#x65E0;&#x7528;&#x4EE3;&#x7801;&#x7B49;&#x51CF;&#x5C11;&#x6587;&#x4EF6;&#x4F53;&#x79EF;&#x7684;&#x57FA;&#x7840;&#x4F18;&#x5316;&#x9879;&#x76EE;&#x3002;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x8981;&#x52A0;&#x8F7D;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x5FC5;&#x987B;&#x7684;&#x4E14;&#x538B;&#x7F29;&#x8FC7;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x5BF9;&#x4E8E;&#x7528;&#x6237;&#x9996;&#x6B21;&#x8BBF;&#x95EE;&#xFF0C;&#x5185;&#x8054;&#x65E0;&#x7591;&#x662F;&#x6700;&#x4F18;&#x9009;&#x62E9;&#xFF0C;&#x56E0;&#x4E3A;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x90FD;&#x8981;&#x52A0;&#x8F7D;&#xFF0C;&#x80FD;&#x51CF;&#x5C11;&#x8FDE;&#x63A5;&#x6570;&#x5C31;&#x662F;&#x6700;&#x5927;&#x7684;&#x6539;&#x8FDB;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x7528;&#x6237;&#x540E;&#x7EED;&#x8BBF;&#x95EE;&#xFF0C;&#x5185;&#x8054;&#x5BFC;&#x81F4;&#x7684;&#x65E0;&#x6CD5;&#x5229;&#x7528; HTTP &#x7F13;&#x5B58;&#x673A;&#x5236;&#x7684;&#x95EE;&#x9898;&#x5462;&#xFF1F;</p>
<p>&#x6211;&#x4EEC;&#x5F15;&#x5165;&#x4E86; localStorage &#x65B9;&#x6848;&#xFF1A;&#x7528;&#x6237;&#x9996;&#x6B21;&#x8BBF;&#x95EE;&#x65F6;&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x8F93;&#x51FA;&#x5305;&#x542B;&#x5185;&#x8054; CSS&#x3001;JS &#x548C; JSON &#x6570;&#x636E;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x5E76;&#x901A;&#x8FC7; JS &#x5C06;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x5B58;&#x5165; localStorage&#xFF1B;&#x7528;&#x6237;&#x540E;&#x7EED;&#x8BBF;&#x95EE;&#x65F6;&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x53EA;&#x9700;&#x8981;&#x8F93;&#x51FA;&#x4ECE; localStorage &#x8BFB;&#x53D6;&#x5E76;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x7684; JS &#x7247;&#x6BB5;&#x5373;&#x53EF;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x540E;&#x7EED;&#x8BBF;&#x95EE;&#x7684;&#x9875;&#x9762;&#x4F53;&#x79EF;&#x5C31;&#x5C0F;&#x5F88;&#x591A;&#x4E86;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x7684;&#x96BE;&#x70B9;&#x5728;&#x4E8E;&#xFF1A;1&#xFF09;&#x670D;&#x52A1;&#x7AEF;&#x5982;&#x4F55;&#x5F97;&#x77E5;&#x7528;&#x6237;&#x672C;&#x5730;&#x5B58;&#x6709; localStorage&#xFF1B;2&#xFF09;&#x670D;&#x52A1;&#x7AEF;&#x5982;&#x4F55;&#x5F97;&#x77E5;&#x7528;&#x6237;&#x672C;&#x5730;&#x5B58;&#x7684; localStorage &#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x5177;&#x4F53;&#x6587;&#x4EF6;&#x7684;&#x7248;&#x672C;&#x662F;&#x5426;&#x6700;&#x65B0;&#x3002;&#x6709;&#x540C;&#x5B66;&#x4F1A;&#x8BF4;&#xFF0C;&#x628A;&#x5B58;&#x5165; localStorage &#x7684;&#x6587;&#x4EF6;&#x53CA;&#x5BF9;&#x5E94;&#x7248;&#x672C;&#x90FD;&#x8BB0;&#x5728; Cookie &#x91CC;&#x4E0D;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF1F;&#x4F46;&#x522B;&#x5FD8;&#x4E86;&#x5F80; Cookie &#x91CC;&#x5B58;&#x592A;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x9519;&#x8BEF;&#x7684;&#x505A;&#x6CD5;&#x3002;&#x51B5;&#x4E14;&#xFF0C;&#x5982;&#x679C; Cookie &#x4FE1;&#x606F;&#x5B8C;&#x597D;&#xFF0C;&#x4F46; localStorage &#x5374;&#x88AB;&#x6E05;&#x9664;&#x8981;&#x600E;&#x4E48;&#x5904;&#x7406;&#xFF1F;</p>
<p>&#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x8BBE;&#x8BA1;&#x4E86;&#x4E00;&#x6574;&#x5957;&#x6D41;&#x7A0B;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x5F15;&#x5165;&#x4E86;&#x7531;&#x4EE5;&#x4E0B;&#x5B57;&#x7B26;&#x7EC4;&#x6210;&#x7684; 70 &#x8FDB;&#x5236;&#xFF1A;</p>
<pre><code>0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz~!()*_-.
</code></pre><p>&#x5B83;&#x4EEC;&#x4F1A;&#x88AB;&#x7528;&#x6765;&#x5728; Cookie &#x4E2D;&#x5B58;&#x653E;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#x53CA;&#x7248;&#x672C;&#x53F7;&#xFF0C;70 &#x8FDB;&#x5236;&#x610F;&#x5473;&#x7740;&#x53EF;&#x4EE5;&#x7528;&#x5355;&#x5B57;&#x7B26;&#x533A;&#x5206; 70 &#x79CD;&#x4E0D;&#x540C;&#x7684;&#x6587;&#x4EF6;&#x6216;&#x7248;&#x672C;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x8FD9; 70 &#x4E2A;&#x5B57;&#x7B26;&#x90FD;&#x65E0;&#x9700;&#x7F16;&#x7801;&#x5373;&#x53EF;&#x5B58;&#x5165; Cookie&#x3002;</p>
<p>&#x7136;&#x540E;&#xFF0C;&#x5728;&#x7F16;&#x8BD1;&#x6D41;&#x7A0B;&#x4E2D;&#xFF0C;&#x5BF9;&#x5168;&#x7AD9;&#x4EE3;&#x7801;&#x91CC;&#x6240;&#x6709;&#x9700;&#x8981;&#x5B58;&#x5165; localStorage &#x7684;&#x8D44;&#x6E90;&#xFF08;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x5916;&#x94FE;&#x6807;&#x7B7E;&#x662F;&#x5426;&#x5B58;&#x5728;&#x67D0;&#x4E2A;&#x81EA;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;&#x6765;&#x5224;&#x65AD;&#xFF09;&#x8FDB;&#x884C;&#x5206;&#x6790;&#xFF0C;&#x751F;&#x6210;&#x6587;&#x4EF6;&#x540D;&#x53CA;&#x5BF9;&#x5E94;&#x7248;&#x672C;&#x53F7;&#x7684; Map &#x6587;&#x4EF6;&#x3002;&#x793A;&#x610F;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-js">{
    <span class="hljs-string">&apos;file/path/to/js/1.js&apos;</span> : { filename : <span class="hljs-string">&apos;0&apos;</span>, version : <span class="hljs-string">&apos;0&apos;</span>, md5 : <span class="hljs-string">&apos;&#x200D;xxx&apos;</span>},
    <span class="hljs-string">&apos;file/path/to/js/2.js&apos;</span> : { filename : <span class="hljs-string">&apos;1&apos;</span>, version : <span class="hljs-string">&apos;0&apos;</span>, md5 : <span class="hljs-string">&apos;yyy&apos;</span>},
    <span class="hljs-string">&apos;file/path/to/css/1.css&apos;</span> : { filename : <span class="hljs-string">&apos;2&apos;</span>, version : <span class="hljs-string">&apos;0&apos;</span>, md5 : <span class="hljs-string">&apos;zzz&apos;</span>},
}
</code></pre>
<p>&#x8FD9;&#x4EFD;&#x914D;&#x7F6E;&#x6BCF;&#x6B21;&#x7F16;&#x8BD1;&#x90FD;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x6784;&#x5EFA;&#xFF0C;&#x4F46;&#x6709;&#x4E24;&#x70B9;&#x9700;&#x8981;&#x4FDD;&#x8BC1;&#xFF1A;1&#xFF09;&#x76F8;&#x540C;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#x5BF9;&#x5E94;&#x7684; 70 &#x8FDB;&#x5236;&#x5B57;&#x7B26;&#x6807;&#x8BB0;&#x5FC5;&#x987B;&#x56FA;&#x5B9A;&#xFF1B;2&#xFF09;&#x6587;&#x4EF6;&#x5185;&#x5BB9; md5 &#x53D1;&#x751F;&#x53D8;&#x5316;&#x65F6;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x7248;&#x672C;&#x53F7;&#x9700;&#x8981; +1&#x3002;&#x6BCF;&#x4E2A;&#x4F7F;&#x7528;&#x5230;&#x672C;&#x65B9;&#x6848;&#x7684;&#x9875;&#x9762;&#x5934;&#x90E8;&#x90FD;&#x9700;&#x8981;&#x5305;&#x542B;&#x8FD9;&#x4EFD;&#x914D;&#x7F6E;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5BF9;&#x4E8E;&#x4E0B;&#x9762;&#x8FD9;&#x6837;&#x7684;&#x539F;&#x59CB; HTML &#x4EE3;&#x7801;&#x7247;&#x6BB5;&#xFF1A;</p>
<pre><code class="lang-xml"><span class="hljs-tag">&lt;<span class="hljs-title">link</span> <span class="hljs-attribute">rel</span>=<span class="hljs-value">&quot;stylesheet&quot;</span> <span class="hljs-attribute">href</span>=<span class="hljs-value">&quot;file/path/to/css/1.css&quot;</span> <span class="hljs-attribute">lsname</span>=<span class="hljs-value">&quot;css_1&quot;</span> /&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-title">script</span> <span class="hljs-attribute">src</span>=<span class="hljs-value">&quot;file/path/to/js/1.js&quot;</span> <span class="hljs-attribute">lsname</span>=<span class="hljs-value">&quot;js_1&quot;</span>&gt;</span><span class="undefined"></span><span class="hljs-tag">&lt;/<span class="hljs-title">script</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-title">script</span> <span class="hljs-attribute">src</span>=<span class="hljs-value">&quot;file/path/to/js/2.js&quot;</span> <span class="hljs-attribute">lsname</span>=<span class="hljs-value">&quot;js_2&quot;</span>&gt;</span><span class="undefined"></span><span class="hljs-tag">&lt;/<span class="hljs-title">script</span>&gt;</span>
</code></pre>
<p>&#x7528;&#x6237;&#x9996;&#x6B21;&#x8BBF;&#x95EE;&#x65F6;&#xFF0C;&#x5C06;&#x4EE5;&#x8FD9;&#x6837;&#x7684;&#x5F62;&#x5F0F;&#x8F93;&#x51FA;&#xFF1A;</p>
<pre><code class="lang-xml"><span class="hljs-tag">&lt;<span class="hljs-title">style</span> <span class="hljs-attribute">id</span>=<span class="hljs-value">&quot;css_1&quot;</span>&gt;</span><span class="css">&#x200D;&#x200D;<span class="hljs-comment">/* the content of 1.css... */</span></span><span class="hljs-tag">&lt;/<span class="hljs-title">style</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-title">script</span>&gt;</span><span class="actionscript">LS.html2ls(<span class="hljs-string">&quot;css_1&quot;</span>);LS.updateVersion(<span class="hljs-string">&apos;cookie_name&apos;</span>,<span class="hljs-string">&apos;0&apos;</span>,<span class="hljs-string">&apos;0&apos;</span>)</span><span class="hljs-tag">&lt;/<span class="hljs-title">script</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-title">script</span> <span class="hljs-attribute">id</span>=<span class="hljs-value">&quot;js_1&quot;</span>&gt;</span><span class="actionscript">&#x200D;&#x200D;<span class="hljs-comment">/* the content of 1.js... */</span></span><span class="hljs-tag">&lt;/<span class="hljs-title">script</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-title">script</span>&gt;</span><span class="actionscript">LS.html2ls(<span class="hljs-string">&quot;js_1&quot;</span>);LS.updateVersion(<span class="hljs-string">&apos;cookie_name&apos;</span>,<span class="hljs-string">&apos;1&apos;</span>,<span class="hljs-string">&apos;0&apos;</span>)</span><span class="hljs-tag">&lt;/<span class="hljs-title">script</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-title">script</span> <span class="hljs-attribute">id</span>=<span class="hljs-value">&quot;js_2&quot;</span>&gt;</span><span class="actionscript">&#x200D;&#x200D;<span class="hljs-comment">/* the content of 2.js... */</span></span><span class="hljs-tag">&lt;/<span class="hljs-title">script</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-title">script</span>&gt;</span><span class="actionscript">LS.html2ls(<span class="hljs-string">&quot;js_2&quot;</span>);LS.updateVersion(<span class="hljs-string">&apos;cookie_name&apos;</span>,<span class="hljs-string">&apos;2&apos;</span>,<span class="hljs-string">&apos;0&apos;</span>)</span><span class="hljs-tag">&lt;/<span class="hljs-title">script</span>&gt;</span>
</code></pre>
<p>&#x8FD9;&#x65F6;&#xFF0C;&#x7528;&#x6237;&#x672C;&#x5730;&#x5C06;&#x4F1A;&#x65B0;&#x589E; <code>css_1</code>&#x3001;<code>js_1</code>&#x3001;<code>js_2</code> &#x4E09;&#x4EFD; localStorage &#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x53CA;&#x53D6;&#x503C;&#x4E3A; <code>001020</code> &#x7684;&#x4E00;&#x4E2A; Cookie&#x3002;</p>
<p>&#x7528;&#x6237;&#x518D;&#x6B21;&#x8BBF;&#x95EE;&#x65F6;&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x4F1A;&#x5206;&#x6790; Cookie&#xFF0C;&#x627E;&#x51FA;&#x5BF9;&#x5E94;&#x6587;&#x4EF6;&#x5728; Map &#x914D;&#x7F6E;&#x4E2D;&#x7684;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x4E0E; Cookie &#x4E2D;&#x7684;&#x7248;&#x672C;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x5982;&#x679C;&#x90FD;&#x6CA1;&#x6709;&#x53D8;&#x5316;&#xFF0C;&#x5219;&#x53EA;&#x4F1A;&#x8F93;&#x51FA;&#x8FD9;&#x6837;&#x5C11;&#x91CF;&#x7684;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-xml"><span class="hljs-tag">&lt;<span class="hljs-title">script</span>&gt;</span><span class="stylus">LS.<span class="hljs-function"><span class="hljs-title">ls2html</span><span class="hljs-params">(<span class="hljs-string">&quot;css_1&quot;</span>,<span class="hljs-string">&quot;style&quot;</span>,<span class="hljs-string">&quot;cookie_name&quot;</span>)</span></span></span><span class="hljs-tag">&lt;/<span class="hljs-title">script</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-title">script</span>&gt;</span><span class="stylus">LS.<span class="hljs-function"><span class="hljs-title">ls2html</span><span class="hljs-params">(<span class="hljs-string">&quot;js_1&quot;</span>,<span class="hljs-string">&quot;script&quot;</span>,<span class="hljs-string">&quot;cookie_name&quot;</span>)</span></span></span><span class="hljs-tag">&lt;/<span class="hljs-title">script</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-title">script</span>&gt;</span><span class="stylus">LS.<span class="hljs-function"><span class="hljs-title">ls2html</span><span class="hljs-params">(<span class="hljs-string">&quot;js_2&quot;</span>,<span class="hljs-string">&quot;script&quot;</span>,<span class="hljs-string">&quot;cookie_name&quot;</span>)</span></span></span><span class="hljs-tag">&lt;/<span class="hljs-title">script</span>&gt;</span>
</code></pre>
<p>&#x8FD9;&#x6837;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x5C31;&#x4F1A;&#x4ECE; localStorage &#x4E2D;&#x53D6;&#x51FA;&#x4E4B;&#x524D;&#x5B58;&#x50A8;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x521B;&#x5EFA;&#x76F8;&#x5E94;&#x7684;&#x6807;&#x7B7E;&#x5E76;&#x6267;&#x884C;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E4B;&#x524D;&#x7684;&#x8D44;&#x6E90;&#x6709;&#x6539;&#x52A8;&#xFF0C;&#x7F16;&#x8BD1;&#x540E; Map &#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5C31;&#x4F1A;&#x66F4;&#x65B0;&#x3002;&#x5047;&#x8BBE; <code>js_1</code> &#x5DF2;&#x7ECF;&#x8FED;&#x4EE3;&#x5230;&#x7248;&#x672C; <code>3</code>&#xFF0C;&#x90A3;&#x4E48;&#x670D;&#x52A1;&#x7AEF;&#x4F1A;&#x8F93;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-xml"><span class="hljs-tag">&lt;<span class="hljs-title">script</span>&gt;</span><span class="stylus">LS.<span class="hljs-function"><span class="hljs-title">ls2html</span><span class="hljs-params">(<span class="hljs-string">&quot;css_1&quot;</span>,<span class="hljs-string">&quot;style&quot;</span>,<span class="hljs-string">&quot;cookie_name&quot;</span>)</span></span></span><span class="hljs-tag">&lt;/<span class="hljs-title">script</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-title">script</span> <span class="hljs-attribute">id</span>=<span class="hljs-value">&quot;js_1&quot;</span>&gt;</span><span class="actionscript">&#x200D;&#x200D;<span class="hljs-comment">/* the new content of 1.js ... */</span></span><span class="hljs-tag">&lt;/<span class="hljs-title">script</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-title">script</span>&gt;</span><span class="actionscript">LS.html2ls(<span class="hljs-string">&quot;js_1&quot;</span>);LS.updateVersion(<span class="hljs-string">&apos;cookie_name&apos;</span>,<span class="hljs-string">&apos;1&apos;</span>,<span class="hljs-string">&apos;3&apos;</span>)</span><span class="hljs-tag">&lt;/<span class="hljs-title">script</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-title">script</span>&gt;</span><span class="stylus">LS.<span class="hljs-function"><span class="hljs-title">ls2html</span><span class="hljs-params">(<span class="hljs-string">&quot;js_2&quot;</span>,<span class="hljs-string">&quot;script&quot;</span>,<span class="hljs-string">&quot;cookie_name&quot;</span>)</span></span></span><span class="hljs-tag">&lt;/<span class="hljs-title">script</span>&gt;</span>
</code></pre>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x53EA;&#x6709;&#x672C;&#x6B21;&#x66F4;&#x65B0;&#x7684;&#x8D44;&#x6E90;&#x624D;&#x4F1A;&#x8F93;&#x51FA;&#x5168;&#x90E8;&#x5185;&#x5BB9;&#x3002;&#x8FD9;&#x4EFD;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x5B8C;&#x4E4B;&#x540E;&#xFF0C;&#x672C;&#x5730; <code>js_1</code> &#x8FD9;&#x4EFD; localStorage &#x4F1A;&#x968F;&#x4E4B;&#x66F4;&#x65B0;&#xFF0C;Cookie &#x4E5F;&#x4F1A;&#x66F4;&#x65B0;&#x4E3A; <code>001320</code>&#x3002;</p>
<p>&#x770B;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x5927;&#x5BB6;&#x5E94;&#x8BE5;&#x660E;&#x767D;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x7684;&#x57FA;&#x672C;&#x539F;&#x7406;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x9700;&#x8981;&#x5728;&#x670D;&#x52A1;&#x7AEF;&#x5904;&#x7406;&#x4E00;&#x7CFB;&#x5217;&#x590D;&#x6742;&#x7684;&#x5206;&#x652F;&#x5224;&#x65AD;&#xFF0C;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#x6211;&#x5C31;&#x4E0D;&#x8D34;&#x4E86;&#x3002;&#x4E0B;&#x9762;&#x8BF4;&#x51E0;&#x4E2A;&#x9700;&#x8981;&#x7279;&#x522B;&#x5173;&#x6CE8;&#x7684;&#x70B9;&#xFF1A;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x79FB;&#x52A8;&#x7AEF;&#x90E8;&#x5206;&#x6D4F;&#x89C8;&#x5668;&#x5728;&#x9690;&#x79C1;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x8BBF;&#x95EE; localStorage &#x5BF9;&#x8C61;&#x4F1A;&#x76F4;&#x63A5;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#xFF0C;&#x5FC5;&#x987B;&#x628A; localStorage &#x7684;&#x51E0;&#x4E2A;&#x65B9;&#x6CD5;&#x5305;&#x88C5;&#x4E00;&#x4E0B;&#xFF0C;&#x52A0;&#x4E0A; try&#x3002;</p>
<p>&#x5176;&#x6B21;&#xFF0C;&#x5982;&#x679C; Cookie &#x4E2D;&#x7684;&#x6807;&#x8BB0;&#x5B58;&#x5728;&#xFF0C;&#x4F46;&#x662F; localStorage &#x5185;&#x5BB9;&#x4E22;&#x5931;&#x5982;&#x4F55;&#x5904;&#x7406;&#xFF1F;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x8FD9;&#x884C;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-js">LS.ls2html(<span class="hljs-string">&quot;css_1&quot;</span>,<span class="hljs-string">&quot;style&quot;</span>,<span class="hljs-string">&quot;cookie_name&quot;</span>)
</code></pre>
<p>&#x5B83;&#x6267;&#x884C;&#x7684;&#x5177;&#x4F53;&#x64CD;&#x4F5C;&#x662F;&#xFF1A;&#x67E5;&#x627E; localStorage &#x4E2D;&#x540D;&#x4E3A; <code>css_1</code> &#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x627E;&#x5230;&#x4E4B;&#x540E;&#x521B;&#x5EFA; style &#x6807;&#x7B7E;&#x5E76;&#x63D2;&#x5165;&#x9875;&#x9762;&#x3002;&#x7B2C;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x503C; <code>cookie_name</code> &#x662F;&#x4E3A;&#x4E86;&#x5728;&#x8BFB;&#x53D6; localStorage &#x5931;&#x8D25;&#x65F6;&#xFF0C;&#x80FD;&#x591F;&#x6E05;&#x6389;&#x8FD9;&#x4E2A; Cookie &#x6807;&#x8BB0;&#xFF0C;&#x7136;&#x540E;&#x5237;&#x65B0;&#x9875;&#x9762;&#x3002;&#x8FD9;&#x65F6;&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x53D1;&#x73B0; Cookie &#x6807;&#x8BB0;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x5C31;&#x4F1A;&#x5168;&#x91CF;&#x8F93;&#x51FA;&#x5185;&#x8054;&#x5185;&#x5BB9;&#xFF0C;&#x7B49;&#x540C;&#x4E8E;&#x7528;&#x6237;&#x9996;&#x6B21;&#x8BBF;&#x95EE;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x5355;&#x5B57;&#x7B26;&#x6807;&#x8BB0;&#x6587;&#x4EF6;&#x540D;&#x548C;&#x7248;&#x672C;&#xFF0C;&#x5BB9;&#x91CF;&#x53EA;&#x6709; 70&#x3002;&#x6BCF;&#x4E2A;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x5141;&#x8BB8;&#x540C;&#x65F6;&#x6709; 70 &#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6587;&#x4EF6;&#x5B58;&#x5165; localStorage&#xFF0C;&#x5B8C;&#x5168;&#x591F;&#x7528;&#x3002;&#x5047;&#x8BBE;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x6BCF;&#x5468;&#x4FEE;&#x6539;&#x4E24;&#x6B21;&#x7248;&#x672C;&#xFF0C;&#x90A3;&#x4E48; 70 &#x4E2A;&#x7248;&#x672C;&#x53F7;&#x4F1A;&#x5728;&#x5927;&#x534A;&#x5E74;&#x540E;&#x5FAA;&#x73AF;&#x5230;&#x8D77;&#x70B9;&#x3002;&#x5047;&#x8BBE;&#x7528;&#x6237;&#x6D4F;&#x89C8;&#x5668;&#x5B58;&#x5728;&#x67D0;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x7248;&#x672C; <code>0</code>&#xFF0C;&#x5927;&#x534A;&#x5E74;&#x671F;&#x95F4;&#x4E00;&#x76F4;&#x6CA1;&#x6765;&#x8BBF;&#x95EE;&#xFF0C;&#x76F4;&#x5230;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x7248;&#x672C;&#x53F7;&#x8F6E;&#x56DE;&#x5230; <code>0</code> &#x4ED6;&#x518D;&#x8BBF;&#x95EE;&#x4E00;&#x6B21;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x670D;&#x52A1;&#x7AEF;&#x4F1A;&#x8BA4;&#x4E3A;&#x4ED6;&#x672C;&#x5730;&#x7684;&#x6587;&#x4EF6;&#x5DF2;&#x7ECF;&#x662F;&#x6700;&#x65B0;&#x7684;&#x3002;&#x8FD9;&#x79CD;&#x6781;&#x7AEF;&#x60C5;&#x51B5;&#x6211;&#x4EEC;&#x8BC4;&#x4F30;&#x540E;&#x8BA4;&#x4E3A;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x3002;&#x5982;&#x679C;&#x5B9E;&#x5728;&#x4E0D;&#x653E;&#x5FC3;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x6587;&#x4EF6;&#x6216;&#x7248;&#x672C;&#x6269;&#x5145;&#x4E3A;&#x4E24;&#x4F4D;&#x6765;&#x8868;&#x793A;&#xFF0C;&#x5C31;&#x80FD;&#x5E94;&#x5BF9; 4900 &#x79CD;&#x4E0D;&#x540C;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x6709;&#x4E9B; Webview &#x6CA1;&#x6709;&#x5F00;&#x542F; localStorage &#x529F;&#x80FD;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x68C0;&#x6D4B;&#x5230;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5C31;&#x989D;&#x5916;&#x8BB0;&#x4E00;&#x4E2A; Cookie &#x6807;&#x8BB0;&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x6807;&#x8BB0;&#xFF0C;&#x6BCF;&#x6B21;&#x76F4;&#x63A5;&#x5168;&#x91CF;&#x8F93;&#x51FA;&#x5185;&#x8054;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5982;&#x679C; Webview &#x8FDE; Cookie &#x4E5F;&#x4E0D;&#x652F;&#x6301;&#xFF0C;&#x90A3;&#x4E48;&#x6700;&#x7EC8;&#x6548;&#x679C;&#x4E5F;&#x662F;&#x6BCF;&#x6B21;&#x90FD;&#x5168;&#x91CF;&#x5185;&#x8054;&#xFF0C;&#x81F3;&#x5C11;&#x4E0D;&#x6BD4;&#x4F18;&#x5316;&#x524D;&#x5DEE;&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x7C7B;&#x4F3C;&#x4E8E;&#x8D2D;&#x7269;&#x8F66;&#x7684;&#x505A;&#x6CD5;&#x5B9E;&#x65BD;&#x8FD9;&#x5957;&#x65B9;&#x6848;&#xFF1A;&#x5728;&#x7528;&#x6237;&#x6D4F;&#x89C8;&#x5668;&#x5B58;&#x4E00;&#x4E2A; Cookie &#x6807;&#x8BC6;&#xFF0C;&#x7136;&#x540E;&#x670D;&#x52A1;&#x7AEF;&#x901A;&#x8FC7; Redis &#x8FD9;&#x6837;&#x7684; KV &#x670D;&#x52A1;&#x6765;&#x627E;&#x51FA;&#x66FE;&#x7ECF;&#x7ED9;&#x4ED6;&#x53D1;&#x9001;&#x8FC7;&#x54EA;&#x4E9B;&#x8D44;&#x6E90;&#x53CA;&#x5404;&#x81EA;&#x7248;&#x672C;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x597D;&#x5904;&#x662F;&#x4EE3;&#x7801;&#x903B;&#x8F91;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x9700;&#x8981;&#x5F15;&#x5165;&#x5916;&#x90E8;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x8D44;&#x6E90;&#x5185;&#x8054;&#x53EF;&#x4EE5;&#x7F13;&#x89E3;&#x79FB;&#x52A8;&#x7AEF;&#x7F51;&#x7EDC;&#x7684;&#x9AD8;&#x65F6;&#x5EF6;&#x3001;&#x9AD8;&#x4E22;&#x5305;&#x7B49;&#x95EE;&#x9898;&#xFF1B;&#x800C;&#x8D44;&#x6E90; localStorage &#x5316;&#x53EF;&#x4EE5;&#x5E94;&#x5BF9;&#x4F4E;&#x901F;&#x7387;&#xFF1B;&#x4E8C;&#x8005;&#x7ED3;&#x5408;&#x4F7F;&#x7528;&#xFF0C;&#x624D;&#x80FD;&#x6709;&#x6700;&#x597D;&#x7684;&#x6548;&#x679C;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6211;&#x524D;&#x9762;&#x63D0;&#x51FA;&#x7684;&#x79FB;&#x52A8; WEB &#x901A;&#x7528;&#x4F18;&#x5316;&#x7B56;&#x7565;&#x7B2C;&#x4E00;&#x8981;&#x70B9;&#x9700;&#x8981;&#x5B8C;&#x5584;&#x4E0B;&#xFF1A;</p>
<blockquote>
<p>&#x91CD;&#x8981;&#x7684; CSS&#x3001;JS&#x3001;JSON &#x6570;&#x636E;&#x76F4;&#x63A5;&#x5185;&#x8054;&#x5728; HTML &#x4E2D;&#xFF0C;&#x5934;&#x90E8;&#x7981;&#x6B62;&#x51FA;&#x73B0;&#x4EFB;&#x4F55;&#x5916;&#x94FE;&#x8D44;&#x6E90;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x51CF;&#x5C11;&#x9875;&#x9762;&#x4F20;&#x8F93;&#x4F53;&#x79EF;&#x3002;</p>
</blockquote>
<p>&#x597D;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x7CFB;&#x5217;&#x7684;&#x5F00;&#x7BC7;&#x5148;&#x5C31;&#x5199;&#x8FD9;&#x4E48;&#x591A;&#x3002;&#x8FD8;&#x662F;&#x8001;&#x89C4;&#x77E9;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#x548C;&#x7591;&#x95EE;&#x6B22;&#x8FCE;&#x7559;&#x8A00;&#xFF0C;&#x6211;&#x4F1A;&#x53CA;&#x65F6;&#x56DE;&#x590D;&#x3002;</p>
<p>&#x672C;&#x6587;&#x94FE;&#x63A5;&#xFF1A;<a href="https://imququ.com/post/wpo-of-mobile-web-1.html">https://imququ.com/post/wpo-of-mobile-web-1.html</a>&#xFF0C;<a href="https://imququ.com/post/wpo-of-mobile-web-1.html#comments" target="_blank">&#x53C2;&#x4E0E;&#x8BA8;&#x8BBA;</a></p><p>&#x2665; &#x672C;&#x7AD9;&#x6240;&#x6709;&#x6587;&#x7AE0;&#x5747;&#x4E3A;&#x672C;&#x4EBA;&#x539F;&#x521B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8BA4;&#x4E3A;&#x6211;&#x7684;&#x6587;&#x7AE0;&#x5BF9;&#x4F60;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x6B22;&#x8FCE;&#x8D5E;&#x52A9;&#x672C;&#x7AD9;&#x3002;<a target="_blank" href="https://imququ.com/post/about.html#toc-2">&#x8BE6;&#x60C5;&#x8BF7;&#x70B9;&#x8FD9;&#x91CC; &#xBB;</a></p></div>
</div>

</body>
</html>