<!DOCTYPE html>
<html>
<head>
  
  <title>2016&#xFF0C;&#x4F4E;&#x7248;&#x672C;&#x6D4F;&#x89C8;&#x5668;&#x6D3B;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E00;&#x5E74;</title>
  
</head>
<body>

<div id="wrap">
  <h1>2016&#xFF0C;&#x4F4E;&#x7248;&#x672C;&#x6D4F;&#x89C8;&#x5668;&#x6D3B;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E00;&#x5E74;</h1>
  <div id="content"><p>&#x516C;&#x53F8;&#x5728; 15 &#x5E74;&#x4E0B;&#x534A;&#x5E74;&#x5B8C;&#x6210;&#x4E86;&#x5168;&#x7AD9;&#x7684; https &#x5347;&#x7EA7;&#x5DE5;&#x4F5C;&#xFF0C;&#x5B8C;&#x6210;&#x65F6;&#x5BF9;&#x5916;&#x5BA3;&#x79F0;&#x300C;&#x6211;&#x4EEC;&#x662F;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x552F;&#x4E00;&#x4E00;&#x5BB6;&#x5168;&#x7AD9;&#x542F;&#x7528; https &#x7684;&#x7535;&#x5546;&#x516C;&#x53F8;&#x300D;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4EFD;&#x8363;&#x8A89;&#xFF0C;&#x5168;&#x7AD9; https &#x610F;&#x5473;&#x7740;&#x5728;&#x6280;&#x672F;&#x4E0A;&#x66F4;&#x5927;&#x7A0B;&#x5EA6;&#x5730;&#x4FDD;&#x969C;&#x4E86;&#x6D88;&#x8D39;&#x8005;&#x7684;&#x4FE1;&#x606F;&#x548C;&#x4EA4;&#x6613;&#x5B89;&#x5168;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#x4E5F;&#x70B9;&#x71C3;&#x4E86;&#x5927;&#x5BB6;&#x5FC3;&#x4E2D;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x6FC0;&#x60C5;&#xFF1A;&#x201C;&#x6240;&#x6709;&#x8BC1;&#x4E66;&#x4F9B;&#x5E94;&#x5546;&#x4ECE; 16 &#x5E74; 1 &#x6708; 1 &#x65E5;&#x5F00;&#x59CB;&#x4E0D;&#x518D;&#x7B7E;&#x53D1; SHA-1 &#x7B7E;&#x540D;&#x7684;&#x8BC1;&#x4E66;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x5F88;&#x65E9;&#x5C31;&#x770B;&#x5230; https &#x7F51;&#x9875;&#x5728; Firefox &#x7684;&#x63A7;&#x5236;&#x53F0;&#x4E2D;&#x4E00;&#x5806;&#x9EC4;&#x8272;&#x8B66;&#x62A5;&#xFF0C;&#x8B66;&#x544A; SHA-1 &#x8BC1;&#x4E66;&#x4E0D;&#x5B89;&#x5168;&#x3002;&#x4F46;&#x662F;&#x5347;&#x7EA7;&#x5230; SHA-256 &#x4E4B;&#x540E;&#xFF0C;&#x4F1A;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x90E8;&#x5206;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x6253;&#x4E0D;&#x5F00;&#x7F51;&#x9875;&#xFF0C;&#x53EA;&#x80FD;&#x5F15;&#x5BFC;&#x8FD9;&#x4E9B;&#x7528;&#x6237;&#x5347;&#x7EA7;&#x4ED6;&#x4EEC;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x8BA9;&#x7528;&#x6237;&#x5347;&#x7EA7;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x4F55;&#x6B62;&#x8FD9;&#x4E00;&#x4E2A;&#x7406;&#x7531;&#x5440;&#xFF01;</p>
<a id="more"/>
<h3 id="&#x4F4E;&#x7248;&#x672C;&#x6D4F;&#x89C8;&#x5668;&#x5B89;&#x5168;&#x582A;&#x5FE7;">&#x4F4E;&#x7248;&#x672C;&#x6D4F;&#x89C8;&#x5668;&#x5B89;&#x5168;&#x582A;&#x5FE7;</h3><p>&#x6709;&#x8FD9;&#x4E48;&#x51E0;&#x5219;&#x80CC;&#x666F;&#xFF1A;</p>
<ol>
<li>&#x4ECE; 16 &#x5E74; 1 &#x6708; 20 &#x53F7;&#x5F00;&#x59CB;&#xFF0C;&#x5FAE;&#x8F6F;&#x4E0D;&#x518D;&#x652F;&#x6301; IE7/8 &#x7684;&#x5347;&#x7EA7;&#xFF08;14 &#x5E74; 4 &#x6708; 8 &#x53F7;&#x5C31;&#x505C;&#x6B62;&#x4E86;&#x5BF9; IE6 &#x7684;&#x5347;&#x7EA7;&#x652F;&#x6301;&#xFF09;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x90E8;&#x5206;&#x7528;&#x6237;&#x5982;&#x679C;&#x4E0D;&#x5347;&#x7EA7;&#x5230;&#x6700;&#x65B0;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x672A;&#x6765;&#x5982;&#x679C;&#x62A5;&#x51FA;&#x6F0F;&#x6D1E;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x7528;&#x6237;&#x6570;&#x636E;&#x51FA;&#x73B0;&#x6CC4;&#x6F0F;&#x3002;</li>
<li>SHA-1 &#x7B7E;&#x540D;&#x7684;&#x8BC1;&#x4E66;&#x88AB;&#x8BC1;&#x660E;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x5728;&#x77ED;&#x65F6;&#x95F4;&#x5185;&#x7834;&#x89E3;&#xFF0C;&#x6240;&#x6709;&#x8BC1;&#x4E66;&#x4F9B;&#x5E94;&#x5546;&#x4ECE; 16 &#x5E74; 1 &#x6708; 1 &#x65E5;&#x5F00;&#x59CB;&#x4E0D;&#x518D;&#x7B7E;&#x53D1; SHA-1 &#x7B7E;&#x540D;&#x7684;&#x8BC1;&#x4E66;&#xFF0C;&#x6240;&#x6709;&#x6D4F;&#x89C8;&#x5668;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E5F;&#x4F1A;&#x5C06; SHA-1 &#x8BC1;&#x4E66;&#x6807;&#x8BB0;&#x4E3A;&#x4E0D;&#x5B89;&#x5168;&#x3002;</li>
<li>SSLv3 &#x5DF2;&#x7ECF;&#x8BDE;&#x751F;&#x4E86; 18 &#x5E74;&#xFF0C;&#x6700;&#x8FD1;&#x516C;&#x5F00;&#x7684; POODLE &#x653B;&#x51FB;&#x4E5F;&#x57FA;&#x672C;&#x5BA3;&#x544A; SSLv3 &#x4E0D;&#x518D;&#x5B89;&#x5168;&#xFF0C;&#x5E76;&#x4E14; IETF &#x5DF2;&#x7ECF;&#x5C06; SSLv3 &#x4F5C;&#x4E3A;&#x4E0D;&#x5B89;&#x5168;&#x7684;&#x7B97;&#x6CD5;&#x3002;</li>
</ol>
<p>&#x5BF9;&#x4F4E;&#x7248;&#x672C;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x517C;&#x5BB9;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x8BA9;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x5934;&#x75BC;&#xFF0C;&#x4E5F;&#x8BA9;&#x5F88;&#x591A;&#x8FD0;&#x7EF4;&#x540C;&#x5B66;&#x548C;&#x5B89;&#x5168;&#x540C;&#x5B66;&#x82E6;&#x607C;&#xFF0C;&#x56E0;&#x4E3A;&#x4F4E;&#x7248;&#x672C;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4E0D;&#x652F;&#x6301; HSTS&#xFF08;&#x51FA;&#x73B0;&#x5BF9; https &#x7684;&#x52AB;&#x6301;&#x653B;&#x51FB;&#x95EE;&#x9898;&#xFF09;&#x3001;&#x524D;&#x5411;&#x52A0;&#x5BC6;&#xFF08;RSA &#x4EA4;&#x6362;&#x7684;&#x5BC6;&#x94A5;&#x672A;&#x6765;&#x53EF;&#x4EE5;&#x88AB;&#x7834;&#x89E3;&#xFF09;&#x3001;TLS1.2&#x3001;SNI&#x3001;session ticket&#x3001;OCSP stapling &#x7B49;&#x7279;&#x6027;&#x3002;</p>
<p>&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x5FAE;&#x8F6F;&#x4E0D;&#x65AD;&#x7206;&#x51FA;&#x65B0;&#x95FB;&#xFF0C;&#x901A;&#x77E5;&#x7528;&#x6237;&#xFF0C;&#x4E0D;&#x518D;&#x4E3A; IE11 &#x4EE5;&#x4E0B;&#x7248;&#x672C;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x548C; win8.1 &#x7248;&#x672C;&#x4EE5;&#x4E0B;&#x7684;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x6280;&#x672F;&#x652F;&#x6301;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x5927;&#x6570;&#x636E;&#x4EA4;&#x4E92;&#x4E3A;&#x80CC;&#x666F;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x65F6;&#x4EE3;&#xFF0C;&#x4E00;&#x4E2A;&#x5B89;&#x5168;&#x6F0F;&#x6D1E;&#x5C31;&#x53EF;&#x80FD;&#x8BA9;&#x5927;&#x9762;&#x79EF;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x6349;&#x895F;&#x89C1;&#x8098;&#x3002;</p>
<h3 id="&#x56FD;&#x5185;&#x5927;&#x516C;&#x53F8;&#x7684;&#x53CD;&#x5E94;">&#x56FD;&#x5185;&#x5927;&#x516C;&#x53F8;&#x7684;&#x53CD;&#x5E94;</h3><p>BAT &#x4E09;&#x5DE8;&#x5934;&#xFF0C;&#x6211;&#x5C31;&#x8BF4;&#x8BF4;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x5427;&#xFF0C;&#x6BD5;&#x7ADF;&#x662F;&#x81EA;&#x5DF1;&#x670D;&#x52A1;&#x7684;&#x516C;&#x53F8;&#x3002;</p>
<p>&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x4E5F;&#x5728;&#x9010;&#x6B65;&#x53BB;&#x9664;&#x5BF9; IE6&#x3001;7 &#x6D4F;&#x89C8;&#x5668;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x5E76;&#x4E14;&#x9010;&#x6B65;&#x5C06; PC &#x7AEF;&#x7684; SHA-1 &#x7B7E;&#x540D;&#x8BC1;&#x4E66;&#x548C; SSLV3 &#x7B97;&#x6CD5;&#x4E0B;&#x7EBF;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6709;&#x4E9B;&#x5BA2;&#x6237;&#x7AEF;&#x8BBF;&#x95EE;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x7684;&#x9875;&#x9762;&#x4F1A;&#x8DF3;&#x8F6C;&#x5230;&#x8FD9;&#x4E2A;&#x94FE;&#x63A5;&#xFF1A;<a href="https://www.taobao.com/markets/tbhome/ali-page-updater" target="_blank" rel="external">https://www.taobao.com/markets/tbhome/ali-page-updater</a> &#x3002;</p>
<p><img src="./resource/02632217835e.png" alt="&#x963F;&#x91CC;&#x5DF4;&#x5DF4;-&#x4F4E;&#x7248;&#x672C;&#x6D4F;&#x89C8;&#x5668;&#x5347;&#x7EA7;&#x63D0;&#x793A;"/></p>
<p>&#x5E76;&#x4E14;&#x5728;&#x4E00;&#x4E9B;&#x9875;&#x9762;&#x4E2D;&#xFF0C;&#x4F4E;&#x7248;&#x672C;&#x7684; IE &#x4E5F;&#x4F1A;&#x5F39;&#x51FA;&#x63D0;&#x793A;&#x6846;&#xFF1A;</p>
<p><img src="./resource/5143ae6c09ae.png" alt="&#x6DD8;&#x5B9D;&#x9996;&#x9875;-&#x4F4E;&#x7248;&#x672C;&#x6D4F;&#x89C8;&#x5668;&#x5347;&#x7EA7;&#x63D0;&#x793A;"/></p>
<p>&#x5929;&#x732B;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#xFF1A;</p>
<p><img src="./resource/9cc84d0d155f.png" alt="&#x5929;&#x732B;&#x9996;&#x9875;-&#x4F4E;&#x7248;&#x672C;&#x6D4F;&#x89C8;&#x5668;&#x5347;&#x7EA7;&#x63D0;&#x793A;"/></p>
<h3 id="&#x6700;&#x540E;">&#x6700;&#x540E;</h3><p>&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x5B89;&#x5168;&#x95EE;&#x9898;&#xFF0C;&#x53D7;&#x5F71;&#x54CD;&#x7684;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F; IE &#x7528;&#x6237;&#xFF0C;&#x8FD8;&#x6709; Android 2.3 &#x7248;&#x672C;&#x4EE5;&#x4E0B;&#x7528;&#x6237;&#xFF0C;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x8BBE;&#x5907;&#x7684;&#x7528;&#x6237;&#x5360;&#x6BD4;&#x5DF2;&#x7ECF;&#x5F88;&#x4F4E;&#x5F88;&#x4F4E;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x8DB3;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;2016 &#x5E74;&#xFF0C;&#x90A3;&#x4E9B;&#x4F4E;&#x7248;&#x672C;&#x6D4F;&#x89C8;&#x5668;&#x5C06;&#x79BB;&#x5F00;&#x4E2D;&#x56FD;&#x7684;&#x5386;&#x53F2;&#x821E;&#x53F0;&#x4E86;&#x3002;</p></div>
</div>

</body>
</html>