<!DOCTYPE html>
<html>
<head>
  
  <title>&#x65F6;&#x95F4;&#x90FD;&#x53BB;&#x54EA;&#x513F;&#x4E86;&#xFF1F;</title>
  
</head>
<body>

<div id="wrap">
  <h1>&#x65F6;&#x95F4;&#x90FD;&#x53BB;&#x54EA;&#x513F;&#x4E86;&#xFF1F;</h1>
  <div id="content"><p>&#x8BB0;&#x5F97;&#x5F53;&#x521D; 17 &#x5C81;&#x521A;&#x8FDB;&#x5927;&#x5B66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5FC3;&#x4E2D;&#x8FD8;&#x5145;&#x6EE1;&#x4E86;&#x4F18;&#x8D8A;&#x611F;&#xFF0C;&#x5FC3;&#x60F3;&#x7740;&#xFF1A;&#x201C;&#x9752;&#x6625;&#x554A;&#xFF0C;&#x6211;&#x8981;&#x8086;&#x610F;&#x6325;&#x6D12;&#x8FD9;&#x51E0;&#x5E74;&#x3002;&#x201D; &#x6CA1;&#x60F3;&#x5230;&#x8FD8;&#x6CA1;&#x6765;&#x5F97;&#x53CA;&#x6325;&#x6D12;&#xFF0C;&#x5927;&#x5B66;&#x5C31;&#x5DF2;&#x7ECF;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x591A;&#x5C11;&#x7559;&#x604B;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5F88;&#x5E73;&#x9759;&#x5730;&#x5C31;&#x8FC7;&#x53BB;&#x4E86;&#xFF1B;&#x5F53;&#x6211;&#x8D70;&#x8FDB;&#x793E;&#x4F1A;&#xFF0C;&#x8D70;&#x8FDB;&#x5927;&#x516C;&#x53F8;&#x5B9E;&#x4E60;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5FC3;&#x4E2D;&#x53C8;&#x662F;&#x4E00;&#x9635;&#x6B22;&#x559C;&#xFF0C;&#x201C;&#x5440;&#xFF0C;&#x90FD;&#x662F;&#x5E08;&#x5144;&#x5E08;&#x59D0;&#x8F88;&#x4EFD;&#x7684;&#x54C8;~&#x201D;&#xFF0C;&#x7136;&#x800C;&#x8FD9;&#x4E00;&#x9635;&#x6B22;&#x559C;&#x8FD8;&#x6CA1;&#x5F00;&#x59CB;&#xFF0C;&#x65F6;&#x5149;&#x834F;&#x82D2;&#x4E24;&#x5E74;&#x98DE;&#x901D;&#xFF0C;&#x5DF2;&#x7ECF;&#x4E0D;&#x6562;&#x518D;&#x79F0;&#x81EA;&#x5DF1;&#x4E3A;&#x5C0F;&#x9C9C;&#x8089;&#x4E86;&#x2026;</p>
<p>&#x6211;&#x5230;&#x73B0;&#x5728;&#x8FD8;&#x4EE5;&#x4E3A;&#x81EA;&#x5DF1;&#x662F;&#x53BB;&#x5E74;&#x6BD5;&#x4E1A;&#x7684;&#xFF0C;&#x4ED4;&#x7EC6;&#x56DE;&#x5FC6;&#xFF0C;&#x4E2D;&#x95F4;&#x5176;&#x5B9E;&#x8FD8;&#x9694;&#x4E86;&#x4E00;&#x5E74;&#x3002;&#x6643;&#x6643;&#x60A0;&#x60A0;&#x7684;&#xFF0C;&#x65F6;&#x95F4;&#x90FD;&#x53BB;&#x54EA;&#x91CC;&#x4E86;&#xFF1F;&#x6211;&#x53C8;&#x4ECE;&#x8FD9;&#x4E9B;&#x65F6;&#x95F4;&#x7684;&#x5939;&#x7F1D;&#x4E2D;&#x83B7;&#x5F97;&#x4E86;&#x4EC0;&#x4E48;&#xFF1F;</p>
<a id="more"/>
<h3 id="&#x6F02;&#x6D6E;&#x7684;&#x72B6;&#x6001;">&#x6F02;&#x6D6E;&#x7684;&#x72B6;&#x6001;</h3><p>&#x4EE5;&#x524D;&#x624B;&#x673A;&#x91CC;&#x5934;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x6E38;&#x620F;&#xFF0C;&#x6700;&#x8FD1;&#x88C5;&#x4E86;&#x4E00;&#x4E2A;&#x6597;&#x5730;&#x4E3B;&#xFF0C;&#x7531;&#x4E8E;&#x8FD0;&#x6C14;&#x592A;&#x597D;&#xFF0C;&#x6B22;&#x4E50;&#x8C46;&#x4E00;&#x76F4;&#x8F93;&#x4E0D;&#x5B8C;&#xFF0C;&#x7ED3;&#x679C;&#x5F88;&#x591A;&#x95F2;&#x6687;&#x65F6;&#x95F4;&#x6254;&#x8FDB;&#x4E86;&#x6E38;&#x620F;&#x5806;&#xFF1B;&#x4EE5;&#x524D;&#x4E60;&#x60EF;&#x4E0D;&#x5403;&#x996D;&#x6216;&#x8005;&#x4E0D;&#x7761;&#x89C9;&#xFF0C;&#x7528;&#x4E00;&#x6BB5;&#x5F88;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x4F5C;&#x54C1;&#x6216;&#x8005;&#x9879;&#x76EE;&#xFF0C;&#x73B0;&#x5728;&#x6309;&#x65F6;&#x5403;&#x996D;&#xFF0C;&#x57FA;&#x672C;&#x6309;&#x65F6;&#x7761;&#x89C9;&#xFF0C;&#x5927;&#x6BB5;&#x7684;&#x65F6;&#x95F4;&#x6CA1;&#x6709;&#x4E86;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x662F;&#x96F6;&#x788E;&#x7684;&#x65F6;&#x95F4;&#x7247;&#xFF0C;&#x800C;&#x81EA;&#x5DF1;&#x53C8;&#x4E0D;&#x5584;&#x4E8E;&#x5229;&#x7528;&#x65F6;&#x95F4;&#x7247;&#xFF1B;&#x4EE5;&#x524D;&#x603B;&#x662F;&#x70B9;&#x5934;&#xFF0C;&#x4F60;&#x5F00;&#x5FC3;&#x6211;&#x6EE1;&#x610F;&#x3002;&#x800C;&#x73B0;&#x5728;&#x603B;&#x662F;&#x6447;&#x5934;&#xFF0C;&#x6447;&#x4E00;&#x6B21;&#x5934;&#x7684;&#x4EE3;&#x4EF7;&#x5C31;&#x662F;&#x66F4;&#x591A;&#x7684;&#x70B9;&#x5934;&#xFF0C;&#x70B9;&#x5934;&#x548C;&#x6447;&#x5934;&#x4E4B;&#x95F4;&#xFF0C;&#x4EBA;&#x4E5F;&#x53D8;&#x5F97;&#x8FF7;&#x8FF7;&#x7CCA;&#x7CCA;&#x2026;</p>
<p>&#x8FD9;&#x4E00;&#x5E74;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x60C5;&#x7EEA;&#x5C31;&#x50CF;&#x662F;&#x4E00;&#x6839;&#x6CE2;&#x6D6A;&#x7EBF;&#xFF0C;&#x8DCC;&#x5B95;&#x8D77;&#x4F0F;&#xFF0C;&#x65F6;&#x800C;&#x6FC0;&#x60C5;&#x6F8E;&#x6E43;&#xFF0C;&#x65F6;&#x800C;&#x4F4E;&#x9761;&#x6C89;&#x6CA6;&#x3002;&#x5728;&#x516C;&#x53F8;&#x4E0A;&#x73ED;&#xFF0C;&#x62DF;&#x5B9A; KPI&#xFF0C;&#x7167;&#x7740;&#x5927;&#x7EB2;&#x8FC7;&#x65E5;&#x5B50;&#xFF1B;&#x5047;&#x65E5;&#x91CC;&#x7684;&#x4F11;&#x95F2;&#xFF0C;&#x7275;&#x7740;&#x5973;&#x4F34;&#x7684;&#x624B;&#x56DB;&#x5904;&#x95F2;&#x8361;&#x3002;&#x6709;&#x660E;&#x786E;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x4F46;&#x662F;&#x4F3C;&#x4E4E;&#x4E5F;&#x4E0D;&#x600E;&#x4E48;&#x660E;&#x786E;&#x3002;</p>
<p>&#x6BCF;&#x6B21;&#x5728;&#x7ED9;&#x81EA;&#x5DF1;&#x5236;&#x5B9A;&#x76EE;&#x6807;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x603B;&#x6015;&#x82E6;&#x4E86;&#x81EA;&#x5DF1;&#xFF0C;&#x5F80;&#x677E;&#x91CC;&#x5B9A;&#xFF0C;&#x5F39;&#x6027;&#x6392;&#x5217;&#xFF0C;&#x6CA1;&#x6709;&#x7D27;&#x51D1;&#x611F;&#xFF0C;&#x5F88;&#x677E;&#x6563;&#xFF0C;&#x5F88;&#x968F;&#x6027;&#x3002;&#x6BCF;&#x6B21;&#x9047;&#x5230;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x603B;&#x60F3;&#x7740;&#x80FD;&#x56DE;&#x907F;&#x4FBF;&#x56DE;&#x907F;&#xFF0C;&#x4E0D;&#x80FD;&#x56DE;&#x907F;&#x5E72;&#x5B83;&#x4E24;&#x4E0B;&#x518D;&#x56DE;&#x907F;&#xFF0C;&#x8EB2;&#x8EB2;&#x95EA;&#x95EA;&#x5730;&#x8FC7;&#x65E5;&#x5B50;&#xFF0C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x80FD;&#x529B;&#x770B;&#x4F3C;&#x63D0;&#x9AD8;&#x4E86;&#xFF0C;&#x5B9E;&#x5219;&#x662F;&#x79EF;&#x6512;&#x95EE;&#x9898;&#x7684;&#x6C34;&#x5E73;&#x66F4;&#x5F3A;&#x4E86;&#x3002;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x89E3;&#x51B3;&#x4E86;&#x4E00;&#x4E2A;&#x300C;&#x590D;&#x6742;&#x300D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6068;&#x4E0D;&#x5F97;&#x7ED9;&#x81EA;&#x5DF1;&#x70B9; 100 &#x4E2A;&#x8D5E;&#xFF0C;&#x5F97;&#x745F;&#x4E2A;&#x4E09;&#x4E94;&#x516D;&#x5929;&#xFF0C;&#x7136;&#x540E;&#x5F00;&#x59CB;&#x89E3;&#x51B3;&#x4E0B;&#x4E00;&#x4E2A;&#x300C;&#x590D;&#x6742;&#x300D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x63A5;&#x7740;&#x7EE7;&#x7EED;&#x70B9;&#x8D5E;&#xFF0C;&#x5DF2;&#x7ECF;&#x88AB;&#x670B;&#x53CB;&#x5708;&#x548C;&#x5FAE;&#x535A;&#x7684;&#x70B9;&#x8D5E;&#x529F;&#x80FD;&#x85B0;&#x9676;&#x5230;&#x4E86;&#x6781;&#x70B9;&#xFF0C;&#x73A9;&#x7684;&#x795E;&#x9B42;&#x98A0;&#x5012;&#x3001;&#x4E0D;&#x80FD;&#x81EA;&#x5DF2;&#xFF01;</p>
<p>&#x51ED;&#x7740;&#x611F;&#x89C9;&#x8FC7;&#x65E5;&#x5B50;&#xFF0C;&#x8FD9;&#x662F;&#x8FD1;&#x534A;&#x5E74;&#x6700;&#x5927;&#x7684;&#x611F;&#x89E6;&#x3002;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x8BE5;&#x505A;&#xFF0C;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x4E0D;&#x8BE5;&#x505A;&#xFF0C;&#x8111;&#x5B50;&#x91CC;&#x4E00;&#x95EA;&#x800C;&#x8FC7;&#xFF0C;&#x7ED3;&#x8BBA;&#x4E5F;&#x5C31;&#x51FA;&#x6765;&#x4E86;&#x3002;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x601D;&#x7EF4;&#x654F;&#x6377;&#xFF0C;&#x4F3C;&#x4E4E;&#x66F4;&#x591A;&#x7684;&#x662F;&#x5934;&#x8111;&#x53D1;&#x70ED;&#xFF0C;&#x778E;&#x6307;&#x6325;&#x81EA;&#x5DF1;&#x7684;&#x8EAB;&#x4F53;&#x548C;&#x5634;&#x5DF4;&#x3002;&#x300C;&#x51ED;&#x611F;&#x89C9;&#x300D;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x957F;&#x671F;&#x7ECF;&#x9A8C;&#x6C89;&#x6DC0;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x57CB;&#x85CF;&#x5728;&#x6F5C;&#x610F;&#x8BC6;&#x4E0B;&#x7684;&#x53CD;&#x5C04;&#x5F27;&#xFF0C;&#x53CD;&#x5C04;&#x5F27;&#x5728;&#x8111;&#x5B50;&#x91CC;&#x653E;&#x591A;&#x4E86;&#x5C31;&#x5BB9;&#x6613;&#x51FA;&#x6BDB;&#x75C5;&#x3002;&#x8981;&#x77E5;&#x9053;&#xFF0C;&#x6D3B;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x7ECF;&#x9A8C;&#x91CC;&#x662F;&#x4E00;&#x4EF6;&#x76F8;&#x5F53;&#x65E0;&#x8DA3;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E0D;&#x7528;&#x601D;&#x8003;&#xFF0C;&#x4E60;&#x60EF;&#x6027;&#x5730;&#x52A8;&#x4F5C;&#xFF0C;&#x52A8;&#x4F5C;&#x6B21;&#x6570;&#x4E00;&#x591A;&#x5C31;&#x663E;&#x5F97;&#x7279;&#x522B;&#x81C3;&#x80BF;&#xFF0C;&#x7279;&#x522B;&#x591A;&#x4F59;&#x3002;</p>
<p>&#x6211;&#x559C;&#x6B22;&#x6362;&#x573A;&#x666F;&#x3002;&#x5C31;&#x50CF;&#x5FF5;&#x4E66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4E0D;&#x559C;&#x6B22;&#x603B;&#x662F;&#x5750;&#x5728;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x8FD9;&#x4E2A;&#x6708;&#x5750;&#x5728;&#x7B2C;&#x4E00;&#x6392;&#xFF0C;&#x4E0B;&#x4E2A;&#x6708;&#x8FD8;&#x8BA9;&#x6211;&#x5750;&#x5728;&#x7B2C;&#x4E00;&#x6392;&#xFF0C;&#x5C31;&#x5F88;&#x4E0D;&#x4E60;&#x60EF;&#x3002;&#x6211;&#x559C;&#x6B22;&#x6362;&#x7740;&#x6CD5;&#x53BB;&#x73A9;&#xFF0C;&#x6709;&#x53D8;&#x5316;&#x624D;&#x4F1A;&#x6709;&#x523A;&#x6FC0;&#x3002;&#x4EBA;&#x5C31;&#x662F;&#x7F3A;&#x4E4F;&#x523A;&#x6FC0;&#x624D;&#x53D8;&#x5F97;&#x8FDF;&#x949D;&#x3002;</p>
<p>2015 &#x5E74;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x81EA;&#x5DF1;&#x5904;&#x4E8E;&#x6F02;&#x6D6E;&#x72B6;&#x6001;&#xFF0C;&#x5F88;&#x79BB;&#x6563;&#x3002;</p>
<h3 id="&#x66F4;&#x52A0;&#x4E13;&#x6CE8;&#x5730;&#x505A;&#x4E8B;&#x60C5;">&#x66F4;&#x52A0;&#x4E13;&#x6CE8;&#x5730;&#x505A;&#x4E8B;&#x60C5;</h3><p>&#x751F;&#x6D3B;&#x548C;&#x5DE5;&#x4F5C;&#x4E2D;&#x6709;&#x592A;&#x591A;&#x91CD;&#x590D;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#xFF0C;&#x6211;&#x8981;&#x60F3;&#x529E;&#x6CD5;&#x878D;&#x5408;&#x6389;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x6211;&#x6BCF;&#x5929;&#x8981;&#x82B1; 5-20 &#x5206;&#x949F;&#xFF0C;&#x5904;&#x7406;&#x56E2;&#x961F;&#x535A;&#x5BA2;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x50AC;&#x7A3F;&#x3001;&#x53D1;&#x6587;&#x3001;&#x6539;&#x6587;&#x3001;&#x4F20;&#x64AD;&#x3001;&#x4F20;&#x64AD;&#x3001;&#x518D;&#x4F20;&#x64AD;&#x3001;&#x81EA;&#x5DF1;&#x5480;&#x56BC;&#x7B49;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x6BCF;&#x5929;&#x91CD;&#x590D;&#x7740;&#x3002;&#x7C7B;&#x4F3C;&#x8FD9;&#x6837;&#x7684;&#x6D41;&#x7A0B;&#xFF0C;&#x6211;&#x8981;&#x5199;&#x4E00;&#x5957;&#x81EA;&#x52A8;&#x5316;&#x7A0B;&#x5E8F;&#x6765;&#x5904;&#x7406;&#x3002;&#x4E0D;&#x80FD;&#x7528;&#x7F16;&#x7A0B;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8981;&#x7528;&#x89C4;&#x8303;&#x3001;&#x89C4;&#x5219;&#x53BB;&#x5904;&#x7406;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x91CD;&#x590D;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5FC5;&#x987B;&#x6BCF;&#x5929;&#x575A;&#x6301;&#x505A;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5065;&#x8EAB;&#xFF0C;&#x51C6;&#x65F6;&#x7761;&#x89C9;&#x3002;</p>
<p>&#x628A;&#x7D27;&#x6025;&#x7684;&#x4E8B;&#x60C5;&#x548C;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x5206;&#x7684;&#x66F4;&#x52A0;&#x6E05;&#x695A;&#x3002;&#x5C06;&#x66F4;&#x591A;&#x65F6;&#x95F4;&#x6295;&#x5165;&#x5230;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x6362;&#x4E00;&#x4E2A;&#x8EAB;&#x4EFD;&#x3002;</p>
<p>2016 &#x5E74;&#xFF0C;&#x6211;&#x6253;&#x7B97;&#x628A;&#x65F6;&#x95F4;&#x82B1;&#x5F97;&#x66F4;&#x52A0;&#x5212;&#x7B97;&#x3002;&#x53EA;&#x4E13;&#x6CE8;&#x51E0;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x505A;&#x597D;&#x5B83;&#xFF0C;&#x4E00;&#x76F4;&#x505A;&#x3002;</p>
<p>&#x55EF;&#xFF0C;30 &#x5206;&#x949F;&#x7684;&#x603B;&#x7ED3;&#x65F6;&#x95F4;&#xFF0C;&#x5C31;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x5F97;&#x53BB;&#x7761;&#x4E86;&#xFF01; 2016&#xFF0C;&#x52A0;&#x6CB9;&#xFF01;&#xFF01;&#xFF01;</p></div>
</div>

</body>
</html>