<!DOCTYPE html>
<html>
<head>
  
  <title>&#x4FE1;&#x606F;&#x65E0;&#x969C;&#x788D;&#x4E0D;&#x662F;&#x732E;&#x7231;&#x5FC3;&#x66F4;&#x4E0D;&#x662F;&#x505A;&#x516C;&#x76CA;&#x6148;&#x5584;</title>
  
</head>
<body>

<div id="wrap">
  <h1>&#x4FE1;&#x606F;&#x65E0;&#x969C;&#x788D;&#x4E0D;&#x662F;&#x732E;&#x7231;&#x5FC3;&#x66F4;&#x4E0D;&#x662F;&#x505A;&#x516C;&#x76CA;&#x6148;&#x5584;</h1>
  <div id="content"><p>&#x81EA;&#x4ECE;&#x4E24;&#x5E74;&#x524D;&#x52A0;&#x5165;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x7684;&#x4FE1;&#x606F;&#x65E0;&#x969C;&#x788D;&#x5C0F;&#x7EC4;&#xFF0C;&#x5E73;&#x65F6;&#x7684;&#x5B66;&#x4E60;&#x5F53;&#x4E2D;&#x5C31;&#x591A;&#x4E86;&#x4E00;&#x9879;&#x5185;&#x5BB9;&#xFF0C;&#x5173;&#x6CE8;&#x4FE1;&#x606F;&#x65E0;&#x969C;&#x788D;&#x76F8;&#x5173;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x4E5F;&#x7ECF;&#x5E38;&#x53BB; W3C &#x4E0A;&#x770B;&#x770B;&#x6280;&#x672F;&#x6587;&#x6863;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x4ECA;&#x5E74;&#x628A;&#x65E0;&#x969C;&#x788D;&#x76F8;&#x5173;&#x7684;&#x5B66;&#x4E60;&#x7814;&#x7A76;&#x63D0;&#x9AD8;&#x4E86;&#x4E00;&#x4E2A;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x6BCF;&#x9022;&#x5468;&#x672B;&#x5C31;&#x4F1A;&#x53BB;&#x7F51;&#x4E0A;&#x641C;&#x5BFB;&#x4E0B;&#x76F8;&#x5173;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x4E5F;&#x56E0;&#x6B64;&#x8BA4;&#x8BC6;&#x4E86;&#x4E00;&#x4E9B;&#x76F2;&#x4EBA;&#x670B;&#x53CB;&#x3002;</p>
<a id="more"/>
<p>&#x5F88;&#x591A;&#x4EBA;&#x4EE5;&#x4E3A;&#x76F2;&#x4EBA;&#x5C31;&#x662F;&#x62FF;&#x7740;&#x4E00;&#x6839;&#x62D0;&#x6756;&#xFF0C;&#x56DB;&#x5904;&#x63A2;&#x8DEF;&#xFF0C;&#x7B49;&#x7740;&#x88AB;&#x4EBA;&#x5E2E;&#x52A9;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x8FD8;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x5F88;&#x591A;&#x76F2;&#x4EBA;&#x90FD;&#x5728;&#x4F7F;&#x7528;&#x7535;&#x8111;&#x548C;&#x624B;&#x673A;&#xFF0C;&#x5E76;&#x4E14;&#x4E5F;&#x4F1A;&#x505A;&#x80A1;&#x7968;&#x6295;&#x8D44;&#x3001;&#x5728;&#x6DD8;&#x5B9D;&#x5F00;&#x5E97;&#x7B49;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4ED6;&#x4EEC;&#x7528;&#x7684;&#x5F88;&#x75DB;&#x82E6;&#x3002;&#x6280;&#x672F;&#x672C;&#x53EF;&#x4EE5;&#x8BA9;&#x89C6;&#x969C;&#x4EBA;&#x58EB;&#x540C;&#x6211;&#x4EEC;&#x4E00;&#x6837;&#xFF0C;&#x81EA;&#x7531;&#x7A7F;&#x68AD;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x6BCF;&#x4E2A;&#x89D2;&#x843D;&#xFF0C;&#x4F46;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x642D;&#x5EFA;&#x8005;&#x4EEC;&#xFF0C;&#x4F3C;&#x4E4E;&#x8FD8;&#x6CA1;&#x6709;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x7FA4;&#x4F53;&#xFF0C;&#x671F;&#x5F85;&#x88AB;&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#xFF0C;&#x671F;&#x5F85;&#x6211;&#x4EEC;&#x628A;&#x4FE1;&#x606F;&#x65E0;&#x969C;&#x788D;&#x690D;&#x5165;&#x5230;&#x7F51;&#x7EDC;&#x4E2D;&#x3002;</p>
<p>&#x6211;&#x8F6C;&#x4E86;&#x51E0;&#x6BB5;&#x51E0;&#x4F4D;&#x89C6;&#x969C;&#x670B;&#x53CB;&#x4EBA;&#x8BF4;&#x8FC7;&#x7684;&#x8BDD;&#xFF1A;</p>
<p>&#x987E;&#x4F36;&#x78CA;&#xFF1A; </p>
<blockquote>
<p>&#x5728;&#x4E2D;&#x56FD;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x4EA7;&#x54C1;&#x7684;&#x65E0;&#x969C;&#x788D;&#x5316;&#x8FD8;&#x975E;&#x5E38;&#x9065;&#x8FDC;&#xFF0C;&#x6CA1;&#x6709;&#x51E0;&#x4E2A;&#x4EBA;&#x80FD;&#x771F;&#x6B63;&#x7406;&#x89E3;&#x65E0;&#x969C;&#x788D;&#x5316;&#x7684;&#x542B;&#x4E49;&#x3002;&#x5F53;&#x4F60;&#x8FD8;&#x628A;&#x65E0;&#x969C;&#x788D;&#x5F53;&#x6210;&#x4E00;&#x9879;&#x7231;&#x5FC3;&#x4E8B;&#x4E1A;&#x5728;&#x505A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x5C31;&#x5DF2;&#x7ECF;&#x6CE8;&#x5B9A;&#x5931;&#x8D25;&#x4E86;&#x3002;</p>
<p>&#x65E0;&#x969C;&#x788D;&#x53EF;&#x7528;&#x6027;&#x672C;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x9879;&#x89C4;&#x8303;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x5411;&#x7231;&#x5FC3;&#x4E8B;&#x4E1A;&#x3002;&#x5982;&#x679C;&#x4F60;&#x628A;&#x4ED6;&#x5F53;&#x6210;&#x7231;&#x5FC3;&#x4E8B;&#x4E1A;&#x53BB;&#x505A;&#xFF0C;&#x662F;&#x6CE8;&#x5B9A;&#x4E0D;&#x4F1A;&#x957F;&#x4E45;&#x7684;&#x3002;&#x5728;&#x6B64;&#x6211;&#x4EEC;&#x547C;&#x5401;&#xFF0C;&#x5404;&#x5927;&#x4E92;&#x8054;&#x7F51;&#x4F01;&#x4E1A;&#x548C;&#x4EA7;&#x54C1;&#x5F00;&#x53D1;&#x4EEC;&#xFF0C;&#x80FD;&#x5E2E;&#x5FD9;&#x63A8;&#x52A8;&#x65E0;&#x969C;&#x788D;&#x7684;&#x89C4;&#x8303;&#x5316;&#xFF0C;&#x5C06;&#x65E0;&#x969C;&#x788D;&#x53EF;&#x7528;&#x6027;&#x5217;&#x5165;&#x4EA7;&#x54C1;&#x5F00;&#x53D1;&#x7684;&#x89C4;&#x8303;&#x4E2D;&#x3002;</p>
</blockquote>
<p>&#x4E1C;&#x4E1C;&#x4FDD;2011&#xFF1A;</p>
<blockquote>
<p>&#x73B0;&#x5728;&#x5F88;&#x591A;&#x4F01;&#x4E1A;&#x628A;&#x4F5C;&#x65E0;&#x969C;&#x788D;&#x770B;&#x6210;&#x662F;&#x4E00;&#x79CD;&#x65BD;&#x820D;&#xFF0C;&#x800C;&#x5E76;&#x975E;&#x662F;&#x4E00;&#x79CD;&#x89C4;&#x8303;&#x548C;&#x4E49;&#x52A1;&#x3002;</p>
</blockquote>
<p>&#x53F2;&#x660E;&#x660E;-&#x767E;&#x5E74;&#x5B64;&#x72EC;&#xFF1A;</p>
<blockquote>
<p>&#x505A;&#x65E0;&#x969C;&#x788D;&#x4E0D;&#x8BE5;&#x88AB;&#x5F53;&#x6210;&#x662F;&#x505A;&#x5DE5;&#x827A;&#x3001;&#x6148;&#x5584;&#x3001;&#x65BD;&#x820D;&#xFF0C;&#x76F8;&#x4FE1;&#x65E0;&#x969C;&#x788D;&#x7684;&#x76F8;&#x5173;&#x6CD5;&#x5F8B;&#x6CD5;&#x89C4;&#x4E00;&#x5B9A;&#x4F1A;&#x51FA;&#x53F0;&#x3002;</p>
</blockquote>
<p>&#x9EC4;&#x9F99;&#x5C0F;&#x751F;&#xFF1A;</p>
<blockquote>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x65E0;&#x969C;&#x788D;&#x5B83;&#x4F53;&#x73B0;&#x4E86;&#x4EBA;&#x4E0E;&#x4EBA;&#x4E4B;&#x95F4;&#x7684;&#x5E73;&#x7B49;&#xFF0C;&#x65E0;&#x969C;&#x788D;&#x4E4B;&#x6240;&#x4EE5;&#x6709;&#x969C;&#x788D;&#x8868;&#x9762;&#x4E43;&#x662F;&#x7A0B;&#x5E8F;&#x548C;&#x5DE5;&#x4F5C;&#x95EE;&#x9898;&#xFF0C;&#x5F80;&#x6DF1;&#x4E86;&#x8BF4;&#x5374;&#x662F;&#x4EBA;&#x6027;&#x4E0D;&#x5E73;&#x7B49;&#x7684;&#x4E00;&#x9762;&#x5728;&#x4F5C;&#x602A;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x5929;&#x671D;&#x5927;&#x5BB6;&#x8BA4;&#x4E3A;&#x505A;&#x4E86;&#x8FD9;&#x4E8B;&#x60C5;&#x4E43;&#x662F;&#x516C;&#x76CA;&#x4E8B;&#x4E1A;&#x4E43;&#x662F;&#x884C;&#x5584;&#x4E8B;&#xFF0C;&#x53EF;&#x662F;&#x5728;&#x4EBA;&#x5BB6;&#x90A3;&#x91CC;&#xFF0C;&#x8FD9;&#x4E9B;&#x672C;&#x6765;&#x5C31;&#x662F;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#x4E2D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x800C;&#x5DF2;&#x3002;&#x6B8B;&#x969C;&#x4EBA;&#x8EAB;&#x6709;&#x6B8B;&#x969C;&#xFF0C;&#x53EF;&#x662F;&#x5728;&#x8FD9;&#x91CC;&#x5374;&#x53D8;&#x5F97;&#x667A;&#x6709;&#x6B8B;&#x969C;&#x4E86;&#x3002;</p>
</blockquote>
<p>&#x4EE5;&#x53CA;&#x4E00;&#x4F4D; <a href="http://www.qt.hk/about/" target="_blank" rel="external">&#x76F2;&#x4EBA;&#x6280;&#x672F;&#x5F00;&#x53D1;&#x8005;</a> &#x7684;&#x89C2;&#x70B9;&#xFF1A;</p>
<blockquote>
<p>&#x4FE1;&#x606F;&#x65E0;&#x969C;&#x788D;&#x7684;&#x76EE;&#x7684;&#x5728;&#x4E8E;&#x8BA9;&#x6240;&#x6709;&#x4EBA;&#x5305;&#x62EC;&#x6B8B;&#x969C;&#x4EBA;&#x3001;&#x8001;&#x5E74;&#x4EBA;&#x3001;&#x513F;&#x7AE5;&#x7B49;&#x90FD;&#x53EF;&#x4EE5;&#x5F88;&#x65B9;&#x4FBF;&#x7684;&#x5E73;&#x7B49;&#x7684;&#x83B7;&#x53D6;&#x4FE1;&#x606F;&#x3002;&#x76EE;&#x524D;&#x56FD;&#x5185;&#x7684;&#x73B0;&#x72B6;&#x662F;&#x4EBA;&#x4EEC;&#x666E;&#x904D;&#x7F3A;&#x4E4F;&#x5BF9;&#x65E0;&#x969C;&#x788D;&#x7684;&#x7406;&#x89E3;&#x548C;&#x8BA4;&#x8BC6;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x7F3A;&#x5C11;&#x6709;&#x6548;&#x7684;&#x6CD5;&#x5F8B;&#x652F;&#x6301;&#x3002;</p><p>&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#x666E;&#x53CA;&#x65E0;&#x969C;&#x788D;&#x610F;&#x8BC6;&#x3002;&#x63A8;&#x52A8;&#x4FE1;&#x606F;&#x65E0;&#x969C;&#x788D;&#x662F;&#x4E2A;&#x957F;&#x671F;&#x7684;&#x6301;&#x7EED;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p><p>&#x73B0;&#x5728;&#x5927;&#x591A;&#x6570;&#x7684;&#x4FE1;&#x606F;&#x969C;&#x788D;&#x6765;&#x6E90;&#x4E8E;&#x4FE1;&#x606F;&#x63D0;&#x4F9B;&#x8005;&#x3002;&#x4E92;&#x8054;&#x7F51;&#x4FE1;&#x606F;&#x969C;&#x788D;&#x4E3B;&#x8981;&#x6765;&#x81EA;&#x4E8E;&#x7F51;&#x7AD9;&#x548C;&#x8F6F;&#x4EF6;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x3002;</p><p>&#x8FD9;&#x51E0;&#x5E74;&#x6765;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x4E0E;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8005;&#x4EA4;&#x6D41;&#xFF0C;&#x6700;&#x5927;&#x7684;&#x611F;&#x89E6;&#x662F;&#xFF0C;&#x4ED6;&#x4EEC;&#x662F;&#x6709;&#x7231;&#x5FC3;&#x7684;&#xFF0C;&#x662F;&#x613F;&#x610F;&#x505A;&#x65E0;&#x969C;&#x788D;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x552F;&#x4E00;&#x7F3A;&#x4E4F;&#x7684;&#x662F;&#x65E0;&#x969C;&#x788D;&#x610F;&#x8BC6;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x4ED6;&#x4EEC;&#x7684;&#x4EA7;&#x54C1;&#x4F1A;&#x7ED9;&#x6B8B;&#x969C;&#x4EBA;&#x5E26;&#x6765;&#x9EBB;&#x70E6;&#x3002;&#x800C;&#x4E00;&#x65E6;&#x4ED6;&#x4EEC;&#x4E86;&#x89E3;&#x5230;&#x8FD9;&#x4E9B;&#x969C;&#x788D;&#x4E4B;&#x540E;&#xFF0C;&#x90FD;&#x662F;&#x5F88;&#x613F;&#x610F;&#x8FDB;&#x884C;&#x6539;&#x8FDB;&#x7684;&#x3002;</p><p>&#x6240;&#x4EE5;&#xFF0C;&#x666E;&#x53CA;&#x65E0;&#x969C;&#x788D;&#x610F;&#x8BC6;&#xFF0C;&#x4ECE;&#x5F00;&#x53D1;&#x8005;&#x5165;&#x624B;&#x662F;&#x6700;&#x76F4;&#x63A5;&#x3001;&#x6700;&#x6709;&#x6548;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>

</blockquote>
<p>&#x65E0;&#x969C;&#x788D;&#x6280;&#x672F;&#x5E76;&#x6CA1;&#x6709;&#x5F88;&#x96BE;&#xFF0C;&#x53EA;&#x662F;&#x6211;&#x4EEC;&#x6CA1;&#x628A;&#x8FD9;&#x4EF6;&#x4E8B;&#x5F53;&#x56DE;&#x4E8B;&#x3002;&#x540E;&#x7EED;&#x6211;&#x4F1A;&#x53D1;&#x5E03;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#x65E0;&#x969C;&#x788D;&#x76F8;&#x5173;&#x7684;&#x6280;&#x672F;&#x7814;&#x7A76;&#x6587;&#x7AE0;&#xFF0C;&#x5E0C;&#x671B;&#x53EF;&#x4EE5;&#x5E26;&#x52A8;&#x4E00;&#x90E8;&#x5206;&#x4EBA;&#x4E00;&#x8D77;&#x505A;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x3002;</p></div>
</div>

</body>
</html>