<!DOCTYPE html>
<html>
<head>
  
  <title>&#x4E09;&#x79CD;&#x89E3;&#x5BC6; HTTPS &#x6D41;&#x91CF;&#x7684;&#x65B9;&#x6CD5;&#x4ECB;&#x7ECD;</title>
  
</head>
<body>

<div id="wrap">
  <h1>&#x4E09;&#x79CD;&#x89E3;&#x5BC6; HTTPS &#x6D41;&#x91CF;&#x7684;&#x65B9;&#x6CD5;&#x4ECB;&#x7ECD;</h1>
  <div id="content"><p>Web &#x5B89;&#x5168;&#x662F;&#x4E00;&#x9879;&#x7CFB;&#x7EDF;&#x5DE5;&#x7A0B;&#xFF0C;&#x4EFB;&#x4F55;&#x7EC6;&#x5FAE;&#x758F;&#x5FFD;&#x90FD;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x6574;&#x4E2A;&#x5B89;&#x5168;&#x5821;&#x5792;&#x571F;&#x5D29;&#x74E6;&#x89E3;&#x3002;&#x62FF; HTTPS &#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x7684;&#x300C;&#x5185;&#x5BB9;&#x52A0;&#x5BC6;&#x3001;&#x6570;&#x636E;&#x5B8C;&#x6574;&#x6027;&#x3001;&#x8EAB;&#x4EFD;&#x8BA4;&#x8BC1;&#x300D;&#x4E09;&#x5927;&#x5B89;&#x5168;&#x4FDD;&#x8BC1;&#xFF0C;&#x4E5F;&#x4F1A;&#x53D7;&#x5230;&#x975E;&#x6CD5;&#x6839;&#x8BC1;&#x4E66;&#x3001;&#x670D;&#x52A1;&#x7AEF;&#x914D;&#x7F6E;&#x9519;&#x8BEF;&#x3001;SSL &#x5E93;&#x6F0F;&#x6D1E;&#x3001;&#x79C1;&#x94A5;&#x88AB;&#x76D7;&#x7B49;&#x7B49;&#x98CE;&#x9669;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x5F88;&#x591A;&#x540C;&#x5B66;&#x8BA4;&#x4E3A;&#x53EA;&#x8981;&#x8BBF;&#x95EE;&#x7684;&#x7F51;&#x7AD9;&#x5730;&#x5740;&#x524D;&#x6709;&#x4E00;&#x628A;&#x5C0F;&#x7EFF;&#x9501;&#x5C31;&#x7EDD;&#x5BF9;&#x5B89;&#x5168;&#xFF0C;&#x5176;&#x5B9E;&#x4E0D;&#x7136;&#x3002;&#x672C;&#x6587;&#x901A;&#x8FC7;&#x4ECB;&#x7ECD;&#x4E09;&#x79CD;&#x6700;&#x5E38;&#x89C4;&#x7684; HTTPS &#x6D41;&#x91CF;&#x89E3;&#x5BC6;&#x65B9;&#x6CD5;&#x53CA;&#x539F;&#x7406;&#xFF0C;&#x6D45;&#x8C08;&#x4E00;&#x4E0B; HTTPS &#x7684;&#x5B89;&#x5168;&#x98CE;&#x9669;&#x3002;</p>
<h3 id="man-in-the-middle">Man-in-the-middle</h3>
<p>Man-in-the-middle&#xFF08;&#x4E2D;&#x95F4;&#x4EBA;&#xFF0C;&#x7B80;&#x79F0;&#x4E3A; MITM&#xFF09;&#xFF0C;&#x80FD;&#x591F;&#x4E0E;&#x7F51;&#x7EDC;&#x901A;&#x8BAF;&#x4E24;&#x7AEF;&#x5206;&#x522B;&#x521B;&#x5EFA;&#x8FDE;&#x63A5;&#xFF0C;&#x4EA4;&#x6362;&#x5176;&#x6536;&#x5230;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F7F;&#x5F97;&#x901A;&#x8BAF;&#x4E24;&#x7AEF;&#x90FD;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x76F4;&#x63A5;&#x4E0E;&#x5BF9;&#x65B9;&#x5BF9;&#x8BDD;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x6574;&#x4E2A;&#x4F1A;&#x8BDD;&#x90FD;&#x88AB;&#x4E2D;&#x95F4;&#x4EBA;&#x6240;&#x63A7;&#x5236;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5728;&#x771F;&#x6B63;&#x7684;&#x670D;&#x52A1;&#x7AEF;&#x770B;&#x6765;&#xFF0C;&#x4E2D;&#x95F4;&#x4EBA;&#x662F;&#x5BA2;&#x6237;&#x7AEF;&#xFF1B;&#x800C;&#x771F;&#x6B63;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x4F1A;&#x8BA4;&#x4E3A;&#x4E2D;&#x95F4;&#x4EBA;&#x662F;&#x670D;&#x52A1;&#x7AEF;&#x3002;</p>
<p>&#x5B9E;&#x73B0;&#x4E2D;&#x95F4;&#x4EBA;&#x653B;&#x51FB;&#x6709;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x624B;&#x6BB5;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x5C55;&#x5F00;&#x8BA8;&#x8BBA;&#x3002;&#x4E00;&#x4E9B;&#x5E38;&#x89C1;&#x7684; HTTP/HTTPS &#x6293;&#x5305;&#x8C03;&#x8BD5;&#x5DE5;&#x5177;&#xFF0C;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x521B;&#x5EFA;&#x672C;&#x5730; Proxy &#x670D;&#x52A1;&#xFF0C;&#x518D;&#x4FEE;&#x6539;&#x6D4F;&#x89C8;&#x5668; Proxy &#x8BBE;&#x7F6E;&#x6765;&#x8FBE;&#x5230;&#x62E6;&#x622A;&#x6D41;&#x91CF;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x4E0E;&#x4E2D;&#x95F4;&#x4EBA;&#x653B;&#x51FB;&#x4E00;&#x81F4;&#x3002;&#x6211;&#x7528;&#x8FC7;&#x7684;&#x8FD9;&#x4E00;&#x7C7B;&#x5DE5;&#x5177;&#x6709;&#xFF1A;<a href="http://www.telerik.com/fiddler/">Fiddler</a>&#x3001;<a href="https://www.charlesproxy.com/">Charles</a> &#x548C; <a href="https://github.com/avwo/whistle/">whistle</a>&#x3002;&#x6211;&#x5728;&#x300C;<a href="https://imququ.com/post/web-proxy.html#toc-0">HTTP &#x4EE3;&#x7406;&#x539F;&#x7406;&#x53CA;&#x5B9E;&#x73B0;&#xFF08;&#x4E00;&#xFF09;</a>&#x300D;&#x4E00;&#x6587;&#x4E2D;&#x4ECB;&#x7ECD;&#x7684; HTTP &#x666E;&#x901A;&#x4EE3;&#x7406;&#xFF0C;&#x626E;&#x6F14;&#x7684;&#x5C31;&#x662F; HTTP &#x4E2D;&#x95F4;&#x4EBA;&#x89D2;&#x8272;&#x3002;</p>
<p>&#x672C;&#x6587;&#x4E3B;&#x8981;&#x8BA8;&#x8BBA; HTTPS &#x4E2D;&#x95F4;&#x4EBA;&#xFF0C;&#x7B80;&#x5355;&#x793A;&#x610F;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>Server &lt;---&gt; Local Proxy &lt;---&gt; Browser
         ^                 ^
       HTTPS(1)          HTTPS(2)
</code></pre><p>&#x4E0A;&#x8FF0; HTTPS(1) &#x8FDE;&#x63A5;&#xFF0C;&#x662F;&#x4E2D;&#x95F4;&#x4EBA;&#x5192;&#x5145;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x4E0E;&#x670D;&#x52A1;&#x7AEF;&#x5EFA;&#x7ACB;&#x7684;&#x8FDE;&#x63A5;&#xFF0C;&#x7531;&#x4E8E; HTTPS &#x670D;&#x52A1;&#x7AEF;&#x4E00;&#x822C;&#x4E0D;&#x8BA4;&#x8BC1;&#x5BA2;&#x6237;&#x7AEF;&#x8EAB;&#x4EFD;&#xFF0C;&#x8FD9;&#x4E00;&#x6B65;&#x901A;&#x5E38;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x3002;&#x800C;&#x5BF9;&#x4E8E; HTTPS(2) &#x8FDE;&#x63A5;&#x6765;&#x8BF4;&#xFF0C;&#x4E2D;&#x95F4;&#x4EBA;&#x60F3;&#x8981;&#x5192;&#x5145;&#x670D;&#x52A1;&#x7AEF;&#xFF0C;&#x5FC5;&#x987B;&#x62E5;&#x6709;&#x5BF9;&#x5E94;&#x57DF;&#x540D;&#x7684;&#x8BC1;&#x4E66;&#x79C1;&#x94A5;&#xFF0C;&#x800C;&#x653B;&#x51FB;&#x8005;&#x8981;&#x62FF;&#x5230;&#x79C1;&#x94A5;&#xFF0C;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x624B;&#x6BB5;&#xFF1A;1&#xFF09;&#x53BB;&#x7F51;&#x7AD9;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x62FF;&#xFF1B;2&#xFF09;&#x4ECE; CA &#x5904;&#x7B7E;&#x53D1;&#x8BC1;&#x4E66;&#xFF1B;3&#xFF09;&#x81EA;&#x5DF1;&#x7B7E;&#x53D1;&#x8BC1;&#x4E66;&#x3002;</p>
<p>&#x8981;&#x9632;&#x8303;&#x524D;&#x4E24;&#x70B9;&#xFF0C;&#x9700;&#x8981;&#x7F51;&#x7AD9;&#x505A;&#x597D;&#x5404;&#x4E2A;&#x65B9;&#x9762;&#x7684;&#x5B89;&#x5168;&#x9632;&#x62A4;&#xFF0C;&#x4ECE;&#x4E3B;&#x673A;&#x5B89;&#x5168;&#x5230;&#x7F51;&#x7AD9;&#x5B89;&#x5168;&#xFF08;&#x907F;&#x514D;&#x79C1;&#x94A5;&#x88AB;&#x76D7;&#xFF09;&#xFF0C;&#x4ECE;&#x57DF;&#x540D;&#x89E3;&#x6790;&#x5B89;&#x5168;&#x5230;&#x57DF;&#x540D;&#x90AE;&#x7BB1;&#x5B89;&#x5168;&#xFF08;&#x907F;&#x514D;&#x653B;&#x51FB;&#x8005;&#x91CD;&#x7B7E;&#x8BC1;&#x4E66;&#xFF09;&#x3002;&#x800C;&#x653B;&#x51FB;&#x8005;&#x81EA;&#x5DF1;&#x7B7E;&#x53D1;&#x7684;&#x8BC1;&#x4E66;&#xFF0C;&#x65E0;&#x6CD5;&#x901A;&#x8FC7;&#x7CFB;&#x7EDF;&#x5185;&#x7F6E;&#x6839;&#x8BC1;&#x4E66;&#x7684;&#x9A8C;&#x8BC1;&#xFF0C;&#x9ED8;&#x8BA4;&#x65E0;&#x6CD5;&#x7528;&#x4E8E;&#x4E2D;&#x95F4;&#x4EBA;&#x653B;&#x51FB;&#x3002;</p>
<p>&#x5BF9;&#x4E8E; Fiddler &#x8FD9;&#x4E00;&#x7C7B;&#x8C03;&#x8BD5;&#x5DE5;&#x5177;&#x6765;&#x8BF4;&#xFF0C;&#x80FD;&#x591F;&#x89E3;&#x5BC6; HTTPS &#x6D41;&#x91CF;&#x7684;&#x5173;&#x952E;&#x5728;&#x4E8E;&#x4ED6;&#x4EEC;&#x4F1A;&#x5F80;&#x7CFB;&#x7EDF;&#x53D7;&#x4FE1;&#x4EFB;&#x7684;&#x6839;&#x8BC1;&#x4E66;&#x5217;&#x8868;&#x5BFC;&#x5165;&#x81EA;&#x5DF1;&#x7684;&#x8BC1;&#x4E66;&#xFF0C;&#x8FD9;&#x6837;&#x4ED6;&#x4EEC;&#x7684;&#x81EA;&#x7B7E;&#x8BC1;&#x4E66;&#x5C31;&#x80FD;&#x88AB;&#x6D4F;&#x89C8;&#x5668;&#x4FE1;&#x4EFB;&#x3002;&#x8FDB;&#x5165; Fiddler &#x8BBE;&#x7F6E;&#x4E2D;&#x7684;&#x300C;HTTPS&#x300D;Tab&#xFF0C;&#x52FE;&#x9009;&#x76F8;&#x5173;&#x529F;&#x80FD;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x987A;&#x5229;&#x89E3;&#x5BC6;&#x548C;&#x4FEE;&#x6539; HTTPS &#x6D41;&#x91CF;&#x3002;&#x8FD9;&#x65F6;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x8BC1;&#x4E66;&#x94FE;&#xFF1A;</p>
<p><img alt="fiddler root" src="https://st.imququ.com/static/uploads/2016/03/fiddler_root.png" itemprop="image" width="450" height="320"></p>
<h3 id="rsa-private-key">RSA Private Key</h3>
<p>&#x6211;&#x5728;&#x300C;<a href="https://imququ.com/post/http2-traffic-in-wireshark.html">&#x4F7F;&#x7528; Wireshark &#x8C03;&#x8BD5; HTTP/2 &#x6D41;&#x91CF;</a>&#x300D;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#x5199;&#x5230;&#xFF1A;Wireshark &#x7684;&#x6293;&#x5305;&#x539F;&#x7406;&#x662F;&#x76F4;&#x63A5;&#x8BFB;&#x53D6;&#x5E76;&#x5206;&#x6790;&#x7F51;&#x5361;&#x6570;&#x636E;&#xFF0C;&#x8981;&#x60F3;&#x8BA9;&#x5B83;&#x89E3;&#x5BC6; HTTPS &#x6D41;&#x91CF;&#xFF0C;&#x6709;&#x4E24;&#x4E2A;&#x529E;&#x6CD5;&#xFF1A;1&#xFF09;&#x5982;&#x679C;&#x4F60;&#x62E5;&#x6709; HTTPS &#x7F51;&#x7AD9;&#x7684;&#x52A0;&#x5BC6;&#x79C1;&#x94A5;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x89E3;&#x5BC6;&#x8FD9;&#x4E2A;&#x7F51;&#x7AD9;&#x7684;&#x52A0;&#x5BC6;&#x6D41;&#x91CF;&#xFF1B;2&#xFF09;&#x67D0;&#x4E9B;&#x6D4F;&#x89C8;&#x5668;&#x652F;&#x6301;&#x5C06; TLS &#x4F1A;&#x8BDD;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x5BF9;&#x79F0;&#x5BC6;&#x94A5;&#x4FDD;&#x5B58;&#x5728;&#x5916;&#x90E8;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x53EF;&#x4F9B; Wireshark &#x52A0;&#x5BC6;&#x4F7F;&#x7528;&#x3002;&#x90A3;&#x7BC7;&#x6587;&#x7AE0;&#x4ECB;&#x7ECD;&#x4E86;&#x7B2C;&#x4E8C;&#x79CD;&#x65B9;&#x6848;&#xFF0C;&#x672C;&#x6587;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x7B2C;&#x4E00;&#x79CD;&#x3002;</p>
<p>&#x6253;&#x5F00; Wireshark &#x7684; SSL &#x534F;&#x8BAE;&#x8BBE;&#x7F6E;&#xFF0C;&#x53C2;&#x8003;&#x4E0B;&#x56FE;&#xFF0C;&#x628A; IP&#x3001;&#x7AEF;&#x53E3;&#x3001;&#x534F;&#x8BAE;&#x548C;&#x8BC1;&#x4E66;&#x79C1;&#x94A5;&#x90FD;&#x914D;&#x4E0A;&#xFF08;&#x79C1;&#x94A5;&#x5FC5;&#x987B;&#x5B58;&#x4E3A; PEM &#x683C;&#x5F0F;&#xFF09;&#xFF1A;</p>
<p><img alt="wireshark ssl config" src="https://st.imququ.com/static/uploads/2016/03/wireshark_ssl_config.png" itemprop="image" width="700" height="490"></p>
<p>&#x7136;&#x540E;&#x8BBF;&#x95EE;&#x79C1;&#x94A5;&#x5BF9;&#x5E94;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6D41;&#x91CF;&#x5DF2;&#x88AB;&#x89E3;&#x5BC6;&#xFF1A;</p>
<p><img alt="decrypt http1 over tls" src="https://st.imququ.com/static/uploads/2016/03/decrypt_http1_over_tls.png" itemprop="image" width="510" height="356"></p>
<p>&#x622A;&#x56FE;&#x4E2D;&#x7684;&#x52A0;&#x5BC6;&#x6570;&#x636E;&#x662F;&#x4EE5; HTTP/1 &#x4F20;&#x8F93;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x80FD;&#x89E3;&#x5BC6; HTTP/2 &#x6D41;&#x91CF;&#x5417;&#xFF1F;&#x7ED3;&#x8BBA;&#x662F;&#xFF1A;&#x4E0D;&#x80FD;&#xFF01;&#x5177;&#x4F53;&#x539F;&#x56E0;&#x4E0B;&#x9762;&#x6162;&#x6162;&#x5206;&#x6790;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;TLS &#x63E1;&#x624B;&#x9636;&#x6BB5;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x548C;&#x670D;&#x52A1;&#x7AEF;&#x8BA4;&#x8BC1;&#x8FD9;&#x4E24;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x662F;&#x4E3A;&#x4E86;&#x5728;&#x4E0D;&#x5B89;&#x5168;&#x6570;&#x636E;&#x901A;&#x9053;&#x4E2D;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x53EA;&#x6709;&#x901A;&#x4FE1;&#x53CC;&#x65B9;&#x77E5;&#x9053;&#x7684;&#x5171;&#x4EAB;&#x5BC6;&#x94A5; Premaster Secret&#xFF0C;&#x8FDB;&#x800C;&#x751F;&#x6210; Master Secret &#x4EE5;&#x53CA;&#x540E;&#x7EED;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6; Session Key &#x548C; MAC Key&#x3002;&#x800C;&#x5BA2;&#x6237;&#x7AEF;&#x8FDB;&#x884C;&#x670D;&#x52A1;&#x7AEF;&#x8BA4;&#x8BC1;&#x7684;&#x76EE;&#x7684;&#x662F;&#x786E;&#x4FDD;&#x8FDE;&#x63A5;&#x5230;&#x62E5;&#x6709;&#x7F51;&#x7AD9;&#x79C1;&#x94A5;&#x7684;&#x5408;&#x6CD5;&#x670D;&#x52A1;&#x5668;&#x3002;</p>
<p>&#x6700;&#x5E38;&#x89C1;&#x7684;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x65B9;&#x5F0F;&#x662F; RSA&#xFF0C;&#x4E0B;&#x9762;&#x8FD9;&#x5F20;&#x56FE;&#x6E05;&#x6670;&#x7684;&#x63CF;&#x8FF0;&#x4E86;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<p><img alt="ssl handshake rsa" src="https://st.imququ.com/static/uploads/2016/03/ssl_handshake_rsa.png" itemprop="image" width="700" height="436"><a href="https://blog.cloudflare.com/keyless-ssl-the-nitty-gritty-technical-details/">&#x56FE;&#x7247;&#x6765;&#x6E90;</a></p>
<p>Client Random &#x548C; Server Random &#x660E;&#x6587;&#x4F20;&#x8F93;&#xFF0C;&#x4E2D;&#x95F4;&#x4EBA;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x67E5;&#x770B;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x751F;&#x6210; Premaster Secret &#x540E;&#xFF0C;&#x7528;&#x670D;&#x52A1;&#x7AEF;&#x8BC1;&#x4E66;&#x516C;&#x94A5;&#x52A0;&#x5BC6;&#x540E;&#x53D1;&#x9001;&#xFF0C;&#x5982;&#x679C;&#x670D;&#x52A1;&#x7AEF;&#x62E5;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x79C1;&#x94A5;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6210;&#x529F;&#x89E3;&#x5BC6;&#x5F97;&#x5230; Premaster Secret&#x3002;&#x8FD9;&#x65F6;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x7AEF;&#x62E5;&#x6709;&#x76F8;&#x540C;&#x7684; Client Random&#x3001;Server Random &#x548C; Premaster Secret&#xFF0C;&#x53EF;&#x4EE5;&#x5404;&#x81EA;&#x7B97;&#x51FA;&#x76F8;&#x540C;&#x7684;&#x540E;&#x7EED;&#x6240;&#x9700; Key&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5408;&#x5E76;&#x4E86;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x548C;&#x670D;&#x52A1;&#x7AEF;&#x8BA4;&#x8BC1;&#x4E24;&#x4E2A;&#x6B65;&#x9AA4;&#xFF0C;&#x5982;&#x679C;&#x670D;&#x52A1;&#x7AEF;&#x80FD;&#x89E3;&#x5BC6; Premaster Secret&#xFF0C;&#x4E5F;&#x5C31;&#x610F;&#x5473;&#x7740;&#x670D;&#x52A1;&#x7AEF;&#x62E5;&#x6709;&#x6B63;&#x786E;&#x7684;&#x79C1;&#x94A5;&#x3002;&#x4E2D;&#x95F4;&#x4EBA;&#x6CA1;&#x6709;&#x79C1;&#x94A5;&#xFF0C;&#x65E0;&#x6CD5;&#x5F97;&#x5230; Premaster Secret&#xFF0C;&#x4E5F;&#x5C31;&#x65E0;&#x6CD5;&#x89E3;&#x5BC6;&#x540E;&#x7EED;&#x6D41;&#x91CF;&#x3002;</p>
<p>&#x5BF9;&#x4E8E; Wireshark &#x6765;&#x8BF4;&#xFF0C;&#x914D;&#x7F6E;&#x67D0;&#x4E2A;&#x7F51;&#x7AD9;&#x7684;&#x79C1;&#x94A5;&#x540E;&#xFF0C;&#x80FD;&#x89E3;&#x5BC6;&#x8FD9;&#x4E2A;&#x7F51;&#x7AD9;&#x300C;&#x4F7F;&#x7528; RSA &#x8FDB;&#x884C;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x300D;&#x7684;&#x52A0;&#x5BC6;&#x6D41;&#x91CF;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x4E86;&#x3002;</p>
<p>&#x663E;&#x7136;&#xFF0C;RSA &#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x6CA1;&#x6709;&#x524D;&#x5411;&#x5B89;&#x5168;&#x6027;&#xFF08;Forward Secrecy&#xFF09;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x653B;&#x51FB;&#x8005;&#x53EF;&#x4EE5;&#x628A;&#x76D1;&#x542C;&#x5230;&#x7684;&#x52A0;&#x5BC6;&#x6D41;&#x91CF;&#x5148;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x540E;&#x7EED;&#x4E00;&#x65E6;&#x62FF;&#x5230;&#x4E86;&#x79C1;&#x94A5;&#xFF0C;&#x4E4B;&#x524D;&#x6240;&#x6709;&#x6D41;&#x91CF;&#x90FD;&#x53EF;&#x4EE5;&#x6210;&#x529F;&#x89E3;&#x5BC6;&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x76EE;&#x524D;&#x5927;&#x90E8;&#x5206; HTTPS &#x6D41;&#x91CF;&#x7528;&#x7684;&#x90FD;&#x662F; ECDHE &#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x3002;ECDHE &#x662F;&#x4F7F;&#x7528;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#xFF08;ECC&#xFF09;&#x7684; DH&#xFF08;Diffie-Hellman&#xFF09;&#x7B97;&#x6CD5;&#x3002;&#x4E0B;&#x56FE;&#x662F; DH &#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<p><img alt="ssl handshake diffie hellman" src="https://st.imququ.com/static/uploads/2016/03/ssl_handshake_diffie_hellman.png" itemprop="image" width="800" height="476"><a href="https://blog.cloudflare.com/keyless-ssl-the-nitty-gritty-technical-details/">&#x56FE;&#x7247;&#x6765;&#x6E90;</a></p>
<p>&#x4E0A;&#x56FE;&#x4E2D;&#x7684; Server DH Parameter &#x662F;&#x7528;&#x8BC1;&#x4E66;&#x79C1;&#x94A5;&#x7B7E;&#x540D;&#x7684;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x4F7F;&#x7528;&#x8BC1;&#x4E66;&#x516C;&#x94A5;&#x5C31;&#x53EF;&#x4EE5;&#x9A8C;&#x8BC1;&#x670D;&#x52A1;&#x7AEF;&#x5408;&#x6CD5;&#x6027;&#x3002;&#x76F8;&#x6BD4; RSA &#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#xFF0C;DH &#x7531;&#x4F20;&#x9012; Premaster Scret &#x53D8;&#x6210;&#x4E86;&#x4F20;&#x9012; DH &#x7B97;&#x6CD5;&#x6240;&#x9700;&#x7684; Parameter&#xFF0C;&#x7136;&#x540E;&#x53CC;&#x65B9;&#x5404;&#x81EA;&#x7B97;&#x51FA; Premaster Secret&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x7531;&#x4E8E; Premaster Secret &#x65E0;&#x9700;&#x4EA4;&#x6362;&#xFF0C;&#x4E2D;&#x95F4;&#x4EBA;&#x5C31;&#x7B97;&#x6709;&#x79C1;&#x94A5;&#x4E5F;&#x65E0;&#x6CD5;&#x83B7;&#x5F97; Premaster Secret &#x548C; Master Secret&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4; Wireshark &#x65E0;&#x6CD5;&#x901A;&#x8FC7;&#x914D;&#x7F6E; RSA Private Key &#x7684;&#x65B9;&#x5F0F;&#x89E3;&#x5BC6;&#x300C;&#x4F7F;&#x7528; ECDHE &#x8FDB;&#x884C;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x300D;&#x7684;&#x52A0;&#x5BC6;&#x6D41;&#x91CF;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4F7F;&#x7528; ECDHE &#x540E;&#xFF0C;&#x867D;&#x7136;&#x4E2D;&#x95F4;&#x4EBA;&#x62FF;&#x5230;&#x79C1;&#x94A5;&#x4E5F;&#x65E0;&#x6CD5;&#x89E3;&#x5BC6;&#x4E4B;&#x524D;&#x7684;&#x6D41;&#x91CF;&#xFF0C;&#x4F46;&#x4ED6;&#x53EF;&#x4EE5;&#x5B9E;&#x65BD; MITM &#x653B;&#x51FB;&#x6765;&#x89E3;&#x5BC6;&#x4E4B;&#x540E;&#x7684;&#x6D41;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x79C1;&#x94A5;&#x8FD8;&#x662F;&#x8981;&#x4FDD;&#x7BA1;&#x597D;&#x3002;</p>
<p>&#x76F8;&#x6BD4; RSA &#x65E2;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#xFF0C;&#x53C8;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF1B;ECC &#x8FD9;&#x8FB9;&#x5C31;&#x5206;&#x5F97;&#x6BD4;&#x8F83;&#x6E05;&#x695A;&#x4E86;&#xFF1A;ECDHE &#x7528;&#x4E8E;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#xFF0C;ECDSA &#x7528;&#x4E8E;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x76EE;&#x524D;&#x5BC6;&#x94A5;&#x4EA4;&#x6362; + &#x7B7E;&#x540D;&#x6709;&#x4E09;&#x79CD;&#x4E3B;&#x6D41;&#x9009;&#x62E9;&#xFF1A;</p>
<ul>
<li>RSA &#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x3001;RSA &#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF1B;</li>
<li>ECDHE &#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x3001;RSA &#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF1B;</li>
<li>ECDHE &#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x3001;ECDSA &#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF1B;</li>
</ul>
<p>&#x4EE5;&#x4E0B;&#x662F;&#x4F7F;&#x7528;&#x8FD9;&#x4E09;&#x79CD;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x65B9;&#x5F0F;&#x7684;&#x7F51;&#x7AD9;&#x5728; Chrome &#x4E2D;&#x7684;&#x622A;&#x56FE;&#xFF1A;</p>
<p><img alt="key exchange" src="https://st.imququ.com/static/uploads/2016/03/key_exchange.png" itemprop="image" width="790" height="356"></p>
<p>HTTP/2 &#x4E2D;&#x53EA;&#x80FD;&#x4F7F;&#x7528; TLSv1.2+&#xFF0C;&#x8FD8;&#x7981;&#x7528;&#x4E86;&#x51E0;&#x767E;&#x79CD; CipherSuite&#xFF08;&#x8BE6;&#x89C1;&#xFF1A;<a href="http://http2.github.io/http2-spec/#BadCipherSuites">TLS 1.2 Cipher Suite Black List</a>&#xFF09;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;HTTP/2 &#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x7684; CipherSuite &#x5FC5;&#x987B;&#x91C7;&#x7528;&#x5177;&#x6709;&#x524D;&#x5411;&#x5B89;&#x5168;&#x6027;&#x7684;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x7B97;&#x6CD5;&#xFF0C;&#x4E0D;&#x5141;&#x8BB8;&#x4F7F;&#x7528; RSA &#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48; RSA Private Key &#x65E0;&#x6CD5;&#x89E3;&#x5BC6; HTTP/2 &#x52A0;&#x5BC6;&#x6D41;&#x91CF;&#x3002;</p>
<h3 id="sslkeylogfile">SSLKEYLOGFILE</h3>
<p>Firefox &#x548C; Chrome &#x90FD;&#x4F1A;&#x5728;&#x7CFB;&#x7EDF;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x5B58;&#x5728; <code>SSLKEYLOGFILE</code> &#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#x65F6;&#xFF0C;&#x5C06;&#x6BCF;&#x4E2A; HTTPS &#x8FDE;&#x63A5;&#x4EA7;&#x751F;&#x7684; Premaster Secret &#x6216; Master Secret &#x5B58;&#x4E0B;&#x6765;&#x3002;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;Wireshark &#x5C31;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x89E3;&#x5BC6; HTTPS &#x6D41;&#x91CF;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x4F7F;&#x7528;&#x4E86; ECDHE &#x8FD9;&#x79CD;&#x5177;&#x6709;&#x524D;&#x5411;&#x5B89;&#x5168;&#x6027;&#x7684;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
<p><img alt="decrypt http2 over tls" src="https://st.imququ.com/static/uploads/2016/03/decrypt_http2_over_tls.png" itemprop="image" width="510" height="390"></p>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x6848;&#x7684;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x8BF7;&#x53C2;&#x8003;&#x300C;<a href="https://imququ.com/post/http2-traffic-in-wireshark.html">&#x4F7F;&#x7528; Wireshark &#x8C03;&#x8BD5; HTTP/2 &#x6D41;&#x91CF;</a>&#x300D;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x3002;</p>
<p><code>SSLKEYLOGFILE</code> &#x6587;&#x4EF6;&#x8BB0;&#x5F55;&#x7684;&#x662F; HTTPS &#x6570;&#x636E;&#x4F20;&#x8F93;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x52A0;&#x5BC6;&#x4FE1;&#x606F;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x51FA;&#x4E8E;&#x8C03;&#x8BD5;&#x76EE;&#x7684;&#xFF0C;&#x4E00;&#x822C;&#x4E5F;&#x6CA1;&#x4EBA;&#x4F1A;&#x4E3B;&#x52A8;&#x914D;&#x7F6E;&#x8FD9;&#x4E2A;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x57FA;&#x672C;&#x4E0D;&#x4F1A;&#x5BF9; HTTPS &#x5B89;&#x5168;&#x6027;&#x4EA7;&#x751F;&#x5F71;&#x54CD;&#x3002;</p>
<h3 id="-">&#x603B;&#x7ED3;</h3>
<p>Fiddler &#x8FD9;&#x7C7B;&#x5DE5;&#x5177;&#x901A;&#x8FC7;&#x5F80;&#x7CFB;&#x7EDF;&#x5BFC;&#x5165;&#x6839;&#x8BC1;&#x4E66;&#x6765;&#x5B9E;&#x73B0; HTTPS &#x6D41;&#x91CF;&#x89E3;&#x5BC6;&#xFF0C;&#x5145;&#x5F53;&#x4E2D;&#x95F4;&#x4EBA;&#x89D2;&#x8272;&#x3002;&#x8981;&#x9632;&#x8303;&#x771F;&#x6B63;&#x7684; HTTPS &#x4E2D;&#x95F4;&#x4EBA;&#x653B;&#x51FB;&#xFF0C;&#x7F51;&#x7AD9;&#x65B9;&#x9700;&#x8981;&#x4FDD;&#x7BA1;&#x597D;&#x81EA;&#x5DF1;&#x7684;&#x8BC1;&#x4E66;&#x79C1;&#x94A5;&#x548C;&#x57DF;&#x540D;&#x8BA4;&#x8BC1;&#x4FE1;&#x606F;&#xFF0C;&#x4E3A;&#x4E86;&#x9632;&#x8303;&#x4E0D;&#x826F; CA &#x975E;&#x6CD5;&#x5411;&#x7B2C;&#x4E09;&#x65B9;&#x7B7E;&#x53D1;&#x81EA;&#x5DF1;&#x7684;&#x7F51;&#x7AD9;&#x8BC1;&#x4E66;&#xFF0C;&#x8FD8;&#x8981;&#x5C3D;&#x53EF;&#x80FD;&#x542F;&#x7528; <a href="https://imququ.com/post/certificate-transparency.html">Certificate Transparency</a>&#x3001;<a href="https://imququ.com/post/http-public-key-pinning.html">HTTP Public Key Pinning</a> &#x7B49;&#x7B56;&#x7565;&#xFF1B;&#x7528;&#x6237;&#x65B9;&#x4E0D;&#x8981;&#x968F;&#x4FBF;&#x4FE1;&#x4EFB;&#x6765;&#x5386;&#x4E0D;&#x660E;&#x7684;&#x8BC1;&#x4E66;&#xFF0C;&#x66F4;&#x4E0D;&#x8981;&#x968F;&#x610F;&#x5BFC;&#x5165;&#x8BC1;&#x4E66;&#x5230;&#x6839;&#x8BC1;&#x4E66;&#x5217;&#x8868;&#xFF0C;&#x8FD8;&#x8981;&#x517B;&#x6210;&#x7ECF;&#x5E38;&#x68C0;&#x67E5;&#x5E38;&#x7528;&#x7F51;&#x7AD9;&#x8BC1;&#x4E66;&#x94FE;&#x7684;&#x4E60;&#x60EF;&#x3002;</p>
<p>RSA &#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x6CA1;&#x6709;&#x524D;&#x5411;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4E00;&#x65E6;&#x79C1;&#x94A5;&#x6CC4;&#x6F0F;&#xFF0C;&#x4E4B;&#x524D;&#x6240;&#x6709;&#x52A0;&#x5BC6;&#x6D41;&#x91CF;&#x90FD;&#x53EF;&#x4EE5;&#x89E3;&#x5F00;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x7F51;&#x7AD9;&#x65B9;&#x9700;&#x8981;&#x542F;&#x7528;&#x4F7F;&#x7528; ECDHE &#x4F5C;&#x4E3A;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x7684; CipherSuite&#xFF0C;&#x6216;&#x8005;&#x76F4;&#x63A5;&#x4F7F;&#x7528; ECC &#x8BC1;&#x4E66;&#xFF1B;&#x7528;&#x6237;&#x65B9;&#x9700;&#x8981;&#x5F03;&#x7528;&#x4E0D;&#x652F;&#x6301; ECDHE &#x7684;&#x53E4;&#x8463;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53CA;&#x6D4F;&#x89C8;&#x5668;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6D4F;&#x89C8;&#x5668;&#x800C;&#x8A00;&#xFF0C;HTTPS &#x6BEB;&#x65E0;&#x79D8;&#x5BC6;&#xFF0C;&#x901A;&#x8FC7;&#x6D4F;&#x89C8;&#x5668;&#x751F;&#x6210;&#x7684; <code>SSLKEYLOGFILE</code> &#x6587;&#x4EF6;&#xFF0C;Wireshark &#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x89E3;&#x5BC6; HTTPS &#x6D41;&#x91CF;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x6D4F;&#x89C8;&#x5668;&#x88AB;&#x5B89;&#x88C5;&#x6076;&#x610F;&#x6269;&#x5C55;&#xFF0C;&#x5373;&#x4F7F;&#x8BBF;&#x95EE;&#x5B89;&#x5168;&#x7684; HTTPS &#x7F51;&#x7AD9;&#xFF0C;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E;&#x4E00;&#x6837;&#x53EF;&#x4EE5;&#x88AB;&#x622A;&#x83B7;&#x3002;&#x8FD9;&#x79CD;&#x5BA2;&#x6237;&#x7AEF;&#x88AB;&#x653B;&#x51FB;&#x8005;&#x63A7;&#x5236;&#x5F15;&#x53D1;&#x7684;&#x5B89;&#x5168;&#x95EE;&#x9898;&#xFF0C;&#x65E0;&#x6CD5;&#x901A;&#x8FC7; HTTPS &#x6765;&#x89E3;&#x51B3;&#x3002;</p>
<p>&#x672C;&#x6587;&#x94FE;&#x63A5;&#xFF1A;<a href="https://imququ.com/post/how-to-decrypt-https.html">https://imququ.com/post/how-to-decrypt-https.html</a>&#xFF0C;<a href="https://imququ.com/post/how-to-decrypt-https.html#comments" target="_blank">&#x53C2;&#x4E0E;&#x8BA8;&#x8BBA;</a></p><p>&#x2665; &#x672C;&#x7AD9;&#x6240;&#x6709;&#x6587;&#x7AE0;&#x5747;&#x4E3A;&#x672C;&#x4EBA;&#x539F;&#x521B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8BA4;&#x4E3A;&#x6211;&#x7684;&#x6587;&#x7AE0;&#x5BF9;&#x4F60;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x6B22;&#x8FCE;&#x8D5E;&#x52A9;&#x672C;&#x7AD9;&#x3002;<a target="_blank" href="https://imququ.com/post/about.html#toc-2">&#x8BE6;&#x60C5;&#x8BF7;&#x70B9;&#x8FD9;&#x91CC; &#xBB;</a></p></div>
</div>

</body>
</html>